[
    {
        "Calculator ID": 2,
        "Calculator Name": "Creatinine Clearance (Cockcroft-Gault Equation)",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-6477550-1",
        "Note Type": "Extracted",
        "Patient Note": "A 16-year-old female adolescent was referred to our hospital with severe hypertension (systolic pressure 178 mmHg), which was first detected 7 months prior to presentation during a routine annual physical examination. She complained of intermittent headache for about 1 year, and her previous blood pressure, measured 1 month prior to her detection of hypertension, had been normal. She showed mild hypokalemia (3.4 mmol/L) in a routine blood test, and an additional workup considering secondary hypertension was planned. Despite taking amlodipine (0.1 mg/kg twice a day), her blood pressure remained uncontrolled.\nUpon admission to our hospital, her systolic and diastolic blood pressures were 155 mmHg (>99th percentile) and 111 mmHg (>99th percentile) respectively. She was 162.8 cm tall (50th–75th percentile) and weighed 55 kg (50th–75th percentile). Physical examination including ophthalmological examination revealed no abnormality other than hypertension, and her family history was negative for hypertension or renal diseases. Laboratory examination revealed normal levels of hemoglobin (14.4 g/dL), serum creatinine (0.57 mg/dL), serum total cholesterol (144 mg/dL), and normal urinalysis. Serum sodium, potassium, chloride, and total carbon dioxide levels were 134 mmol/L, 3.4 mmol/L, 102 mmol/L, and 27 mmol/L, respectively. Plasma renin activity was 9.83 ng/mL/hr (normal, 0.5–3.3 ng/mL/hr), and serum aldosterone level was 77.3 ng/dL (normal, 4–48 ng/dL). Urinary levels of vanillylmandelic acid, epinephrine, norepinephrine, dopamine, metanephrine, and normetanephrine were normal, and plasma levels of epinephrine, norepinephrine, and dopamine were also normal. Chest radiography, electrocardiography, and echocardiography showed normal findings. Renal Doppler ultrasonography revealed an avascular bilobed cyst in the lower pole of the right kidney (). Abdominal computed tomography (CT) angiography showed bilaterally normal renal arteries and an eccentric soft tissue component at the peripheral aspect of the cystic lesion (). The mass remained unenhanced during the arterial phase, and its margin was indistinguishable from the surrounding tissue (). During the delayed phase, its eccentric capsule showed enhancement, and an intact mass could be observed (), consistent with CT findings of JGC tumors.\nA right partial nephrectomy was performed, and a clear resection margin was identified. The well-encapsulated mass measured 2.5 cm ×2.2 cm×2.0 cm in size with a partially cystic-appearing cut surface. Microscopic examination revealed sheets of polygonal tumor cells with amphophilic cytoplasm. Immunohistochemical examination showed that the tumor cells stained positive for CD34 and focally positive for CD117 (C-Kit) and smooth muscle actin. ()\nPostoperatively, her blood pressure returned to normal (105/63 mmHg) without using any antihypertensive medication. On the 3rd postoperative day, the plasma renin activity (0.52 ng/mL/hr), serum aldosterone (3.9 ng/dL), and serum potassium (3.6 mmol/L) levels returned to normal. Her blood pressure and laboratory findings remained within the reference range over the next 3 years postoperatively until her last follow-up.",
        "Question": "What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
        "Relevant Entities": "{'sex': 'Female', 'weight': [55.0, 'kg'], 'height': [162.8, 'cm'], 'creatinine': [0.57, 'mg/dL'], 'age': [16, 'years']}",
        "Ground Truth Answer": "141.042",
        "Lower Limit": "133.99",
        "Upper Limit": "148.094",
        "Ground Truth Explanation": "The formula for computing Cockcroft-Gault is given by CrCl = ((140 - age) * adjusted weight * (gender_coefficient)) / (serum creatinine * 72), where the gender_coefficient is 1 if male, and 0.85 if female. The serum creatinine concentration is in mg/dL.\nThe patient's gender is female, which means that the gender coefficient is 0.85.\nThe patient is 16 years old. \nThe concentration of creatinine is 0.57 mg/dL. \nThe formula for computing the patient's BMI is (weight)/(height * height), where weight is the patient's weight in kg and height is the patient's height in m.\nThe patient's height is 162.8 cm, which is 162.8 cm * 1 m / 100 cm = 1.628 m. The patient's weight is 55.0 kg. The patient's bmi is therefore 55.0 kg / (1.628 m * 1.628 m) = 20.752 kg/m^2.The patient's BMI is 20.8, indicating they are normal weight.\nBecause the patient is normal, we take take minimum of the ideal body weight and the patient's body as the patient's adjusted weight for the Cockroft-Gault Equation. Hence, the adjusted body weight is the minimum of the two giving us an adjusted body weight of 54.918 kg.\n\nUsing the Cockcroft-Gault equation:\nCrCl = ((140 - age) * adjusted weight * gender_coefficient) / (serum creatinine * 72).\nPlugging the patient's values gives us ((140 - 16) * 54.918 * 0.85) / (0.57 * 72) = 141.042 mL/min. Hence, the patient's creatinine clearance is 141.042 mL/min.",
        "File Path": "camel/toolkits/medcalc_bench/creatinine_clearance.py",
        "Usr Msg": "A 16-year-old female adolescent was referred to our hospital with severe hypertension (systolic pressure 178 mmHg), which was first detected 7 months prior to presentation during a routine annual physical examination. She complained of intermittent headache for about 1 year, and her previous blood pressure, measured 1 month prior to her detection of hypertension, had been normal. She showed mild hypokalemia (3.4 mmol/L) in a routine blood test, and an additional workup considering secondary hypertension was planned. Despite taking amlodipine (0.1 mg/kg twice a day), her blood pressure remained uncontrolled.\nUpon admission to our hospital, her systolic and diastolic blood pressures were 155 mmHg (>99th percentile) and 111 mmHg (>99th percentile) respectively. She was 162.8 cm tall (50th–75th percentile) and weighed 55 kg (50th–75th percentile). Physical examination including ophthalmological examination revealed no abnormality other than hypertension, and her family history was negative for hypertension or renal diseases. Laboratory examination revealed normal levels of hemoglobin (14.4 g/dL), serum creatinine (0.57 mg/dL), serum total cholesterol (144 mg/dL), and normal urinalysis. Serum sodium, potassium, chloride, and total carbon dioxide levels were 134 mmol/L, 3.4 mmol/L, 102 mmol/L, and 27 mmol/L, respectively. Plasma renin activity was 9.83 ng/mL/hr (normal, 0.5–3.3 ng/mL/hr), and serum aldosterone level was 77.3 ng/dL (normal, 4–48 ng/dL). Urinary levels of vanillylmandelic acid, epinephrine, norepinephrine, dopamine, metanephrine, and normetanephrine were normal, and plasma levels of epinephrine, norepinephrine, and dopamine were also normal. Chest radiography, electrocardiography, and echocardiography showed normal findings. Renal Doppler ultrasonography revealed an avascular bilobed cyst in the lower pole of the right kidney (). Abdominal computed tomography (CT) angiography showed bilaterally normal renal arteries and an eccentric soft tissue component at the peripheral aspect of the cystic lesion (). The mass remained unenhanced during the arterial phase, and its margin was indistinguishable from the surrounding tissue (). During the delayed phase, its eccentric capsule showed enhancement, and an intact mass could be observed (), consistent with CT findings of JGC tumors.\nA right partial nephrectomy was performed, and a clear resection margin was identified. The well-encapsulated mass measured 2.5 cm ×2.2 cm×2.0 cm in size with a partially cystic-appearing cut surface. Microscopic examination revealed sheets of polygonal tumor cells with amphophilic cytoplasm. Immunohistochemical examination showed that the tumor cells stained positive for CD34 and focally positive for CD117 (C-Kit) and smooth muscle actin. ()\nPostoperatively, her blood pressure returned to normal (105/63 mmHg) without using any antihypertensive medication. On the 3rd postoperative day, the plasma renin activity (0.52 ng/mL/hr), serum aldosterone (3.9 ng/dL), and serum potassium (3.6 mmol/L) levels returned to normal. Her blood pressure and laboratory findings remained within the reference range over the next 3 years postoperatively until her last follow-up. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight."
    },
    {
        "Calculator ID": 3,
        "Calculator Name": "CKD-EPI Equations for Glomerular Filtration Rate",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-3101734-1",
        "Note Type": "Extracted",
        "Patient Note": "A 17-year-old male presented with a few days history of severe headache, visual disturbances, and a few episodes of vomiting. There was no history of fever, altered consciousness, seizures, or upper or lower limb weakness. The past medical history was unremarkable. At the time of examination, his BP was 240/130 mm Hg. The fundus examination revealed bilateral papilledema with grade 4 hypertensive changes. The neurological examination revealed normal grade 5 power in all four limbs with normally elicited deep tendon reflexes. The sensory examination was unremarkable with normal flexor plantar response bilaterally. Serum electrolytes were normal; kidney function tests were deranged (blood urea 86 mg/dL, serum creatinine 3.7 mg/dL). A renal biopsy revealed features of IgA nephropathy. MRI of the brain revealed a hyperintense signal of medulla and cervical cord on T2 and FLAIR images (Figures ); small hyperintense foci were also noted in the parieto-occipital regions and deep cerebellar white matter. The lesions were also hyperintense on diffusion-weighted imaging (because of T2 shine-through); there was no evidence of restricted diffusion on apparent diffusion co-efficient maps. As there was no clinical or lab evidence to support the diagnosis of encephalomyelitis or acute disseminating encephalomyelitis (ADEM) as suggested initially by the radiologist, an atypical variant of PRES was considered as the most plausible diagnostic possibility. Further investigations including CSF studies were not considered necessary in view of the strongly suggestive clinical and imaging features. The patient rapidly improved with antihypertensive treatment and a repeat MRI done 1 month afterward showed resolution of the earlier imaging findings.",
        "Question": "Using the 2021 CKD-EPI Creatinine equation, what is the patient's Glomerular Filtration Rate (GFR) in terms of mL/min/1.73 m²?",
        "Relevant Entities": "{'sex': 'Male', 'age': [17, 'years'], 'creatinine': [3.7, 'mg/dL']}",
        "Ground Truth Answer": "23.422",
        "Lower Limit": "22.251",
        "Upper Limit": "24.593",
        "Ground Truth Explanation": "The formula for computing GFR is 142 x (Scr/A)**B x 0.9938**age x (gender_coeffcient), where the ** indicates an exponent operation, Scr is the concentration of serum creatinine in mg/dL and gender_coefficient is 1.012 if the patient is female, else the coeffient is 1. The coefficients A and B are dependent on the patient's gender and the patient's creatinine concentration.\nThe patient is 17 years old. The patient's gender is Male, and so the patient's gender coefficient is 1.0.\nThe concentration of Serum Creatinine is 3.7 mg/dL. Because the patient's gender is male and the creatinine concentration is greater than or equal to 0.9 mg/dL, A = 0.9 and B = -1.2.\nPlugging in these values, we get 142 * (3.7/0.9)**-1.2 * 0.9938**17 * 1.0 = 23.422.\nHence, the GFR value is 23.422 ml/min/1.73 m².",
        "File Path": "camel/toolkits/medcalc_bench/ckd-epi_2021_creatinine.py",
        "Usr Msg": "A 17-year-old male presented with a few days history of severe headache, visual disturbances, and a few episodes of vomiting. There was no history of fever, altered consciousness, seizures, or upper or lower limb weakness. The past medical history was unremarkable. At the time of examination, his BP was 240/130 mm Hg. The fundus examination revealed bilateral papilledema with grade 4 hypertensive changes. The neurological examination revealed normal grade 5 power in all four limbs with normally elicited deep tendon reflexes. The sensory examination was unremarkable with normal flexor plantar response bilaterally. Serum electrolytes were normal; kidney function tests were deranged (blood urea 86 mg/dL, serum creatinine 3.7 mg/dL). A renal biopsy revealed features of IgA nephropathy. MRI of the brain revealed a hyperintense signal of medulla and cervical cord on T2 and FLAIR images (Figures ); small hyperintense foci were also noted in the parieto-occipital regions and deep cerebellar white matter. The lesions were also hyperintense on diffusion-weighted imaging (because of T2 shine-through); there was no evidence of restricted diffusion on apparent diffusion co-efficient maps. As there was no clinical or lab evidence to support the diagnosis of encephalomyelitis or acute disseminating encephalomyelitis (ADEM) as suggested initially by the radiologist, an atypical variant of PRES was considered as the most plausible diagnostic possibility. Further investigations including CSF studies were not considered necessary in view of the strongly suggestive clinical and imaging features. The patient rapidly improved with antihypertensive treatment and a repeat MRI done 1 month afterward showed resolution of the earlier imaging findings. Using the 2021 CKD-EPI Creatinine equation, what is the patient's Glomerular Filtration Rate (GFR) in terms of mL/min/1.73 m²?"
    },
    {
        "Calculator ID": 4,
        "Calculator Name": "CHA2DS2-VASc Score for Atrial Fibrillation Stroke Risk",
        "Category": "risk",
        "Output Type": "integer",
        "Note ID": "pmc-6132167-1",
        "Note Type": "Extracted",
        "Patient Note": "A 78-year-old man visited our emergency room with unconsciousness. According to his family, he was poisoned with pesticide (glyphosate) for self-injury purpose. Two years ago, he had a history of cerebral infarction, and he was taking aspirin and medication for hypertension. During gastric lavage in the local clinic emergency room, his heart rate and respiration decreased. Then, he was transferred to the intensive care unit after intubation.\nIntensive care such as continuous renal replacement therapy and mechanical ventilation was performed in the intensive care unit, and colistin and minocycline were administered for pneumonia. Pulmonary thromboembolism was confirmed by chest computed tomography (CT), and anticoagulant therapy was performed. Acute acalculous cholecystitis occurred simultaneously, and a percutaneous transhepatic GB drainage tube was inserted.\nAfter 2 months of intensive treatment, the patient's condition improved, and cholecystectomy was planned. He underwent laparoscopic cholecystectomy, and there were no remarkable details of the surgery.\nOn the first day postoperatively, the drainage changed to bile. The patient's vital signs were as follows: blood pressure, 160/105 mm Hg; pulse rate, 143 beats/min; respiratory rate, 37 breaths/min; and body temperature, 39°C. There was tenderness and rebound tenderness in the whole abdomen, and CT showed pneumoperitoneum and diffuse fluid collection in the right perihepatic space (Figure ). We diagnosed him as having bile peritonitis, and reoperation was decided.\nOn relaparoscopic examination, there was a large amount of bile juice around the GB bed and perihepatic space, and suction and irrigation were performed. The cystic duct stump was confirmed, but there was no leakage. In the GB bed, a leak was observed in a small duct-like structure, which was regarded as an aberrant duct, and the operation was terminated after primary repair (Figure ).\nUntil 6 days postoperatively, hemoserous fluid was drained from the drainage tube. However, from postoperative day 7, the fluid changed to bile, and a percutaneous drainage (PCD) catheter was inserted into the GB bed area after performing CT.\nOn postoperative day 9, endoscopic retrograde cholangiopancreatography (ERCP) was performed, and a leak was detected in the branch of the right posterior hepatic duct, which was regarded as an aberrant subvesical bile duct (Figure ). Endoscopic sphincterotomy (EST) and insertion of an endoscopic retrograde biliary drainage (ERBD) stent (7 French, 5 cm) were performed (Figure ).\nOne month after ERBD stent insertion, ERCP was performed again to confirm that there was no leak, and then, the ERBD stent was removed (Figure ).",
        "Question": "What is the patient's CHA2DS2-VASc Score?",
        "Relevant Entities": "{'sex': 'Male', 'Thromboembolism history': True, 'Transient Ischemic Attacks History': True, 'Hypertension history': True, 'age': [78, 'years'], 'Stroke': True}",
        "Ground Truth Answer": "5",
        "Lower Limit": "5",
        "Upper Limit": "5",
        "Ground Truth Explanation": "The current CHA2DS2-VASc score is 0.\nThe patient is 78 years old. Because the age is greater than 74, two points added to the score, making the current total 0 + 2 = 2.\nThe patient's gender is male and so no points are added to the current total, keeping the total at 2.\nBecause the congestive heart failure history is not specified in the patient note, we assume it is absent from the patient. Because the patient does not have congestive heart failure, no points are added to the current total, keeping the total at 2.\nThe patient history for hypertension is present. Because the patient has hypertension, one point is added to the score, making the current total 2 + 1 = 3.\nOne criteria of the CHA2DS2-VASc score is to check if the patient has had any history of stroke, transient ischemic attacks (TIA), or thromboembolism. Based on the patient note, the patient history for stroke is present. Based on the patient note, the patient history for tia is present. Based on the patient note, the patient history for thromboembolism is present. Because at least one of stroke, tia, or thromboembolism is present, two points are added to the score, making the current total 3 + 2 = 5.\nBecause vascular disease history is not specified in the patient note, we assume it to be absent.\nBecause the patient does not have vascular disease, no points are added to score, keeping the score at 5. Because diabetes history is not specified in the patient note, we assume it's value as 'absent'. Because the patient does not have diabetes, no points are added to score, keeping the score at 5.\nThe patient's CHA2DS2-VASc Score is 5.",
        "File Path": "camel/toolkits/medcalc_bench/cha2ds2_vasc_score.py",
        "Usr Msg": "A 78-year-old man visited our emergency room with unconsciousness. According to his family, he was poisoned with pesticide (glyphosate) for self-injury purpose. Two years ago, he had a history of cerebral infarction, and he was taking aspirin and medication for hypertension. During gastric lavage in the local clinic emergency room, his heart rate and respiration decreased. Then, he was transferred to the intensive care unit after intubation.\nIntensive care such as continuous renal replacement therapy and mechanical ventilation was performed in the intensive care unit, and colistin and minocycline were administered for pneumonia. Pulmonary thromboembolism was confirmed by chest computed tomography (CT), and anticoagulant therapy was performed. Acute acalculous cholecystitis occurred simultaneously, and a percutaneous transhepatic GB drainage tube was inserted.\nAfter 2 months of intensive treatment, the patient's condition improved, and cholecystectomy was planned. He underwent laparoscopic cholecystectomy, and there were no remarkable details of the surgery.\nOn the first day postoperatively, the drainage changed to bile. The patient's vital signs were as follows: blood pressure, 160/105 mm Hg; pulse rate, 143 beats/min; respiratory rate, 37 breaths/min; and body temperature, 39°C. There was tenderness and rebound tenderness in the whole abdomen, and CT showed pneumoperitoneum and diffuse fluid collection in the right perihepatic space (Figure ). We diagnosed him as having bile peritonitis, and reoperation was decided.\nOn relaparoscopic examination, there was a large amount of bile juice around the GB bed and perihepatic space, and suction and irrigation were performed. The cystic duct stump was confirmed, but there was no leakage. In the GB bed, a leak was observed in a small duct-like structure, which was regarded as an aberrant duct, and the operation was terminated after primary repair (Figure ).\nUntil 6 days postoperatively, hemoserous fluid was drained from the drainage tube. However, from postoperative day 7, the fluid changed to bile, and a percutaneous drainage (PCD) catheter was inserted into the GB bed area after performing CT.\nOn postoperative day 9, endoscopic retrograde cholangiopancreatography (ERCP) was performed, and a leak was detected in the branch of the right posterior hepatic duct, which was regarded as an aberrant subvesical bile duct (Figure ). Endoscopic sphincterotomy (EST) and insertion of an endoscopic retrograde biliary drainage (ERBD) stent (7 French, 5 cm) were performed (Figure ).\nOne month after ERBD stent insertion, ERCP was performed again to confirm that there was no leak, and then, the ERBD stent was removed (Figure ). What is the patient's CHA2DS2-VASc Score?"
    },
    {
        "Calculator ID": 5,
        "Calculator Name": "Mean Arterial Pressure (MAP)",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "usmle-7729",
        "Note Type": "Extracted",
        "Patient Note": "A 34-year-old poultry worker presents to his physician with a sore throat and a non-productive cough for 2 weeks. His cough is associated with fever. The vital signs include: blood pressure 120/80 mm Hg, heart rate 67/min, respiratory rate 18/min, and temperature 37.6°C (98.0°F). Physical examination shows oropharyngeal erythema and scattered, moist rales on lung auscultation. The patient’s X-ray demonstrates patchy reticular opacities in the perihilar regions of both lungs. After some additional tests, he is diagnosed with community-acquired pneumonia and is treated with cephalexin with modest improvement.",
        "Question": "What is patient's mean arterial pressure in mm Hg?",
        "Relevant Entities": "{'Systolic Blood Pressure': [120.0, 'mm hg'], 'Diastolic Blood Pressure': [80.0, 'mm hg']}",
        "Ground Truth Answer": "93.333",
        "Lower Limit": "88.666",
        "Upper Limit": "98.0",
        "Ground Truth Explanation": "The mean average pressure is computed by the formula 2/3 * (diastolic blood pressure) + 1/3 * (systolic blood pressure). Plugging in the values, we get 2/3 * 80.0 mm Hg + 1/3 * 120.0 mm Hg = 93.333 mm Hg.\nHence, the patient's mean arterial pressure is 93.333 mm Hg.",
        "File Path": "camel/toolkits/medcalc_bench/mean_arterial_pressure.py",
        "Usr Msg": "A 34-year-old poultry worker presents to his physician with a sore throat and a non-productive cough for 2 weeks. His cough is associated with fever. The vital signs include: blood pressure 120/80 mm Hg, heart rate 67/min, respiratory rate 18/min, and temperature 37.6°C (98.0°F). Physical examination shows oropharyngeal erythema and scattered, moist rales on lung auscultation. The patient’s X-ray demonstrates patchy reticular opacities in the perihilar regions of both lungs. After some additional tests, he is diagnosed with community-acquired pneumonia and is treated with cephalexin with modest improvement. What is patient's mean arterial pressure in mm Hg?"
    },
    {
        "Calculator ID": 6,
        "Calculator Name": "Body Mass Index (BMI)",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "pmc-5067398-1",
        "Note Type": "Extracted",
        "Patient Note": "A 19-year-old man presented to the orthopedic surgery department with pain in the left buttock after military training which including running with hyper-flexion of hip for 3 hours, twice a day for 5 days. When he hyper-flexed his left hip joint, he felt and heard a crack. Initially about one week later, he referred to the local hospital because of persisting hip pain. On radiographic evaluation, he diagnosed as pelvic bone fracture and recommended for further evaluation. However, he refused to get more examination due to the alleviation of the hip pain. Although he got rest without any military training for the next six weeks, there was no improvement and tingling sense developed over the posterior aspect of left thigh. During the first consultation with the patient, he complained difficulty on sustained standing and sitting on a locked position.\nHis body weight, height, hip and lumbar T-score for dual-energy x-ray absorptiometry (DXA) scan were 76 kg, 183 cm, –0.7 and –0.1 respectively. On physical examinations, there was no limitation on range of motion of the left hip joint. Also he could walk without any pain except mild tenderness on the area distal from the ischial tuberosity. On the radiographs of the pelvis anteroposterior and frog leg view (), there was a 35×40×20 mm sized bony fragment, 15 mm distance from the left ischial tuberosity. After the patient admitted to our hospital, he had an examination of computed tomography () and magnetic resonance imaging for rule out pathologic conditions. There was a bony fragment at left ischial tuberosity, which was mainly from conjoined origin of biceps femoris and semitendinosus tendons without any bone marrow edema (). Overall, he diagnosed as old avulsion fracture at ischial tuberosity. He determined to get conservative treatment on condition of a gradual alleviation of the symptom. During the admitted 2 months, he just got rest and high intensity laser therapy. Thanks to the improvement except discomfort on running, he discharged and returned to his military unit.",
        "Question": "What is the patient's body mass mass index (BMI)? Your answer should be in terms of kg/m².",
        "Relevant Entities": "{'weight': [76.0, 'kg'], 'height': [183.0, 'cm']}",
        "Ground Truth Answer": "22.694",
        "Lower Limit": "21.559",
        "Upper Limit": "23.829",
        "Ground Truth Explanation": "The formula for computing the patient's BMI is (weight)/(height * height), where weight is the patient's weight in kg and height is the patient's height in m.\nThe patient's height is 183.0 cm, which is 183.0 cm * 1 m / 100 cm = 1.83 m. The patient's weight is 76.0 kg. The patient's bmi is therefore 76.0 kg / (1.83 m * 1.83 m) = 22.694 kg/m^2.",
        "File Path": "camel/toolkits/medcalc_bench/bmi_calculator.py",
        "Usr Msg": "A 19-year-old man presented to the orthopedic surgery department with pain in the left buttock after military training which including running with hyper-flexion of hip for 3 hours, twice a day for 5 days. When he hyper-flexed his left hip joint, he felt and heard a crack. Initially about one week later, he referred to the local hospital because of persisting hip pain. On radiographic evaluation, he diagnosed as pelvic bone fracture and recommended for further evaluation. However, he refused to get more examination due to the alleviation of the hip pain. Although he got rest without any military training for the next six weeks, there was no improvement and tingling sense developed over the posterior aspect of left thigh. During the first consultation with the patient, he complained difficulty on sustained standing and sitting on a locked position.\nHis body weight, height, hip and lumbar T-score for dual-energy x-ray absorptiometry (DXA) scan were 76 kg, 183 cm, –0.7 and –0.1 respectively. On physical examinations, there was no limitation on range of motion of the left hip joint. Also he could walk without any pain except mild tenderness on the area distal from the ischial tuberosity. On the radiographs of the pelvis anteroposterior and frog leg view (), there was a 35×40×20 mm sized bony fragment, 15 mm distance from the left ischial tuberosity. After the patient admitted to our hospital, he had an examination of computed tomography () and magnetic resonance imaging for rule out pathologic conditions. There was a bony fragment at left ischial tuberosity, which was mainly from conjoined origin of biceps femoris and semitendinosus tendons without any bone marrow edema (). Overall, he diagnosed as old avulsion fracture at ischial tuberosity. He determined to get conservative treatment on condition of a gradual alleviation of the symptom. During the admitted 2 months, he just got rest and high intensity laser therapy. Thanks to the improvement except discomfort on running, he discharged and returned to his military unit. What is the patient's body mass mass index (BMI)? Your answer should be in terms of kg/m²."
    },
    {
        "Calculator ID": 7,
        "Calculator Name": "Calcium Correction for Hypoalbuminemia",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-2847727-1",
        "Note Type": "Extracted",
        "Patient Note": "A 32-year-old male presented with acute abdominal pain, reduced urine output and red urine since three days. No fever, vomiting or bowel or bladder symptoms were observed. The pain in the abdomen was diffuse and more as discomfort, which started following a jerk while the patient was traveling in a bus. No prior history of diabetes, hypertension or renal disease was reported.\nInvestigations conducted in a local hospital had revealed numerous red blood corpuscles (RBCs) and white blood corpuscles (WBCs) in urine sediment and 4 + proteinuria. Ultrasound showed moderate ascites. Plain computed tomography (CT) of the abdomen showed hepatomegaly with ascites. Serum creatinine measured the following day was high (4.0 mg/dl); hence, an opinion from a nephrologist was sought.\nUpon examination, he was anxious and hemodynamically stable. The lungs were clear and abdominal distension and ascites was present. Pedal edema was absent. Following are the reports of the investigation carried out: hemoglobin, 17.6 g/dl; total leucocyte count, 20100 cells/m3; differential count polymorphs, 79%; lymphocytes, 17%; eosinophils and monocytes, 2% each; urine showed 3 + protein; 6-8 WBCs and numerous RBCs; arterial blood gas analysis pH, 7.31; bicarbonate, 10.8 meq/l; pCo2, 22.2 mmHg; blood urea nitrogen (BUN), 60 mg/dl; creatinine, 5.9 mg/dl; sodium, 131 meq/l; potassium, 5.1 meq/l; calcium, 8.6 mg/dl; phosphorus, 6.7 mg/dl; uric acid, 10.2 mg/dl; total bilirubin, 0.3 mg/dl; protein, 8.0 g/dl; albumin, 4.2 g/dl; serum glutamic-oxaloacetic transaminase (SGOT), 38 u/l; serum glutamic-pyruvic transaminase (SGPT), 25 u/l; alkaline phosphatase (ALP), 96 u/l.\nWe suspected intraperitoneal rupture of the urinary bladder because of the abrupt onset of symptoms. We performed catheterization of the urinary bladder, draining 3.5 l of hemorrhagic fluid. Abdominal distension began to regress and the patient started feeling relieved after this drainage. Cystogram showed leakage of the contrast into the peritoneal cavity []. Ascitic fluid creatinine and urea nitrogen approximated the values that are usually observed in urine samples rather than in blood (86 mg/dl and 425 mg/dl, respectively).\nFollowing this confirmation, the patient underwent emergency laparotomy. A 5-mm tear was found in the dome of bladder, which was repaired in two layers. He was maintained on indwelling urethral and suprapubic Foley catheters. Within 24 h, the biochemical abnormalities in the patient improved to normal.",
        "Question": "Using the Calcium Correction for Hypoalbuminemia formula, what is the patient's corrected calcium in mg/dL? Your may set your normal albumin concentration to be 4 g/dL.",
        "Relevant Entities": "{'Albumin': [4.2, 'g/dL'], 'Calcium': [8.6, 'mg/dL']}",
        "Ground Truth Answer": "8.44",
        "Lower Limit": "8.018",
        "Upper Limit": "8.862",
        "Ground Truth Explanation": "To compute the patient's correct calcium level in mg/dL, the formula is  (0.8 * (Normal Albumin (in g/dL) - Patient's Albumin (in g/dL))) + Serum Calcium (in mg/dL).\nThe patient's normal albumin level is 4.0 g/dL.\nThe concentration of Albmumin is 4.2 g/dL. \nThe concentration of Calcium is 8.6 mg/dL. \nPlugging these values into the formula, we get (0.8 * (4.0 g/dL - 4.2 g/dL)) + 8.6 mg/dL = 8.44 mg/dL.\nThe patient's corrected calcium concentration 8.44 mg/dL.",
        "File Path": "camel/toolkits/medcalc_bench/calcium_correction.py",
        "Usr Msg": "A 32-year-old male presented with acute abdominal pain, reduced urine output and red urine since three days. No fever, vomiting or bowel or bladder symptoms were observed. The pain in the abdomen was diffuse and more as discomfort, which started following a jerk while the patient was traveling in a bus. No prior history of diabetes, hypertension or renal disease was reported.\nInvestigations conducted in a local hospital had revealed numerous red blood corpuscles (RBCs) and white blood corpuscles (WBCs) in urine sediment and 4 + proteinuria. Ultrasound showed moderate ascites. Plain computed tomography (CT) of the abdomen showed hepatomegaly with ascites. Serum creatinine measured the following day was high (4.0 mg/dl); hence, an opinion from a nephrologist was sought.\nUpon examination, he was anxious and hemodynamically stable. The lungs were clear and abdominal distension and ascites was present. Pedal edema was absent. Following are the reports of the investigation carried out: hemoglobin, 17.6 g/dl; total leucocyte count, 20100 cells/m3; differential count polymorphs, 79%; lymphocytes, 17%; eosinophils and monocytes, 2% each; urine showed 3 + protein; 6-8 WBCs and numerous RBCs; arterial blood gas analysis pH, 7.31; bicarbonate, 10.8 meq/l; pCo2, 22.2 mmHg; blood urea nitrogen (BUN), 60 mg/dl; creatinine, 5.9 mg/dl; sodium, 131 meq/l; potassium, 5.1 meq/l; calcium, 8.6 mg/dl; phosphorus, 6.7 mg/dl; uric acid, 10.2 mg/dl; total bilirubin, 0.3 mg/dl; protein, 8.0 g/dl; albumin, 4.2 g/dl; serum glutamic-oxaloacetic transaminase (SGOT), 38 u/l; serum glutamic-pyruvic transaminase (SGPT), 25 u/l; alkaline phosphatase (ALP), 96 u/l.\nWe suspected intraperitoneal rupture of the urinary bladder because of the abrupt onset of symptoms. We performed catheterization of the urinary bladder, draining 3.5 l of hemorrhagic fluid. Abdominal distension began to regress and the patient started feeling relieved after this drainage. Cystogram showed leakage of the contrast into the peritoneal cavity []. Ascitic fluid creatinine and urea nitrogen approximated the values that are usually observed in urine samples rather than in blood (86 mg/dl and 425 mg/dl, respectively).\nFollowing this confirmation, the patient underwent emergency laparotomy. A 5-mm tear was found in the dome of bladder, which was repaired in two layers. He was maintained on indwelling urethral and suprapubic Foley catheters. Within 24 h, the biochemical abnormalities in the patient improved to normal. Using the Calcium Correction for Hypoalbuminemia formula, what is the patient's corrected calcium in mg/dL? Your may set your normal albumin concentration to be 4 g/dL."
    },
    {
        "Calculator ID": 8,
        "Calculator Name": "Wells' Criteria for Pulmonary Embolism",
        "Category": "risk",
        "Output Type": "decimal",
        "Note ID": "pmc-7025968-1",
        "Note Type": "Extracted",
        "Patient Note": "A 39-year-old female patient, who had black stool twice without obvious inducement 3 days ago, accompanied by dizziness, and no other symptoms such as abdominal distension, abdominal pain, cold, and fever. After symptomatic treatment in the local hospital, the condition did not improve, so came to our hospital for further treatment and was hospitalized with gastrointestinal bleeding. Physical examination: T 36.7 °C, P 78/min, R 20/min, BP 99/62 mmHg, moderate anemia (Hb 85 g/L), no other abnormal signs and previous history of other diseases. After admission, through the preliminary examination of abdominal CT scanning, the results showed that hepatic cysts, small calcifications in the left lobe of the liver, and gallbladder inflammation, but no abnormalities in the intestinal tract. Subsequently, through electronic gastroscopy and enteroscopy, the results of the gastroscopy showed that patchy erythema could be seen in the gastric antrum, while in other parts of the stomach, the mucosa was smooth, the folds were intact, and the gastric peristalsis was good, which was diagnosed as superficial gastritis. The enteroscopy showed that, when the electronic enteroscope was inserted into the end of the ileum, a small amount of brown liquid could be seen, the intestinal mucosa was smooth, and the ileocecal valve is good. While a lot of coffee-like liquid could be seen in the colon cavity, but no bleeding site was found. At this time, we discussed and evaluated the relevant research results and case data, and highly suspected the possibility of intestinal vascular disease. In order to make a clear diagnosis and locate the bleeding site, further capsule endoscopy was performed (the whole photography time of capsule endoscopy was 11 h and 30 min). After the capsule endoscopy was swallowed, it was sent to the duodenum under the gastroscope, and entered the colon in 3 h and 27 min. Fortunately, some gains were obtained, at 48 min, there were a lot of fluid and blood clots in the upper and middle segment of the jejunum could be seen, but the entire field of vision was poorly blurred and no bleeding point was still found (). Through the results of capsule endoscopy, we were full of confidence in the previous judgment, and initially positioned the bleeding site in the jejunum.\nAfter a week of treatment through nutritional support, rehydration and correction of anemia, the patient still had recurrent and intermittent black stool, and her condition was not very stable. Therefore, we decided to explore by laparotomy []. Based on the results of capsule endoscopy, the dark black part of the jejunum was found, and then the jejunum was cut at about 5 cm above it for intraoperative enteroscopy. The bleeding spot was finally found (located at about 10 cm from jejunum to the ligament of Traitz) and then the hemostasis was stopped by suture. Finally, it was diagnosed as jejunal telangiectasia complicated with bleeding (). After hemostasis during the operation, a thorough and careful exploration of other intestines was performed, and no other bleeding sites were found. After operation, the patient's condition was stable and the symptoms of hematochezia and anemia were controlled through symptomatic treatment.",
        "Question": "What is the patient's score of Wells' criteria for Pulmonary Embolism?",
        "Relevant Entities": "{'Previously Documented Pulmonary Embolism': False, 'Heart Rate or Pulse': [78.0, 'beats per minute'], 'Immobilization for at least 3 days': False, 'Hemoptysis': False, 'Surgery in the previous 4 weeks': False, 'Malignancy with treatment within 6 months or palliative': False, 'Pulmonary Embolism is #1 diagnosis OR equally likely': False, 'Previously documented Deep Vein Thrombosis': False}",
        "Ground Truth Answer": "0",
        "Lower Limit": "0",
        "Upper Limit": "0",
        "Ground Truth Explanation": "The Well's score for pulmonary embolism is currently 0.\nClinical signs and symptoms of DVT are not reported and so we assume that this is missing from the patient, keeping the current total at 0. Pulmonary Embolism is not reported to be the #1 diagnosis and so the total score remains unchanged, keeping the total score at 0.\nThe patient's heart rate is 78.0 beats per minute. The heart rate is less than 100 bpm, and so the score remains unchanged, keeping the total score at 0.\nBecause the patient has not had an immobilization for at least 3 days, and the patient did not have a surgery in the past 4 weeks, the score remains at 0.\nBecause the patient has no previous diagnosis of pulmonary embolism (PE) or deep vein thrombosis (DVT), the score remains at 0.\nHemoptysis is reported to be absent and so the total score remains unchanged, keeping the total score at 0.\nMalignany with treatment within 6 months or palliative is reported to be absent and so the total score remains unchanged, keeping the total score at 0.\nThe patient's Well's score for pulmonary embolism is 0.",
        "File Path": "camel/toolkits/medcalc_bench/wells_criteria_pe.py",
        "Usr Msg": "A 39-year-old female patient, who had black stool twice without obvious inducement 3 days ago, accompanied by dizziness, and no other symptoms such as abdominal distension, abdominal pain, cold, and fever. After symptomatic treatment in the local hospital, the condition did not improve, so came to our hospital for further treatment and was hospitalized with gastrointestinal bleeding. Physical examination: T 36.7 °C, P 78/min, R 20/min, BP 99/62 mmHg, moderate anemia (Hb 85 g/L), no other abnormal signs and previous history of other diseases. After admission, through the preliminary examination of abdominal CT scanning, the results showed that hepatic cysts, small calcifications in the left lobe of the liver, and gallbladder inflammation, but no abnormalities in the intestinal tract. Subsequently, through electronic gastroscopy and enteroscopy, the results of the gastroscopy showed that patchy erythema could be seen in the gastric antrum, while in other parts of the stomach, the mucosa was smooth, the folds were intact, and the gastric peristalsis was good, which was diagnosed as superficial gastritis. The enteroscopy showed that, when the electronic enteroscope was inserted into the end of the ileum, a small amount of brown liquid could be seen, the intestinal mucosa was smooth, and the ileocecal valve is good. While a lot of coffee-like liquid could be seen in the colon cavity, but no bleeding site was found. At this time, we discussed and evaluated the relevant research results and case data, and highly suspected the possibility of intestinal vascular disease. In order to make a clear diagnosis and locate the bleeding site, further capsule endoscopy was performed (the whole photography time of capsule endoscopy was 11 h and 30 min). After the capsule endoscopy was swallowed, it was sent to the duodenum under the gastroscope, and entered the colon in 3 h and 27 min. Fortunately, some gains were obtained, at 48 min, there were a lot of fluid and blood clots in the upper and middle segment of the jejunum could be seen, but the entire field of vision was poorly blurred and no bleeding point was still found (). Through the results of capsule endoscopy, we were full of confidence in the previous judgment, and initially positioned the bleeding site in the jejunum.\nAfter a week of treatment through nutritional support, rehydration and correction of anemia, the patient still had recurrent and intermittent black stool, and her condition was not very stable. Therefore, we decided to explore by laparotomy []. Based on the results of capsule endoscopy, the dark black part of the jejunum was found, and then the jejunum was cut at about 5 cm above it for intraoperative enteroscopy. The bleeding spot was finally found (located at about 10 cm from jejunum to the ligament of Traitz) and then the hemostasis was stopped by suture. Finally, it was diagnosed as jejunal telangiectasia complicated with bleeding (). After hemostasis during the operation, a thorough and careful exploration of other intestines was performed, and no other bleeding sites were found. After operation, the patient's condition was stable and the symptoms of hematochezia and anemia were controlled through symptomatic treatment. What is the patient's score of Wells' criteria for Pulmonary Embolism?"
    },
    {
        "Calculator ID": 9,
        "Calculator Name": "MDRD GFR Equation",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-7654560-1",
        "Note Type": "Extracted",
        "Patient Note": "A 49-year-old male patient without any significant past medical history presented to our hospital with problems of not voiding his bladder and back pain. The patient reported his back pain began four days ago when he was at work and tried to lift a 100 lb instrument. The patient went to see a chiropractor, but there was no improvement with his back pain. He then started to experience left thigh and buttock pain along with the back pain for which he took eight ibuprofen tablets a day (1600 mg) for four days before presenting to the hospital. He denies taking ibuprofen for any other pain that he experienced in the past.\nWhile in the emergency room, the initial labs revealed creatinine of 32mg/dL, BUN of 175mg/dL, Na of 128 mEq/L, K of 4.5mmol/L, Cl of 90mEq/L, Co2 of 17.0mEq/L, anion gap of 21, Ca of 7.9mEq/L, and a total creatine kinase of 1315 micromoles/L. His liver function tests (LFTs) were also elevated - serum aspartate aminotransferase (AST) was 104 units, and alanine aminotransferase (ALT) was 281 units. His urinalysis showed 3+ blood and 2+ protein but 0-5 red blood cells. Left lower extremity Doppler ultrasound was negative for deep vein thrombosis (DVT). CT scan of the abdomen was unremarkable. There was fatty infiltration of the liver and thickening of the bladder wall, and diffuse soft tissue edema involving the left hip. The patient was given ondansetron hydrochloride (Zofran® Injection) 4 mg intravenously (IV) Q6H PRN for nausea, oxycodone hydrochloride (Roxicodone®) 5 mg PO Q4H PRN for pain, morphine sulfate 2 mg IV Q2H PRN for severe back pain, hydralazine hydrochloride (Apresoline® Injection) 10 mg IV Q4H PRN for hypertension, ceftriaxone sodium 1 gm/ (sodium chloride) 100 mls at 200 mls/hr IV Q24H at 1900 SCH for cystitis, and sodium bicarbonate 150 meq/ (dextrose) 1,150 mls at 150 mls/hr IV, Q7H40M SCH. Acute kidney injury and metabolic acidosis was the impression on evaluation in the ED.\nLater the patient was moved to the telemetry unit to be followed up with the hospitalist. The patient was monitored by an internist, and a nephrology consultation was requested. On the following day, during the nephrology consultation, the patient's laboratory values were as shown in Tables -. The patient's vitals are mentioned in Table . CT scan and renal ultrasound of the kidneys were ordered. CT scan of the abdomen was unremarkable. The nephrologist's recommendation was to continue the patient on the IV fluids with bicarbonate and avoid nephrotoxins. The nephrologist closely monitored the patient, and the plan was to place the patient on temporary dialysis if the kidney function doesn't show improvement.\nOn a subsequent day on follow up with the internist, the kidney function tests were not improving; upon discussion with the nephrologist, a temporary dialysis catheter order was placed. On the same day, an interventional radiologist placed a right internal jugular vein (IJV) temporary dialysis catheter, and the patient went for the first round of hemodialysis treatment, after which the creatinine level went down to 18 mg/dl. Urinalysis was positive for protein and red blood cells, and the labs of creatine phosphokinase (CPK) 1315 micromoles/L pointed towards rhabdomyolysis. The next day during the nephrology consultation, it was recommended to go for the second round of hemodialysis. The patient's lab showed phosphorus of 11.60 mg/dL, leading to sevelamer 800 mg PO TID initiation. The patient underwent another four rounds of hemodialysis, and the kidney function tests showed a creatinine level of 11.92 mg/dL.\nThe patient subsequently went through hemodialysis for the seventh time, but his kidney function had not yet returned to the normal level. The nephrologist ordered a tunneled dialysis catheter to be placed on the patient to be able to receive outpatient dialysis once he is discharged, which was also placed by an interventional radiologist. His labs were checked again, and the results showed that his CPK, hyponatremia, and hyperkalemia were resolving to normal, but the creatinine stayed stable at a high level of 10.6 mg/dL. Due to the lack of improvement in the kidney function tests towards normal range, the nephrologist ordered a renal biopsy. A day later, a kidney biopsy was done (Figure ), which showed acute interstitial nephritis with very minimal chronicity, and the patient was started on prednisone 60 mg once a day. Because of the lack of improvement on the kidney function test to normal levels, the patient was declared to have end-stage renal disease and was discharged with the outpatient dialysis treatment program and to follow up with the nephrologist.",
        "Question": "Using the MDRD GFR equation, what is the patient's Glomerular Filtration Rate (GFR) in terms of mL/min/1.73 m²?",
        "Relevant Entities": "{'age': [49, 'years'], 'creatinine': [10.6, 'mg/dL'], 'sex': 'Male'}",
        "Ground Truth Answer": "5.209",
        "Lower Limit": "4.949",
        "Upper Limit": "5.469",
        "Ground Truth Explanation": "The patient is 49 years old. The concentration of Creatinine is 10.6 mg/dL. \nThe race of the patient is not provided, so the default value of the race coefficient is 1.0.\nThe patient is male, so the gender coefficient is 1.\nThe patient's estimated GFR is calculated using the MDRD equation as:\nGFR = 175 * creatinine^(-1.154) * age^(-0.203) * race_coefficient * gender_coefficient. The creatinine concentration is mg/dL.\nPlugging in these values will give us: 175 * 10.6^(-1.154) * 49^(-0.203) * 1 * 1=5.209.\nHence, the patient's GFR is 5.209 mL/min/1.73m².",
        "File Path": "camel/toolkits/medcalc_bench/mdrd_gfr.py",
        "Usr Msg": "A 49-year-old male patient without any significant past medical history presented to our hospital with problems of not voiding his bladder and back pain. The patient reported his back pain began four days ago when he was at work and tried to lift a 100 lb instrument. The patient went to see a chiropractor, but there was no improvement with his back pain. He then started to experience left thigh and buttock pain along with the back pain for which he took eight ibuprofen tablets a day (1600 mg) for four days before presenting to the hospital. He denies taking ibuprofen for any other pain that he experienced in the past.\nWhile in the emergency room, the initial labs revealed creatinine of 32mg/dL, BUN of 175mg/dL, Na of 128 mEq/L, K of 4.5mmol/L, Cl of 90mEq/L, Co2 of 17.0mEq/L, anion gap of 21, Ca of 7.9mEq/L, and a total creatine kinase of 1315 micromoles/L. His liver function tests (LFTs) were also elevated - serum aspartate aminotransferase (AST) was 104 units, and alanine aminotransferase (ALT) was 281 units. His urinalysis showed 3+ blood and 2+ protein but 0-5 red blood cells. Left lower extremity Doppler ultrasound was negative for deep vein thrombosis (DVT). CT scan of the abdomen was unremarkable. There was fatty infiltration of the liver and thickening of the bladder wall, and diffuse soft tissue edema involving the left hip. The patient was given ondansetron hydrochloride (Zofran® Injection) 4 mg intravenously (IV) Q6H PRN for nausea, oxycodone hydrochloride (Roxicodone®) 5 mg PO Q4H PRN for pain, morphine sulfate 2 mg IV Q2H PRN for severe back pain, hydralazine hydrochloride (Apresoline® Injection) 10 mg IV Q4H PRN for hypertension, ceftriaxone sodium 1 gm/ (sodium chloride) 100 mls at 200 mls/hr IV Q24H at 1900 SCH for cystitis, and sodium bicarbonate 150 meq/ (dextrose) 1,150 mls at 150 mls/hr IV, Q7H40M SCH. Acute kidney injury and metabolic acidosis was the impression on evaluation in the ED.\nLater the patient was moved to the telemetry unit to be followed up with the hospitalist. The patient was monitored by an internist, and a nephrology consultation was requested. On the following day, during the nephrology consultation, the patient's laboratory values were as shown in Tables -. The patient's vitals are mentioned in Table . CT scan and renal ultrasound of the kidneys were ordered. CT scan of the abdomen was unremarkable. The nephrologist's recommendation was to continue the patient on the IV fluids with bicarbonate and avoid nephrotoxins. The nephrologist closely monitored the patient, and the plan was to place the patient on temporary dialysis if the kidney function doesn't show improvement.\nOn a subsequent day on follow up with the internist, the kidney function tests were not improving; upon discussion with the nephrologist, a temporary dialysis catheter order was placed. On the same day, an interventional radiologist placed a right internal jugular vein (IJV) temporary dialysis catheter, and the patient went for the first round of hemodialysis treatment, after which the creatinine level went down to 18 mg/dl. Urinalysis was positive for protein and red blood cells, and the labs of creatine phosphokinase (CPK) 1315 micromoles/L pointed towards rhabdomyolysis. The next day during the nephrology consultation, it was recommended to go for the second round of hemodialysis. The patient's lab showed phosphorus of 11.60 mg/dL, leading to sevelamer 800 mg PO TID initiation. The patient underwent another four rounds of hemodialysis, and the kidney function tests showed a creatinine level of 11.92 mg/dL.\nThe patient subsequently went through hemodialysis for the seventh time, but his kidney function had not yet returned to the normal level. The nephrologist ordered a tunneled dialysis catheter to be placed on the patient to be able to receive outpatient dialysis once he is discharged, which was also placed by an interventional radiologist. His labs were checked again, and the results showed that his CPK, hyponatremia, and hyperkalemia were resolving to normal, but the creatinine stayed stable at a high level of 10.6 mg/dL. Due to the lack of improvement in the kidney function tests towards normal range, the nephrologist ordered a renal biopsy. A day later, a kidney biopsy was done (Figure ), which showed acute interstitial nephritis with very minimal chronicity, and the patient was started on prednisone 60 mg once a day. Because of the lack of improvement on the kidney function test to normal levels, the patient was declared to have end-stage renal disease and was discharged with the outpatient dialysis treatment program and to follow up with the nephrologist. Using the MDRD GFR equation, what is the patient's Glomerular Filtration Rate (GFR) in terms of mL/min/1.73 m²?"
    },
    {
        "Calculator ID": 10,
        "Calculator Name": "Ideal Body Weight",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "pmc-3443612-1",
        "Note Type": "Extracted",
        "Patient Note": "We report the case of a 20-year-old Caucasian, nonsmoking female student, height 185 cm, weight 66 kg, who developed pain of the left pinna which is why she attended the otolaryngological ambulatory unit two days later (). The left pinna was found to be sore and reddish but without vesicles, which is why chondritis was diagnosed and amoxicillin and clavulanic acid prescribed. One day later she awaked with a peripheral facial nerve palsy on the left side and hypoesthesia of the left upper lip. The weeks before onset she had a lot of stress with her studies at the university but there was no fever, no vaccination, or infection. A few days before onset of the palsy she recognised dysesthesias of the parietal skull on the left side. The night before onset of the palsy she was exposed against the ventilator of an air condition for more than an hour. She was regularly taking loratadine.\nClinical neurologic examination on admission revealed slight hypoesthesia of the left upper lip, moderate peripheral facial nerve palsy, and generally reduced tendon reflexes. The left pinna showed an erythematous rash but no vesicles. Hearing and taste were normal and there was no vertigo, double vision, skew deviation, nystagmus, headache, hyposmia, or ataxia []. Blood chemical investigations revealed slight leucopenia but normal C-reactive protein. Ophthalmologic examinations excluded a zoster of the eye. Immediately after admission, she was treated with dexamethasone (40 mg intramuscularly) during two days followed by dexamethasone orally during another six days. Additionally, she received 750 mg acyclovir three times a day intravenously during eight days. For continuous pain periauricularly she received mefenamic acid and paracetamol with success.\nAt followup three days later she reported some transient vesicles at the left pinna, no longer visible at the visit, lid closure had improved, and there was recovery from the pinna's rash but only marginal voluntary innervation of the frontalis and lower facial muscles. Audiometry was normal. Followup six days after onset of the palsy showed complete lid closure but unchanged innervation of the other facial muscles. She reported neuralgiform pain in the left ear which is why gabapentin was prescribed with success. Eleven days after onset of facial palsy lid closure on the left side was complete. There were slight innervation of the frontal branch and only slight innervation of the left mouth corner. Nerve conduction studies 12 days after onset showed almost equal compound muscle action potential (CMAP) amplitude when recording from the orbicularis oculi muscle but >50% amplitude reduction on the left side when recording from the orbicularis oris muscle. Antibodies against the varicella zoster virus (VZV) were determined three times by means of an ELISA test. IgG antibodies against VZV were positive at all three determinations and IgM antibodies against VZV were negative at the first and positive at the second and third determination, which is why valacyclovir orally was given for seven days after discontinuation of acyclovir. Antibodies against other viruses and Borrelia burgdorferi were normal. Follow-up 6 weeks after onset showed further recovery of the palsy, such that it was no longer visible in the absence of emotional reactions. Nerve conduction studies confirmed the improvement such that the CMAP amplitude difference was only reduced to 30%.",
        "Question": "Using the Ideal Body Weight Formula, what is the patient's ideal body weight in terms of kg?",
        "Relevant Entities": "{'sex': 'Female', 'height': [185.0, 'cm']}",
        "Ground Truth Answer": "75.02",
        "Lower Limit": "71.269",
        "Upper Limit": "78.771",
        "Ground Truth Explanation": "The patient's gender is Female.\nThe patient's height is 185.0 cm, which is 185.0 cm * 0.393701 in/cm = 72.835 in. \nFor females, the ideal body weight (IBW) is calculated as follows:\nIBW = 45.5 kg + 2.3 kg * (height (in inches) - 60)\nPlugging in the values gives us 45.5 kg + 2.3 kg * (72.835 (in inches) - 60) = 75.02 kg.\nHence, the patient's IBW is 75.02 kg.",
        "File Path": "camel/toolkits/medcalc_bench/ideal_body_weight.py",
        "Usr Msg": "We report the case of a 20-year-old Caucasian, nonsmoking female student, height 185 cm, weight 66 kg, who developed pain of the left pinna which is why she attended the otolaryngological ambulatory unit two days later (). The left pinna was found to be sore and reddish but without vesicles, which is why chondritis was diagnosed and amoxicillin and clavulanic acid prescribed. One day later she awaked with a peripheral facial nerve palsy on the left side and hypoesthesia of the left upper lip. The weeks before onset she had a lot of stress with her studies at the university but there was no fever, no vaccination, or infection. A few days before onset of the palsy she recognised dysesthesias of the parietal skull on the left side. The night before onset of the palsy she was exposed against the ventilator of an air condition for more than an hour. She was regularly taking loratadine.\nClinical neurologic examination on admission revealed slight hypoesthesia of the left upper lip, moderate peripheral facial nerve palsy, and generally reduced tendon reflexes. The left pinna showed an erythematous rash but no vesicles. Hearing and taste were normal and there was no vertigo, double vision, skew deviation, nystagmus, headache, hyposmia, or ataxia []. Blood chemical investigations revealed slight leucopenia but normal C-reactive protein. Ophthalmologic examinations excluded a zoster of the eye. Immediately after admission, she was treated with dexamethasone (40 mg intramuscularly) during two days followed by dexamethasone orally during another six days. Additionally, she received 750 mg acyclovir three times a day intravenously during eight days. For continuous pain periauricularly she received mefenamic acid and paracetamol with success.\nAt followup three days later she reported some transient vesicles at the left pinna, no longer visible at the visit, lid closure had improved, and there was recovery from the pinna's rash but only marginal voluntary innervation of the frontalis and lower facial muscles. Audiometry was normal. Followup six days after onset of the palsy showed complete lid closure but unchanged innervation of the other facial muscles. She reported neuralgiform pain in the left ear which is why gabapentin was prescribed with success. Eleven days after onset of facial palsy lid closure on the left side was complete. There were slight innervation of the frontal branch and only slight innervation of the left mouth corner. Nerve conduction studies 12 days after onset showed almost equal compound muscle action potential (CMAP) amplitude when recording from the orbicularis oculi muscle but >50% amplitude reduction on the left side when recording from the orbicularis oris muscle. Antibodies against the varicella zoster virus (VZV) were determined three times by means of an ELISA test. IgG antibodies against VZV were positive at all three determinations and IgM antibodies against VZV were negative at the first and positive at the second and third determination, which is why valacyclovir orally was given for seven days after discontinuation of acyclovir. Antibodies against other viruses and Borrelia burgdorferi were normal. Follow-up 6 weeks after onset showed further recovery of the palsy, such that it was no longer visible in the absence of emotional reactions. Nerve conduction studies confirmed the improvement such that the CMAP amplitude difference was only reduced to 30%. Using the Ideal Body Weight Formula, what is the patient's ideal body weight in terms of kg?"
    },
    {
        "Calculator ID": 11,
        "Calculator Name": "QTc Bazett Calculator",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "Patient has a heart rate of 176 bpm and a QT interval of 330 msec.",
        "Question": "Using the Bazett Formula for corrected QT interval, what is the patient's corrected QT interval in msec?",
        "Relevant Entities": "{'Heart Rate or Pulse': [176, 'beats per minute'], 'QT interval': [330, 'msec']}",
        "Ground Truth Answer": "565.115",
        "Lower Limit": "536.859",
        "Upper Limit": "593.371",
        "Ground Truth Explanation": "The corrected QT interval using the Bazett formula is computed as  QTc = QT interval / √ (RR interval), where the QT interval is in msec, and RR interval is given as 60/(heart rate).\nThe patient's heart rate is 176 beats per minute.\nThe QT interval is 330 msec.\nThe RR interval is computed as 60/(heart rate), and so the RR interval is 60/176 = 0.341.\nHence, plugging in these values, we will get 330/√(0.341) = 565.115.\nThe patient's corrected QT interval (QTc) is 565.115 msec. ",
        "File Path": "camel/toolkits/medcalc_bench/qt_calculator_bazett.py",
        "Usr Msg": "Patient has a heart rate of 176 bpm and a QT interval of 330 msec. Using the Bazett Formula for corrected QT interval, what is the patient's corrected QT interval in msec?"
    },
    {
        "Calculator ID": 13,
        "Calculator Name": "Estimated Due Date",
        "Category": "date",
        "Output Type": "date",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "The patient's last menstrual period was on 09/17/2011. Her cycle length is 21 days.",
        "Question": "Using Naegele's Rule for estimated due date based on the last menstrual period and cycle length, what is the the patient's estimated due date? Your response should be in the format of M/D/Y (ie 08/31/2023, 07/03/2000) with just the date and not other text. ",
        "Relevant Entities": "{'cycle length': 21, 'Last menstrual date': '09/17/2011'}",
        "Ground Truth Answer": "06/30/2012",
        "Lower Limit": "06/30/2012",
        "Upper Limit": "06/30/2012",
        "Ground Truth Explanation": "The patient's estimated due date based on their last period is computed by using Naegele's Rule. Using Naegele's Rule, we add 40 weeks to the patient's last menstrual period date. We then add or subtract days from the patient's estimated due date depending on how many more or less days a patient's cycle length is from the standard 28 days. \nThe patient's last menstrual period was 09/17/2011. \nThe date after adding 40 weeks to the patient's last menstrual period date is 06/23/2012. \nBecause the patient's cycle length is 21 days, this means that we must subtract 7 days from the patient's estimate due date. Hence, the patient's estimated due date is 06-30-2012. ",
        "File Path": "camel/toolkits/medcalc_bench/estimated_due_date.py",
        "Usr Msg": "The patient's last menstrual period was on 09/17/2011. Her cycle length is 21 days. Using Naegele's Rule for estimated due date based on the last menstrual period and cycle length, what is the the patient's estimated due date? Your response should be in the format of M/D/Y (ie 08/31/2023, 07/03/2000) with just the date and not other text. "
    },
    {
        "Calculator ID": 18,
        "Calculator Name": "HEART Score for Major Cardiac Events",
        "Category": "risk",
        "Output Type": "integer",
        "Note ID": "usmle-9855",
        "Note Type": "Extracted",
        "Patient Note": "A 25-year-old woman presents to the emergency department with palpitations, sweating, and blurry vision after playing volleyball on the beach. She denies chest pain and shortness of breath. She states that these episodes occur often, but resolve after eating a meal or drinking a sugary soda. Past medical history is unremarkable, and she takes no medications. Temperature is 37°C (98.6°F), blood pressure is 135/80 mm Hg, pulse is 102/min, and respirations are 18/min. Fingerstick blood glucose level is 42 g/dL. ECG reveals sinus tachycardia. Urinalysis and toxicology are noncontributory. Appropriate medical therapy is administered and she is discharged with an appointment for a fasting blood draw within the week.",
        "Question": "What is the patient's HEART score?",
        "Relevant Entities": "{'age': [25, 'years'], 'Hypertension history': False, 'Suspicion History': 'Slightly suspicious', 'Electrocardiogram Test': 'Normal', 'Diabetes mellitus criteria for CCI rule': False, 'smoking': False, 'atherosclerotic disease': False, 'Transient Ischemic Attacks History': False, 'hypercholesterolemia': False, 'obesity': False, 'parent or sibling with Cardiovascular disease before age 65': False, 'Initial troponin': 'less than or equal to normal limit'}",
        "Ground Truth Answer": "0",
        "Lower Limit": "0",
        "Upper Limit": "0",
        "Ground Truth Explanation": "The current HEART Score is 0.\nThe value of 'history' in the patient's note is determined to be 'Slightly suspicious'. Based on the HEART Score criteria, 0 points are added for 'history', keeping the current total at 0.\nThe value of 'electrocardiogram' in the patient's note is determined to be 'Normal'. Based on the HEART Score criteria, 0 points are added for 'electrocardiogram', keeping the current total at 0.\nThe patient is 25 years old. The patient's age is less than 45 years and so keep the current total at 0.\nThe following risk factor(s) are noted to be absent from the patient: hypertension, hypercholesterolemia, diabetes mellitus, obesity, smoking, family with cvd, atherosclerotic disease. Based on the HEART Score risk factors criteria, 0 risk factors are present and so 0 points are added for the risk factors criteria, keeping the current total at 0.\nThe value of 'initial troponin' in the patient's note is determined to be 'less than or equal to normal limit'. Based on the HEART Score criteria, 0 points are added for 'initial troponin', keeping the current total at 0.\nBased on the patient's data, the HEART Score is 0.",
        "File Path": "camel/toolkits/medcalc_bench/heart_score.py",
        "Usr Msg": "A 25-year-old woman presents to the emergency department with palpitations, sweating, and blurry vision after playing volleyball on the beach. She denies chest pain and shortness of breath. She states that these episodes occur often, but resolve after eating a meal or drinking a sugary soda. Past medical history is unremarkable, and she takes no medications. Temperature is 37°C (98.6°F), blood pressure is 135/80 mm Hg, pulse is 102/min, and respirations are 18/min. Fingerstick blood glucose level is 42 g/dL. ECG reveals sinus tachycardia. Urinalysis and toxicology are noncontributory. Appropriate medical therapy is administered and she is discharged with an appointment for a fasting blood draw within the week. What is the patient's HEART score?"
    },
    {
        "Calculator ID": 19,
        "Calculator Name": "Fibrosis-4 (FIB-4) Index for Liver Fibrosis",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-3994266-1",
        "Note Type": "Extracted",
        "Patient Note": "A 17-year-old girl visited Chungbuk National University Hospital, presenting with fever and abdominal pain that had developed 7 days previously. She had undergone an operation for gastroschisis repair at birth. At the time of admission, her vital signs were as follows: blood pressure, 120/80 mm Hg; pulse rate, 70 beats per minute; respiration rate, 18 breaths per minute; and body temperature, 37.5℃. She appeared emaciated and acutely ill. Her body mass index was 18.1 (height, 151 cm; and weight, 41.3 kg). A physical examination revealed icteric sclera, a very thin abdominal cavity, and a longitudinal surgical scar at the midline. Tenderness was noted in the upper abdominal area, and normal bowel sounds were heard. There was no particular finding in the limb or neurological examinations. Laboratory analysis revealed a white blood cell count of 27,000 cells/mm3; hemoglobin level, 12.3 g/dL; platelet count, 277,000 cells/mm3; aspartate aminotransferase level, 108 IU/L; alanine aminotransferase level, 144 IU/L; alkaline phosphatase level, 476 IU/L; total protein level, 6.5 g/dL; albumin level, 3.7 g/dL; total bilirubin level, 14.1 mg/dL; direct bilirubin level, 9.2 mg/dL; amylase level, 592 U/L; lipase level, 825 U/L; blood urea nitrogen level, 5.0 mg/dL; and creatinine level, 0.5 mg/dL. These data were compatible with diagnoses of acute cholangitis and acute biliary pancreatitis. An abdominal computed tomography scan revealed a round calcifying lesion near the pancreas (), and the absence of the retroperitoneal duodenum and the anterior position of the spleen with respect to the left kidney. The anterior and left-sided position of the superior mesenteric vein compared with that of the superior mesenteric artery was observed in the abdominal computed tomography scan (). The coronal view revealed the distorted architecture of the liver and a high-attenuation lesion at the extrahepatic bile duct (). Results of a barium examination revealed a right-sided duodenojejunal flexure and malpositioning of the bowel, with the small bowel on the right side and the colon on the left side (). Intestinal malrotation could be diagnosed based on these findings. ERCP was performed by using a lateral-view endoscope in the usual way. After approaching the ampulla, the endoscope was pushed against the duodenal wall to maintain the papilla in the correct position, and a selective bile duct cannulation confirmed the presence of a 12-mm round stone in the common bile duct. With a guidewire-assisted technique, the single dark brown stone was removed by using a Dormia basket after the endoscopic sphincterotomy (). The procedure lasted for 15 minutes. A cholangiogram obtained through an endoscopic nasobiliary drainage tube revealed a distorted biliary system, which was characterized with diffuse dilatation of the intrahepatic and extrahepatic biliary trees, downward-positioned gallbladder and a right intrahepatic biliary tree, and a horizontally located common bile duct. The abnormal orientation of the duodenum suggested intestinal malrotation (). Clinical symptoms and liver function tests normalized after the ERCP procedure. The patient has been monitored for 3 years and is in a normal state.",
        "Question": "What is the patient's Fibrosis-4 (FIB-4) index?",
        "Relevant Entities": "{'age': [17, 'years'], 'Alanine aminotransferase': [144.0, 'U/L'], 'Aspartate aminotransferase': [108.0, 'U/L'], 'Platelet count': [277000.0, 'µL']}",
        "Ground Truth Answer": "0.552",
        "Lower Limit": "0.524",
        "Upper Limit": "0.58",
        "Ground Truth Explanation": "The formula for computing Fibrosis-4 is Fib-4 = (Age * AST) / (Platelet count (in billions) * √ALT), where platelet count is the number of billions per L, and the units for AST and ALT are both U/L.\nThe patient's concentration of AST is 108.0 U/L.\nThe patient's concentration of ALT is 144.0 U/L.\nThe patient's concentration of platelets is 277000.0 count/µL. To convert 277000.0 count/µL of platelets to L, multiply by the conversion factor 1000000.0 µL/L which will give 277000.0 platelets count/µL * 1000000.0 µL/L = 277000000000.0 platelets count/L. This means that there are 277000000000.0/(10^9) = 277.0 billion platelet counts per liter.\nPlugging these values into the formula, we get (17 * 108.0)/(277.0 * sqrt(144.0)) = 0.552.\nHence, the Fibrosis-4 score is 0.552.",
        "File Path": "camel/toolkits/medcalc_bench/fibrosis_4.py",
        "Usr Msg": "A 17-year-old girl visited Chungbuk National University Hospital, presenting with fever and abdominal pain that had developed 7 days previously. She had undergone an operation for gastroschisis repair at birth. At the time of admission, her vital signs were as follows: blood pressure, 120/80 mm Hg; pulse rate, 70 beats per minute; respiration rate, 18 breaths per minute; and body temperature, 37.5℃. She appeared emaciated and acutely ill. Her body mass index was 18.1 (height, 151 cm; and weight, 41.3 kg). A physical examination revealed icteric sclera, a very thin abdominal cavity, and a longitudinal surgical scar at the midline. Tenderness was noted in the upper abdominal area, and normal bowel sounds were heard. There was no particular finding in the limb or neurological examinations. Laboratory analysis revealed a white blood cell count of 27,000 cells/mm3; hemoglobin level, 12.3 g/dL; platelet count, 277,000 cells/mm3; aspartate aminotransferase level, 108 IU/L; alanine aminotransferase level, 144 IU/L; alkaline phosphatase level, 476 IU/L; total protein level, 6.5 g/dL; albumin level, 3.7 g/dL; total bilirubin level, 14.1 mg/dL; direct bilirubin level, 9.2 mg/dL; amylase level, 592 U/L; lipase level, 825 U/L; blood urea nitrogen level, 5.0 mg/dL; and creatinine level, 0.5 mg/dL. These data were compatible with diagnoses of acute cholangitis and acute biliary pancreatitis. An abdominal computed tomography scan revealed a round calcifying lesion near the pancreas (), and the absence of the retroperitoneal duodenum and the anterior position of the spleen with respect to the left kidney. The anterior and left-sided position of the superior mesenteric vein compared with that of the superior mesenteric artery was observed in the abdominal computed tomography scan (). The coronal view revealed the distorted architecture of the liver and a high-attenuation lesion at the extrahepatic bile duct (). Results of a barium examination revealed a right-sided duodenojejunal flexure and malpositioning of the bowel, with the small bowel on the right side and the colon on the left side (). Intestinal malrotation could be diagnosed based on these findings. ERCP was performed by using a lateral-view endoscope in the usual way. After approaching the ampulla, the endoscope was pushed against the duodenal wall to maintain the papilla in the correct position, and a selective bile duct cannulation confirmed the presence of a 12-mm round stone in the common bile duct. With a guidewire-assisted technique, the single dark brown stone was removed by using a Dormia basket after the endoscopic sphincterotomy (). The procedure lasted for 15 minutes. A cholangiogram obtained through an endoscopic nasobiliary drainage tube revealed a distorted biliary system, which was characterized with diffuse dilatation of the intrahepatic and extrahepatic biliary trees, downward-positioned gallbladder and a right intrahepatic biliary tree, and a horizontally located common bile duct. The abnormal orientation of the duodenum suggested intestinal malrotation (). Clinical symptoms and liver function tests normalized after the ERCP procedure. The patient has been monitored for 3 years and is in a normal state. What is the patient's Fibrosis-4 (FIB-4) index?"
    },
    {
        "Calculator ID": 20,
        "Calculator Name": "Centor Score (Modified/McIsaac) for Strep Pharyngitis",
        "Category": "severity",
        "Output Type": "integer",
        "Note ID": "usmle-5503",
        "Note Type": "Extracted",
        "Patient Note": "A 48-year-old nurse presents with left-sided chest pain and nonproductive cough. He thinks both the chest pain and the cough began about two months ago. He recently joined a meditation group and found that the deep breathing exercises exacerbate his chest pain. The patient denies headaches, fever, or chills. He reports a 3 lb weight loss over the last two weeks, which he attributes to a change in his diet that he and his wife recently started. The patient drinks a glass or two of whiskey on the weekends and is a non-smoker. The patient’s medical history is significant for type II diabetes and Hodgkin lymphoma. He was treated with chemotherapy and radiation 25 years ago without complications. His current medications include metformin and glyburide. His HbA1c is 7.5%. His temperature is 99°F (37.2°C), blood pressure is 121/82 mmHg, pulse is 86/min, respirations are 12/min, and oxygen saturation is 95% on room air. Physical exam is notable for coarse rhonchi in the left lung. There is no appreciable lymphadenopathy. A chest radiograph is performed, which is shown in Figure A.",
        "Question": "What is the patient's Centor Score?",
        "Relevant Entities": "{'age': [48, 'years'], 'Exudate or swelling on tonsils': False, 'Tender/swollen anterior cervical lymph nodes': False, 'Temperature': [99.0, 'degrees fahreinheit'], 'Cough Absent': False}",
        "Ground Truth Answer": "-1",
        "Lower Limit": "-1",
        "Upper Limit": "-1",
        "Ground Truth Explanation": "The current Centor score is 0.\nThe patient is 48 years old. Because the age is greater than 44 years, we decrease the score by one point, making the score 0 - 1 = -1.\nThe patient's temperature is 99.0 degrees fahrenheit. To convert to degrees celsius, apply the formula 5/9 * [temperature (degrees fahrenheit) - 32]. This means that the patient's temperature is 5/9 * 67.0 = 37.222 degrees celsius. The patient's temperature is less than or equal to 38 degrees Celsius, and so we do not make any changes to the score, keeping the score at -1.\nThe patient note reports 'cough absent' as absent for the patient. Hence, we do not change the score, keeping the current score at -1.\nThe patient note reports 'tender/swollen anterior cervical lymph nodes' as absent for the patient. Hence, we do not change the score, keeping the current score at -1.\nThe patient note reports 'exudate or swelling on tonsils' as absent for the patient. Hence, we do not change the score, keeping the current score at -1.\nHence, the Centor score for the patient is -1.",
        "File Path": "camel/toolkits/medcalc_bench/centor_score.py",
        "Usr Msg": "A 48-year-old nurse presents with left-sided chest pain and nonproductive cough. He thinks both the chest pain and the cough began about two months ago. He recently joined a meditation group and found that the deep breathing exercises exacerbate his chest pain. The patient denies headaches, fever, or chills. He reports a 3 lb weight loss over the last two weeks, which he attributes to a change in his diet that he and his wife recently started. The patient drinks a glass or two of whiskey on the weekends and is a non-smoker. The patient’s medical history is significant for type II diabetes and Hodgkin lymphoma. He was treated with chemotherapy and radiation 25 years ago without complications. His current medications include metformin and glyburide. His HbA1c is 7.5%. His temperature is 99°F (37.2°C), blood pressure is 121/82 mmHg, pulse is 86/min, respirations are 12/min, and oxygen saturation is 95% on room air. Physical exam is notable for coarse rhonchi in the left lung. There is no appreciable lymphadenopathy. A chest radiograph is performed, which is shown in Figure A. What is the patient's Centor Score?"
    },
    {
        "Calculator ID": 22,
        "Calculator Name": "Maintenance Fluids Calculations",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "pmc-4578041-3",
        "Note Type": "Extracted",
        "Patient Note": "A female patient, aged 4 years and 4 months, was admitted to the hospital with a 3-year history of vomiting small amounts following every meal. No obvious causes of the vomiting were identified. Approximately 2 years prior to admission, the patient exhibited hyperpigmentation of the lips, in addition to fatigue, with a slow/stagnating increase in weight and height.\nOne month prior to admission, the patient had a seizure and was diagnosed with secondary epilepsy, based on an abnormal EEG. The patient was successfully treated with Topamax but continued to vomit >10 times/day. The patient was G2P2 with full-term normal delivery and a birth weight of 3.35 kg. The intellectual and physical development of the patient was similar to that of healthy children of the same age. There was no family history of genetic diseases, and the parents were in a non-consanguineous marriage.\nThe findings of the physical examination were as follows: BP, 85/55 mmHg; height, 92.7 cm; weight, 12 kg. The patient was mentally alert, and no significant anomalies were observed in the heart, lungs, abdomen, nervous system or external genitalia. A generalized hyperpigmentation was observed. Esophagography showed achalasia of the lower esophagus at the cardia. In the hospital, the patient was observed not to produce tears when crying. The results of a bilateral Schirmer test were 0 mm, which led to the diagnosis of alacrima. Further medical history confirmed that the alacrima had manifested at birth. Following the diagnosis of AS, the patient was treated with hydrocortisone replacement therapy (25 mg/m2), and the vomiting was alleviated. Genetic testing confirmed a c.1366C>T mutation in exon 15 of the AAAS gene (). No additional follow-up information is available for this patient.",
        "Question": "Based on the patient's weight, what is the patient's maintenance fluid in mL/hr?",
        "Relevant Entities": "{'weight': [12.0, 'kg']}",
        "Ground Truth Answer": "44.0",
        "Lower Limit": "41.8",
        "Upper Limit": "46.2",
        "Ground Truth Explanation": "The patient's weight is 12.0 kg. For patient's whose weight is in between 10 kg and 20 kg, the formula for computing maintenance fluid is 40 mL/hr + 2 mL/kg/hr * (weight (in kilograms) - 10 kilograms). Hence, plugging into this formula, we get 40 mL/hr + 2 mL/kg/hr * (12.0 kg - 10 kg) = 44.0 mL/hr.\nHence, the patient's fluid maintenance is 44.0 mL/hr.",
        "File Path": "camel/toolkits/medcalc_bench/maintenance_fluid_calc.py",
        "Usr Msg": "A female patient, aged 4 years and 4 months, was admitted to the hospital with a 3-year history of vomiting small amounts following every meal. No obvious causes of the vomiting were identified. Approximately 2 years prior to admission, the patient exhibited hyperpigmentation of the lips, in addition to fatigue, with a slow/stagnating increase in weight and height.\nOne month prior to admission, the patient had a seizure and was diagnosed with secondary epilepsy, based on an abnormal EEG. The patient was successfully treated with Topamax but continued to vomit >10 times/day. The patient was G2P2 with full-term normal delivery and a birth weight of 3.35 kg. The intellectual and physical development of the patient was similar to that of healthy children of the same age. There was no family history of genetic diseases, and the parents were in a non-consanguineous marriage.\nThe findings of the physical examination were as follows: BP, 85/55 mmHg; height, 92.7 cm; weight, 12 kg. The patient was mentally alert, and no significant anomalies were observed in the heart, lungs, abdomen, nervous system or external genitalia. A generalized hyperpigmentation was observed. Esophagography showed achalasia of the lower esophagus at the cardia. In the hospital, the patient was observed not to produce tears when crying. The results of a bilateral Schirmer test were 0 mm, which led to the diagnosis of alacrima. Further medical history confirmed that the alacrima had manifested at birth. Following the diagnosis of AS, the patient was treated with hydrocortisone replacement therapy (25 mg/m2), and the vomiting was alleviated. Genetic testing confirmed a c.1366C>T mutation in exon 15 of the AAAS gene (). No additional follow-up information is available for this patient. Based on the patient's weight, what is the patient's maintenance fluid in mL/hr?"
    },
    {
        "Calculator ID": 24,
        "Calculator Name": "Steroid Conversion Calculator",
        "Category": "dosage conversion",
        "Output Type": "decimal",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "Patient has taken 190.936 mg of Hydrocortisone PO. ",
        "Question": "Based on the patient's dose of Hydrocortisone PO, what is the equivalent dosage in mg of MethylPrednisoLONE IV? ",
        "Relevant Entities": "{'input steroid': ['Hydrocortisone PO', 190.936, 'mg'], 'target steroid': 'MethylPrednisoLONE IV'}",
        "Ground Truth Answer": "38.187",
        "Lower Limit": "38.187",
        "Upper Limit": "38.187",
        "Ground Truth Explanation": "The mass of Hydrocortisone PO is 190.936 mg. To convert from the Hydrocortisone PO to MethylPrednisoLONE IV, multiply by the conversion factor, 0.2 mg MethylPrednisoLONE IV/Hydrocortisone PO, giving us 190.936 mg Hydrocortisone PO * 0.2 mg MethylPrednisoLONE IV/mg Hydrocortisone PO = 38.187 mg MethylPrednisoLONE IV. 190.936 mg of Hydrocortisone PO is equal to 38.187 mg of MethylPrednisoLONE IV.",
        "File Path": "camel/toolkits/medcalc_bench/steroid_conversion_calculator.py",
        "Usr Msg": "Patient has taken 190.936 mg of Hydrocortisone PO.  Based on the patient's dose of Hydrocortisone PO, what is the equivalent dosage in mg of MethylPrednisoLONE IV? "
    },
    {
        "Calculator ID": 26,
        "Calculator Name": "Sodium Correction for Hyperglycemia",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-5034576-1",
        "Note Type": "Extracted",
        "Patient Note": "An 18-year-old Brazilian man developed dyspnea and fever of one week’s duration and was then diagnosed with right lower lobe pneumonia. Before this incident, he had not experienced any medical complications, lived in full sanitary conditions, denied previous symptoms related to disease, did not have any pets, and denied eating raw meat. He then began hospital inpatient treatment with intravenous antibiotics, and third-generation cephalosporin (Ceftriaxone) and a macrolide (Clarithromycin) were prescribed for 8 days. Laboratory tests from the patient’s admittance showed mild anemia with a hemoglobin (Hb) level of 11.7 g/dL, with normal mean corpuscular volume (MCV) and mean corpuscular hemoglobin (MCH). Other biochemical results were as follows: creatinine 0.9 mg/dL, urea 32 mg/dL, total bilirubin 0.2 mg/dL, glucose 90 mg/dL, sodium 134 mEq/L, potassium 3.7 mEq/L, and C-reactive protein 138.2 mg/L. Leucocytes levels were a little low, with 2700 cells/μL. Blood and urine cultures were negative for infection and serological tests for human immunodeficiency virus (HIV), hepatitis B and C, and syphilis were all negative.\nOn the fourth day of this related treatment, our patient developed abdominal distension and pain in his lower right abdominal quadrant. Acute appendicitis was confirmed by ultrasound examination, and he underwent laparoscopic surgery the same day. Our patient was then taken to our intensive care unit for worsening of his clinical condition. On the fourth postoperative day, our patient developed fever associated with right pleural effusion, which was a lymphocytic exudate with an adenosine deaminase concentration of 17.99 U/L and negative culture (Fig. ). Thus, the attending physicians requested a bronchoscopy with bronchoalveolar lavage and transbronchial biopsy. The transbronchial fluid had negative cultures for infection. At that time, the antibiotic spectrum was extended for treatment of the sepsis, including piperacillin/tazobactam for 10 days.\nAnatomopathological examination of the transbronchial biopsy specimen showed a small fragment of lung parenchyma with discrete septal thickening and a rounded structure suggestive of a pseudocyst containing Toxoplasma gondii bradyzoites (Fig. ).\nOur patient showed progressive improvement after antibiotic therapy with piperacillin/tazobactam, and was discharged on the 14th day after surgery. A chest radiograph showed significant improvement in lung opacification (Fig. ) and serological tests for toxoplasmosis were negative for immunoglobulin G and immunoglobulin M.\nOur patient was followed up on an outpatient basis for 2 years without any signs of recurrence of lung infections or other comorbidities. Serology for toxoplasmosis were repeated and remained negative.",
        "Question": "What is the patient's corrected sodium concentration in terms of mEq/L?",
        "Relevant Entities": "{'Glucose': [90.0, 'mg/dL'], 'Sodium': [134.0, 'mEq/L']}",
        "Ground Truth Answer": "133.76",
        "Lower Limit": "127.072",
        "Upper Limit": "140.448",
        "Ground Truth Explanation": "The formula for Sodium Correction for Hyperglycemia is Measured sodium + 0.024 * (Serum glucose - 100), where Measured Sodium is the sodium concentration in mEq/L and the Serum glucose is the concentration of glucose in mg/dL.\nThe concentration of sodium is 134.0 mEq/L. \nThe concentration of glucose is 90.0 mg/dL. \nPlugging in these values into the formula gives us 134.0 mEq/L + 0.024 * (90.0 - 100) = 133.76 mEq/L.\nHence, the patient's corrected concentration of sodium is 133.76 mEq/L.",
        "File Path": "camel/toolkits/medcalc_bench/sodium_correction_hyperglycemia.py",
        "Usr Msg": "An 18-year-old Brazilian man developed dyspnea and fever of one week’s duration and was then diagnosed with right lower lobe pneumonia. Before this incident, he had not experienced any medical complications, lived in full sanitary conditions, denied previous symptoms related to disease, did not have any pets, and denied eating raw meat. He then began hospital inpatient treatment with intravenous antibiotics, and third-generation cephalosporin (Ceftriaxone) and a macrolide (Clarithromycin) were prescribed for 8 days. Laboratory tests from the patient’s admittance showed mild anemia with a hemoglobin (Hb) level of 11.7 g/dL, with normal mean corpuscular volume (MCV) and mean corpuscular hemoglobin (MCH). Other biochemical results were as follows: creatinine 0.9 mg/dL, urea 32 mg/dL, total bilirubin 0.2 mg/dL, glucose 90 mg/dL, sodium 134 mEq/L, potassium 3.7 mEq/L, and C-reactive protein 138.2 mg/L. Leucocytes levels were a little low, with 2700 cells/μL. Blood and urine cultures were negative for infection and serological tests for human immunodeficiency virus (HIV), hepatitis B and C, and syphilis were all negative.\nOn the fourth day of this related treatment, our patient developed abdominal distension and pain in his lower right abdominal quadrant. Acute appendicitis was confirmed by ultrasound examination, and he underwent laparoscopic surgery the same day. Our patient was then taken to our intensive care unit for worsening of his clinical condition. On the fourth postoperative day, our patient developed fever associated with right pleural effusion, which was a lymphocytic exudate with an adenosine deaminase concentration of 17.99 U/L and negative culture (Fig. ). Thus, the attending physicians requested a bronchoscopy with bronchoalveolar lavage and transbronchial biopsy. The transbronchial fluid had negative cultures for infection. At that time, the antibiotic spectrum was extended for treatment of the sepsis, including piperacillin/tazobactam for 10 days.\nAnatomopathological examination of the transbronchial biopsy specimen showed a small fragment of lung parenchyma with discrete septal thickening and a rounded structure suggestive of a pseudocyst containing Toxoplasma gondii bradyzoites (Fig. ).\nOur patient showed progressive improvement after antibiotic therapy with piperacillin/tazobactam, and was discharged on the 14th day after surgery. A chest radiograph showed significant improvement in lung opacification (Fig. ) and serological tests for toxoplasmosis were negative for immunoglobulin G and immunoglobulin M.\nOur patient was followed up on an outpatient basis for 2 years without any signs of recurrence of lung infections or other comorbidities. Serology for toxoplasmosis were repeated and remained negative. What is the patient's corrected sodium concentration in terms of mEq/L?"
    },
    {
        "Calculator ID": 30,
        "Calculator Name": "Serum Osmolality",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "usmle-4284",
        "Note Type": "Extracted",
        "Patient Note": "A 22-year-old woman with a history of type I diabetes mellitus presents to the emergency department with nausea, vomiting, and drowsiness for the past day. Her temperature is 98.3°F (36.8°C), blood pressure is 114/74 mmHg, pulse is 120/min, respirations are 27/min, and oxygen saturation is 100% on room air. Physical exam is notable for a confused and lethargic young woman. Initial laboratory values are notable for the findings below.\n\nSerum:\nNa+: 139 mEq/L\nCl-: 100 mEq/L\nK+: 2.9 mEq/L\nHCO3-: 9 mEq/L\nBUN: 20 mg/dL\nGlucose: 599 mg/dL\nCreatinine: 1.1 mg/dL\nCa2+: 10.2 mg/dL\nAST: 12 U/L\nALT: 10 U/L\n\nAn initial ECG is notable for sinus tachycardia.",
        "Question": "What is the patient's serum osmolality in terms of mOsm/kg?",
        "Relevant Entities": "{'Blood Urea Nitrogen (BUN)': [20.0, 'mg/dL'], 'Glucose': [599.0, 'mg/dL'], 'Sodium': [139.0, 'mEq/L']}",
        "Ground Truth Answer": "318.421",
        "Lower Limit": "302.5",
        "Upper Limit": "334.342",
        "Ground Truth Explanation": "The formula for computing serum osmolality is 2 * Na + (BUN / 2.8) + (glucose / 18), where Na is the concentration of sodium in mmol/L, the concentration of BUN is in mg/dL, and the concentration of glucose is in mg/dL.\nThe concentration of sodium is 139.0 mEq/L. We need to convert the concentration to mmol/L. Let's first convert the mass of sodium from mEq to mmol. The mass of sodium is 139.0 mEq. To convert from 139.0 mEq to mmol, convert from mEq to mmol. The compound 139.0 has a valence of 1, and so divide the valence by the value of mEq to get, 139.0 mEq/(1 mEq/mmol) = 139.0 mmol sodium. The volume units is L so no volume conversion is needed. Hence, the concentration value of 139.0 mEq sodium/L converts to 139.0 mmol sodium/L. \nThe concentration of bun is 20.0 mg/dL. \nThe concentration of glucose is 599.0 mg/dL. \nPlugging these values into the equation, we get 2 * 139.0 + (20.0 / 2.8) + (20.0 / 18) = 318.421 mmol/L.The patient's calculated serum osmolality concentration is 318.421 mmol/L. This is equalivalent to 318.421 mOsm/kg.",
        "File Path": "camel/toolkits/medcalc_bench/sOsm.py",
        "Usr Msg": "A 22-year-old woman with a history of type I diabetes mellitus presents to the emergency department with nausea, vomiting, and drowsiness for the past day. Her temperature is 98.3°F (36.8°C), blood pressure is 114/74 mmHg, pulse is 120/min, respirations are 27/min, and oxygen saturation is 100% on room air. Physical exam is notable for a confused and lethargic young woman. Initial laboratory values are notable for the findings below.\n\nSerum:\nNa+: 139 mEq/L\nCl-: 100 mEq/L\nK+: 2.9 mEq/L\nHCO3-: 9 mEq/L\nBUN: 20 mg/dL\nGlucose: 599 mg/dL\nCreatinine: 1.1 mg/dL\nCa2+: 10.2 mg/dL\nAST: 12 U/L\nALT: 10 U/L\n\nAn initial ECG is notable for sinus tachycardia. What is the patient's serum osmolality in terms of mOsm/kg?"
    },
    {
        "Calculator ID": 31,
        "Calculator Name": "HOMA-IR (Homeostatic Model Assessment for Insulin Resistance)",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-3114100-1",
        "Note Type": "Extracted",
        "Patient Note": "In the 1998 report on the treatment of B, he was 20 years old. B had been a child with a classical gender dysphoric development and fulfilled the current criteria for GnRH analog treatment eligibility. He was interviewed shortly after his legal gender change. This meant that he had had puberty suppression, cross-sex hormone treatment, a mastectomy, ovariectomy, and uterus extirpation. From his assessment during the diagnostic phase, he appeared to be an intelligent person (IQ = 128) with excellent problem-solving capabilities with respect to emotional matters. Vulnerable aspects of his psychological functioning were his insecurity about himself and moderately depressed feelings. In all other areas, his scores on a broad range of measures were in the average range, as compared to Dutch normative samples. Shame concerning his transsexualism made him highly selective in his friendships and guarded in his contacts with new people. At the assessment, 1 year after his ovariectomy but prior to his metaidoioplasty, he no longer reported feelings of gender dysphoria. He had adjusted easily to the male role and expressed no doubts on the adequacy of his masculine behavior. After the development of his secondary male sex characteristics, nobody had ever approached him as a woman. He never felt any regrets about his decision and had never contemplated living as a girl again. Knowing what gender reassignment implied, he would do it all over again. B was happy with his life and did not feel lonely. He showed a significant pre-post treatment decrease in his feelings of inadequacy. At the time, he was attending medical school.\nB attended the pediatric endocrinology clinic for the first time when he was age 13.7 years. His medical history was uneventful. Puberty had started 1–2 years previously, but menarche had not occurred. On physical examination, a healthy girl was seen with a height of 157.3 cm and a Tanner pubertal stage of B3, P3. Bone age according to Tanner and Whitehouse was 13.5 years. Target height, as a female, was estimated at 171 cm, based on the parental height. Puberty suppression was induced by the GnRH analog Triptorelin, in a dose of 3.75 mg every 4 weeks intramuscularly. On this dosage, B steadily kept on growing.\nAt age 18.6 years, his height was 165.8 cm. Induction of male puberty and accompanying secondary male sex characteristics was initiated by administration of 100 mg testosterone-ester mixture intramuscularly every 2 weeks. This was, after 6 months, increased to 250 mg testosterone-ester mixture, every 2–3 weeks intramuscularly. At the start of the androgen treatment, the Triptorelin treatment was discontinued.\nWhen B was 20 years old, he had a subcutaneous mastectomy by way of an infra-areolar approach, a few months later followed by a hysterectomy and gonadectomy. Two years later, metaidoioplasty and testes implantation were performed.\nFifteen years after the first interview and testing session, at age 35, B was seen again at the clinic. He lived on his own and he worked as a family doctor in private practice with two colleagues. All family members knew about his transitioning as did some of his friends. He was very satisfied about his circle of friends and had never been treated negatively because of his transsexualism.\nB was still satisfied about his (minor) breast surgery, his ovariectomy, and his hysterectomy, but no longer about the metaidoioplasty he underwent one year after the first follow-up session. He did not like its size and shape and he could hardly urinate in a standing position. He was able to have orgasms, but he could not have sexual intercourse. Because of his desire to have more convincingly male appearing external genitals and his wish to be able urinate in a standing position, he considered having a phalloplasty. Despite his good looks and very masculine appearance, he had not had many steady girlfriends, which may have resulted from the guardedness he already had as an adolescent. At age 29, he had a serious relationship with a woman, which lasted for 5 years. However, he chose not to live together when the opportunity to do so arose. After his choice to continue living apart, his girlfriend ended the relationship, a few months before his interview at the clinic. This made him very much regret his lack of commitment. B considered it likely that his need to distance himself from her had been related to his shame about his genital appearance and his feelings of inadequacy in sexual matters. Additional factors, such as serious illness of his father and a suicide among his sisters’ in-laws, made him rather sad at the time of the interview. Although his psychoneuroticism score on the Symptom Checklist-90 (Arrindell & Ettema, ) was in the normal range, his depression subscore was high, indicating depressed feelings. However, on the Beck Depression Inventory, he scored in the “minimal range” (van der Does, ), indicating that he did not fulfill criteria for clinical depression. On the Adult Self-Report, assessing adaptive functioning and problems in adults aged 18-59 years (Achenbach & Rescorla, ), all his scores were in the normal range.\nIt seems, therefore, that B functioned well in most aspects of life, but that he was still struggling with the question, how to handle the dissatisfaction and shame about his genital appearance.\nAt age 35, on physical examination, we saw a healthy and well virilized person. Blood pressure was 120/85 mmHg, final height was 169.5 cm and weight was 73 kg, which resulted in a body mass index (BMI) of 25.4 kg/m2. Sitting height was 88 cm. Skull circumference was 55.5 cm. For a comparison of his anthropometrical measurements to the normal reference values of Dutch males and females, see Table .\nA fasting venous blood sample was drawn. General health markers, like hematological parameters (Hb, ht, erythrocytes), renal function, and liver enzymes, were all within the normal reference value ranges. His lipid profile showed a total cholesterol level of 228.3 mg/dl (<251.5 mg/dl), LDL-cholesterol 154.8 mg/dl (<193.5 mg/dl), HDL-cholesterol 55.0 mg/dl (>34.8 mg/dl), and triglycerides 97.4 mg/dl (<177 mg/dl). His glucose value was 97.3 mg/dl (<144.1 mmol/l) with an insulin level of 21 pmol/l (12–96 pmol/l for a fasting sample). His HbA1c was 5.4% (4.3–6.1%). These values were in the normal range.\nWith respect to the gonadal axis, a normal-low serum testosterone level of 236.6 ng/dl (231–866 ng/dl) was found. This relatively low level was probably due to the fact that the blood sample was taken just before the next testosterone-ester mixture injection. Gonadotropins were elevated as a consequence of the gonadectomy. LH and FSH were 16 U/l and 50 U/l, respectively. Additionally determined endocrine parameters, such as thyroid and adrenal function, were all within normal reference ranges.\nWith respect to bone mineral density (BMD), a dual energy X-ray absorptiometry (DEXA) scan was performed to determine B’s BMD in the lumbar spine, the non-dominant hip, and (further) total body. The observed values were related to the bone peak mass for white females and for white males, resulting in T-scores. For all values, the z-score was determined as well (see Table ).",
        "Question": "What is the patient's HOMA-IR score?",
        "Relevant Entities": "{'Insulin': [756.0, 'pmol/L'], 'Glucose': [97.3, 'mg/dL']}",
        "Ground Truth Answer": "181.627",
        "Lower Limit": "172.546",
        "Upper Limit": "190.708",
        "Ground Truth Explanation": "The formula for computing HOMA-IR score is (insulin (µIU/mL) * glucose mg/dL)/405.\nThe concentration of insulin is 756.0 pmol/L. We to need convert the concentration of insulin to pmol/L, by multiplying by the conversion factor of 6.0 µIU/mL/pmol/L. This makes the insulin concentration 126.0 * 6 µIU/mL/pmol/L = 756.0 µIU/mL.\nThe concentration of glucose is 97.3 mg/dL. \nPlugging into the formula will give us 756.0 * 97.3/405 = 181.627. Hence, the patient's HOMA-IR score is 181.627. ",
        "File Path": "camel/toolkits/medcalc_bench/homa_ir.py",
        "Usr Msg": "In the 1998 report on the treatment of B, he was 20 years old. B had been a child with a classical gender dysphoric development and fulfilled the current criteria for GnRH analog treatment eligibility. He was interviewed shortly after his legal gender change. This meant that he had had puberty suppression, cross-sex hormone treatment, a mastectomy, ovariectomy, and uterus extirpation. From his assessment during the diagnostic phase, he appeared to be an intelligent person (IQ = 128) with excellent problem-solving capabilities with respect to emotional matters. Vulnerable aspects of his psychological functioning were his insecurity about himself and moderately depressed feelings. In all other areas, his scores on a broad range of measures were in the average range, as compared to Dutch normative samples. Shame concerning his transsexualism made him highly selective in his friendships and guarded in his contacts with new people. At the assessment, 1 year after his ovariectomy but prior to his metaidoioplasty, he no longer reported feelings of gender dysphoria. He had adjusted easily to the male role and expressed no doubts on the adequacy of his masculine behavior. After the development of his secondary male sex characteristics, nobody had ever approached him as a woman. He never felt any regrets about his decision and had never contemplated living as a girl again. Knowing what gender reassignment implied, he would do it all over again. B was happy with his life and did not feel lonely. He showed a significant pre-post treatment decrease in his feelings of inadequacy. At the time, he was attending medical school.\nB attended the pediatric endocrinology clinic for the first time when he was age 13.7 years. His medical history was uneventful. Puberty had started 1–2 years previously, but menarche had not occurred. On physical examination, a healthy girl was seen with a height of 157.3 cm and a Tanner pubertal stage of B3, P3. Bone age according to Tanner and Whitehouse was 13.5 years. Target height, as a female, was estimated at 171 cm, based on the parental height. Puberty suppression was induced by the GnRH analog Triptorelin, in a dose of 3.75 mg every 4 weeks intramuscularly. On this dosage, B steadily kept on growing.\nAt age 18.6 years, his height was 165.8 cm. Induction of male puberty and accompanying secondary male sex characteristics was initiated by administration of 100 mg testosterone-ester mixture intramuscularly every 2 weeks. This was, after 6 months, increased to 250 mg testosterone-ester mixture, every 2–3 weeks intramuscularly. At the start of the androgen treatment, the Triptorelin treatment was discontinued.\nWhen B was 20 years old, he had a subcutaneous mastectomy by way of an infra-areolar approach, a few months later followed by a hysterectomy and gonadectomy. Two years later, metaidoioplasty and testes implantation were performed.\nFifteen years after the first interview and testing session, at age 35, B was seen again at the clinic. He lived on his own and he worked as a family doctor in private practice with two colleagues. All family members knew about his transitioning as did some of his friends. He was very satisfied about his circle of friends and had never been treated negatively because of his transsexualism.\nB was still satisfied about his (minor) breast surgery, his ovariectomy, and his hysterectomy, but no longer about the metaidoioplasty he underwent one year after the first follow-up session. He did not like its size and shape and he could hardly urinate in a standing position. He was able to have orgasms, but he could not have sexual intercourse. Because of his desire to have more convincingly male appearing external genitals and his wish to be able urinate in a standing position, he considered having a phalloplasty. Despite his good looks and very masculine appearance, he had not had many steady girlfriends, which may have resulted from the guardedness he already had as an adolescent. At age 29, he had a serious relationship with a woman, which lasted for 5 years. However, he chose not to live together when the opportunity to do so arose. After his choice to continue living apart, his girlfriend ended the relationship, a few months before his interview at the clinic. This made him very much regret his lack of commitment. B considered it likely that his need to distance himself from her had been related to his shame about his genital appearance and his feelings of inadequacy in sexual matters. Additional factors, such as serious illness of his father and a suicide among his sisters’ in-laws, made him rather sad at the time of the interview. Although his psychoneuroticism score on the Symptom Checklist-90 (Arrindell & Ettema, ) was in the normal range, his depression subscore was high, indicating depressed feelings. However, on the Beck Depression Inventory, he scored in the “minimal range” (van der Does, ), indicating that he did not fulfill criteria for clinical depression. On the Adult Self-Report, assessing adaptive functioning and problems in adults aged 18-59 years (Achenbach & Rescorla, ), all his scores were in the normal range.\nIt seems, therefore, that B functioned well in most aspects of life, but that he was still struggling with the question, how to handle the dissatisfaction and shame about his genital appearance.\nAt age 35, on physical examination, we saw a healthy and well virilized person. Blood pressure was 120/85 mmHg, final height was 169.5 cm and weight was 73 kg, which resulted in a body mass index (BMI) of 25.4 kg/m2. Sitting height was 88 cm. Skull circumference was 55.5 cm. For a comparison of his anthropometrical measurements to the normal reference values of Dutch males and females, see Table .\nA fasting venous blood sample was drawn. General health markers, like hematological parameters (Hb, ht, erythrocytes), renal function, and liver enzymes, were all within the normal reference value ranges. His lipid profile showed a total cholesterol level of 228.3 mg/dl (<251.5 mg/dl), LDL-cholesterol 154.8 mg/dl (<193.5 mg/dl), HDL-cholesterol 55.0 mg/dl (>34.8 mg/dl), and triglycerides 97.4 mg/dl (<177 mg/dl). His glucose value was 97.3 mg/dl (<144.1 mmol/l) with an insulin level of 21 pmol/l (12–96 pmol/l for a fasting sample). His HbA1c was 5.4% (4.3–6.1%). These values were in the normal range.\nWith respect to the gonadal axis, a normal-low serum testosterone level of 236.6 ng/dl (231–866 ng/dl) was found. This relatively low level was probably due to the fact that the blood sample was taken just before the next testosterone-ester mixture injection. Gonadotropins were elevated as a consequence of the gonadectomy. LH and FSH were 16 U/l and 50 U/l, respectively. Additionally determined endocrine parameters, such as thyroid and adrenal function, were all within normal reference ranges.\nWith respect to bone mineral density (BMD), a dual energy X-ray absorptiometry (DEXA) scan was performed to determine B’s BMD in the lumbar spine, the non-dominant hip, and (further) total body. The observed values were related to the bone peak mass for white females and for white males, resulting in T-scores. For all values, the z-score was determined as well (see Table ). What is the patient's HOMA-IR score?"
    },
    {
        "Calculator ID": 33,
        "Calculator Name": "FeverPAIN Score for Strep Pharyngitis",
        "Category": "diagnosis",
        "Output Type": "integer",
        "Note ID": "pmc-5403165-2",
        "Note Type": "Extracted",
        "Patient Note": "A 17-year-old young man presented to the pediatric emergency department with intermittent high-grade fever for two days in August 2015. This was associated with myalgia, headache, rhinorrhea, sore throat, productive cough and abdominal pain. Physical examination showed a congested oropharynx and soft abdomen with hyperactive bowel sounds. Laboratory tests showed a WBC of 3.06×109/L, a HCT of 38.6% and a platelet count of 151×109/L. Throat swab tested negative for influenza quick test and negative for beta-hemolytic streptococcus and nasopharyngeal swab was positive for DENV-2. His stool was negative for adenovirus (Adenolex test, Orion Diagnostica, Finland, as text in S1). He was treated for acute bacterial tonsillitis with oral amoxicillin and followed up in the pediatric clinic 2 days after, with marked improvement of symptoms.",
        "Question": "What is the patient's FeverPAIN score?",
        "Relevant Entities": "{'Symptom onset ≤3 days': True, 'Purulent tonsils': False, 'Fever in past 24 hours': True, 'Severe tonsil inflammation': False, 'Absence of cough or coryza': False}",
        "Ground Truth Answer": "2",
        "Lower Limit": "2",
        "Upper Limit": "2",
        "Ground Truth Explanation": "The patient's current FeverPain score is 0.\n'The patient is reported to have a fever in the past 24 hours and so we increment the score by 1, making the current total 0 + 1 = 1.\nThe patient is reported to not have an absence of cough or coryza and so we do not increment the score, keeping the current total at 1.\n'The patient is reported to have a symptom onset ≤3 days and so we increment the score by 1, making the current total 1 + 1 = 2.\nThe patient is reported to not have purulent tonsils and so we do not increment the score, keeping the current total at 2.\nThe patient is reported to not have severe tonsil inflammation and so we do not increment the score, keeping the current total at 2.\nThe patient's FeverPain score is 2 points.",
        "File Path": "camel/toolkits/medcalc_bench/feverpain.py",
        "Usr Msg": "A 17-year-old young man presented to the pediatric emergency department with intermittent high-grade fever for two days in August 2015. This was associated with myalgia, headache, rhinorrhea, sore throat, productive cough and abdominal pain. Physical examination showed a congested oropharynx and soft abdomen with hyperactive bowel sounds. Laboratory tests showed a WBC of 3.06×109/L, a HCT of 38.6% and a platelet count of 151×109/L. Throat swab tested negative for influenza quick test and negative for beta-hemolytic streptococcus and nasopharyngeal swab was positive for DENV-2. His stool was negative for adenovirus (Adenolex test, Orion Diagnostica, Finland, as text in S1). He was treated for acute bacterial tonsillitis with oral amoxicillin and followed up in the pediatric clinic 2 days after, with marked improvement of symptoms. What is the patient's FeverPAIN score?"
    },
    {
        "Calculator ID": 38,
        "Calculator Name": "Free Water Deficit",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-6175253-1",
        "Note Type": "Extracted",
        "Patient Note": "A 32-year-old female with history of diabetes mellitus type one and a successful RYGB for morbid obesity three years ago presented to our clinic with the complaints of cough, greenish yellow sputum production, chills and night sweats for the last three months. She was feeling more fatigued, generalized weakness and unintentionally lost 33 pounds during that time. She denied recent history of travel out of state. The patient was in the United States and had never been to a country with endemic tuberculosis. She denied recent remote history of incarceration. She also denied hemoptysis, shortness of breath, headache or fever. She had no history of being diagnosed with TB or history of recent sick contacts. On physical examination, her temperature was 36.9°C, blood pressure was 116/60 mm Hg, pulse was 84 per minute and respiratory rate was 16 per minute. On chest auscultation, few rhonchi were present in the right upper lung and the rest of the physical examination was unremarkable. The Initial blood work showed sodium of 134 mmol/L (136–145 mmol/L), potassium of 4.2 mmol/L (3.5–5.1 mmol/L), bicarbonate of 28 mEq/L (23–31 mEq/L), blood urea nitrogen (BUN) of 6 mg/dL (9–21 mg/dL), creatinine of 0.33 mg/dL (0.6–1.1 mg/dL), glucose of 150 mg/dL (80–115 mg/dL) and liver function tests were within normal range. Her white blood cell count was 14,500/µL (4500–11000/µL) with 81% neutrophils. Her chest X-ray showed multiple small nodular opacities throughout the right lung with a probable cavity in the right lung apex (Figure ). Suspicion was raised for possible active TB and she was admitted in airborne isolation. Two peripheral blood cultures, sputum culture along with acid-fast bacilli (AFB) were ordered. Computed tomography (CT) chest without contrast showed multiple thick-walled cavities in the right upper lobe. The largest cavity was 7 cm. There were innumerable centrilobular nodules and tree in bud opacities throughout the right lung (Figures , ). Mycobacterium tuberculosis bacillus was detected by sputum AFB staining and later confirmed by culture and polymerase chain reaction (PCR) assay. She also had a positive QuantiFERON test. She was started on anti-tuberculosis treatment (ATT) medications including Isoniazid 300 mg daily, Rifampin 300 mg twice daily, Ethambutol 800 mg daily, Pyrazinamide 1000 mg daily and Pyridoxine 50 mg daily for the first two months and then two drugs Isoniazid and Rifampin for the next four months. After three days of hospital stay, she started showing some improvement in her symptoms such as cough and night sweats. She understood the isolation precautions, especially respiratory precautions and use of mask in the presence of other individuals. She was later discharged in stable condition with the above-mentioned medications. She had complete resolution of her symptoms in two months and completed six months course of ATT.",
        "Question": "What is the patient's free water deficit in terms of liters? You may take the ideal sodium concentration to be 140 mEq/L.",
        "Relevant Entities": "{'sex': 'Female', 'age': [32, 'years'], 'weight': [33.0, 'lbs'], 'Sodium': [134.0, 'mmol/L']}",
        "Ground Truth Answer": "-0.321",
        "Lower Limit": "-0.337",
        "Upper Limit": "-0.305",
        "Ground Truth Explanation": "The formula for computing the free water deficit is (total body water percentage) * (weight) * (sodium/140 - 1), where the total body water percentage is a percentage expressed as a decimal, weight is in kg, and the sodium concentration is in mmol/L.\nThe patient's total body weight percentage is based on the patient's age and gender.\nThe patient is 32 years old. The patient's is a Female.\nThe patient's age is between 18 and 64 and so the patient is an adult. For adult female's the total body water percentage value is 0.50.\nThe patient's weight is 33.0 lbs so this converts to 33.0 lbs * 0.453592 kg/lbs = 14.969 kg. The concentration of sodium is 134.0 mmol/L. Plugging in these values into the equation, we get 0.5 * 14.969 * (134.0/140 - 1) = -0.321 L. The patient's free body water deficit is -0.321 L.",
        "File Path": "camel/toolkits/medcalc_bench/free_water_deficit.py",
        "Usr Msg": "A 32-year-old female with history of diabetes mellitus type one and a successful RYGB for morbid obesity three years ago presented to our clinic with the complaints of cough, greenish yellow sputum production, chills and night sweats for the last three months. She was feeling more fatigued, generalized weakness and unintentionally lost 33 pounds during that time. She denied recent history of travel out of state. The patient was in the United States and had never been to a country with endemic tuberculosis. She denied recent remote history of incarceration. She also denied hemoptysis, shortness of breath, headache or fever. She had no history of being diagnosed with TB or history of recent sick contacts. On physical examination, her temperature was 36.9°C, blood pressure was 116/60 mm Hg, pulse was 84 per minute and respiratory rate was 16 per minute. On chest auscultation, few rhonchi were present in the right upper lung and the rest of the physical examination was unremarkable. The Initial blood work showed sodium of 134 mmol/L (136–145 mmol/L), potassium of 4.2 mmol/L (3.5–5.1 mmol/L), bicarbonate of 28 mEq/L (23–31 mEq/L), blood urea nitrogen (BUN) of 6 mg/dL (9–21 mg/dL), creatinine of 0.33 mg/dL (0.6–1.1 mg/dL), glucose of 150 mg/dL (80–115 mg/dL) and liver function tests were within normal range. Her white blood cell count was 14,500/µL (4500–11000/µL) with 81% neutrophils. Her chest X-ray showed multiple small nodular opacities throughout the right lung with a probable cavity in the right lung apex (Figure ). Suspicion was raised for possible active TB and she was admitted in airborne isolation. Two peripheral blood cultures, sputum culture along with acid-fast bacilli (AFB) were ordered. Computed tomography (CT) chest without contrast showed multiple thick-walled cavities in the right upper lobe. The largest cavity was 7 cm. There were innumerable centrilobular nodules and tree in bud opacities throughout the right lung (Figures , ). Mycobacterium tuberculosis bacillus was detected by sputum AFB staining and later confirmed by culture and polymerase chain reaction (PCR) assay. She also had a positive QuantiFERON test. She was started on anti-tuberculosis treatment (ATT) medications including Isoniazid 300 mg daily, Rifampin 300 mg twice daily, Ethambutol 800 mg daily, Pyrazinamide 1000 mg daily and Pyridoxine 50 mg daily for the first two months and then two drugs Isoniazid and Rifampin for the next four months. After three days of hospital stay, she started showing some improvement in her symptoms such as cough and night sweats. She understood the isolation precautions, especially respiratory precautions and use of mask in the presence of other individuals. She was later discharged in stable condition with the above-mentioned medications. She had complete resolution of her symptoms in two months and completed six months course of ATT. What is the patient's free water deficit in terms of liters? You may take the ideal sodium concentration to be 140 mEq/L."
    },
    {
        "Calculator ID": 39,
        "Calculator Name": "Anion Gap",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-3986739-1",
        "Note Type": "Extracted",
        "Patient Note": "A ten-year-old girl was admitted to our hospital with complaints of cough, fever, vomiting, weakness and lack of appetite. She also suffered from alopecia and persistent/recurring respiratory infections. Both parents were reported to be healthy and they were consanguineous (first cousins). Their four children except for our patient were healthy.\nPhysical examination of the patient revealed normal vital signs. The percentiles of her weight and height were between the 3rd and 10th percentiles. She had pale skin, total alopecia and pitting in the nails of her hands and feet (). A crackling sound was heard during inspiration. Her puberty was stage I according to Tanner stages.\nHer hematology results revealed a hemoglobin level of 7.0 g/dL, hematocrit 19.9%, white blood cells 13200/mm3, platelets 35000/mm3, MCV 84fL and reticulocytes of 8.14%, as well as negative direct Coombs test result. Blood smear showed schistocytes (). Her biochemical investigation revealed: urea 142 mg/dL, creatinine 4.61 mg/dL, AST 97 U/L, ALT 79 U/L, LDH 2218 U/L, total bilirubin 1.5 mg/dL, direct bilirubin 0.55 mg/dL, sodium 134 mmol/L, potassium 5.9 mmol/L, chloride 109 mmol/L, calcium 8.7 mg/dL, phosphorus 4.0 mg/dL, uric acid 8.0 mg/dL, ph 7.44, HCO3- 21 mmol/L and glucose 76 mg/dL. The urinalysis showed the following: pH 7.5, density 1010, protein (++), erythrocytes (+++), leucocytes (-) and dysmorphic erythrocytes in the urinary sediment.\nBased on these biochemical and urinary abnormalities, the patient was diagnosed as HUS. After seven plasma exchange sessions, the hemolysis finally stopped and the laboratory abnormalities and renal function reverted to normal. The respiratory infection was treated with appropriate antibiotic regimens.\nIn the hormonal evaluation, free thyroxine (fT4) was 1.11 ng/dL (0.8-2.2), thyroid-stimulating hormone (TSH) 3.028 mU/mL (0.6-5.5), anti-peroxidase (anti-TPO) antibody 62 IU/ mL (<20), anti-thyroglobulin (anti-TG) antibody 65 IU/mL (<4.0), cortisol 25.5 mg/dL (3-21), adrenocorticotropic hormone (ACTH) 28.1 pg/mL (10-60), estradiol 14 ng/dL (0.2.0), follicle-stimulating hormone (FSH) 0.32 mIU/mL, luteinizing hormone (LH) 0.07 mIU/mL (0.02-0.3), anti-pancreatic islets antibody 1/100 (<1/10), parathyroid hormone (PTH) 65.9 ng/mL (10-65), renin 72 ng/L (5-35), aldosterone 248 pg/mL (20-300), vitamin B12 456 pg/mL (150-883) and folic acid 4.2 ng/mL (3.1-20.5) before plasma exchange therapy. Although thyroid ultrasonography was normal and the patient was not on Na-L-T4 treatment, both anti-TPO antibody and anti-TG antibody tests were positive. These findings suggested early diagnosed autoimmune thyroiditis. Cortisol response to ACTH stimulation test (1 μg ACTH) was as follows: initial 1 mg/dL, 30th minute 8.1 mg/dL, 60th minute 11.2 mcg/dL, 90th minute 14.1 mg/dL, and 120th 14.7 mg/dL. The cut-off level of this test was 14 mg/dL (9). These results were interpreted as a normal response to ACTH stimulation test and indicated that there was no adrenal insufficiency. In immunological evaluation, IgA was 24 mg/dL (29-384), IgM 24 mg/dL (50-278), IgG 464 mg/dL (625-1579), IgE 464 IU/mL (0-170), C3 90 mg/dL (90-180), C4 26 mg/dL (10-40), anti-nuclear antibody (ANA) (-), anti-double strain DNA antibody (-), p-ANCA (-), c-ANCA (-) and anti-HBs (-) before plasma exchange therapy. Lymphocyte subsets were CD3 78% (55-78), CD19 2% (10-31), CD4 39% (27-53) and CD8 51% (19-34). The complement factor H gene region was proliferated by PCR method. Sequences which have single nucleotide polymorphism on complement factor H have been determined. CT homozygote polymorphism for His402Tyr was detected. This factor is considered to be a risk factor for development of HUS (). In radiological evaluation, pulmonary X-ray showed bilateral diffuse infiltration and abdominal ultrasonography was normal except for hepatomegaly and grade I increase in renal echogenicity.",
        "Question": "What is the patient's anion gap in terms of mEq/L?",
        "Relevant Entities": "{'Chloride': [109.0, 'mmol/L'], 'Bicarbonate': [21.0, 'mmol/L'], 'Sodium': [134.0, 'mmol/L']}",
        "Ground Truth Answer": "4.0",
        "Lower Limit": "3.8",
        "Upper Limit": "4.2",
        "Ground Truth Explanation": "The formula for computing a patient's anion gap is: sodium (mEq/L) - (chloride (mEq/L)+ bicarbonate (mEq/L)).\nThe concentration of sodium is 134.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of sodium from mmol to mEq. The mass of sodium is 134.0 mmol. The compound, sodium, has a valence of 1, and so multiply the valence by the value of mmol to get, 134.0 mmol * 1 mEq/mmol = 134.0 mEq sodium. The volume units is L so no volume conversion is needed. Hence, the concentration value of 134.0 mmol sodium/L converts to 134.0 mEq sodium/L. \nThe concentration of chloride is 109.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of chloride from mmol to mEq. The mass of chloride is 109.0 mmol. The compound, chloride, has a valence of 1, and so multiply the valence by the value of mmol to get, 109.0 mmol * 1 mEq/mmol = 109.0 mEq chloride. The volume units is L so no volume conversion is needed. Hence, the concentration value of 109.0 mmol chloride/L converts to 109.0 mEq chloride/L. \nThe concentration of bicarbonate is 21.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of bicarbonate from mmol to mEq. The mass of bicarbonate is 21.0 mmol. The compound, bicarbonate, has a valence of 1, and so multiply the valence by the value of mmol to get, 21.0 mmol * 1 mEq/mmol = 21.0 mEq bicarbonate. The volume units is L so no volume conversion is needed. Hence, the concentration value of 21.0 mmol bicarbonate/L converts to 21.0 mEq bicarbonate/L. \nPlugging in these values into the anion gap formula gives us 134.0 mEq/L - (109.0 mEq/L + 21.0 mEq/L) = 4.0 mEq/L. Hence, The patient's anion gap is 4.0 mEq/L.",
        "File Path": "camel/toolkits/medcalc_bench/anion_gap.py",
        "Usr Msg": "A ten-year-old girl was admitted to our hospital with complaints of cough, fever, vomiting, weakness and lack of appetite. She also suffered from alopecia and persistent/recurring respiratory infections. Both parents were reported to be healthy and they were consanguineous (first cousins). Their four children except for our patient were healthy.\nPhysical examination of the patient revealed normal vital signs. The percentiles of her weight and height were between the 3rd and 10th percentiles. She had pale skin, total alopecia and pitting in the nails of her hands and feet (). A crackling sound was heard during inspiration. Her puberty was stage I according to Tanner stages.\nHer hematology results revealed a hemoglobin level of 7.0 g/dL, hematocrit 19.9%, white blood cells 13200/mm3, platelets 35000/mm3, MCV 84fL and reticulocytes of 8.14%, as well as negative direct Coombs test result. Blood smear showed schistocytes (). Her biochemical investigation revealed: urea 142 mg/dL, creatinine 4.61 mg/dL, AST 97 U/L, ALT 79 U/L, LDH 2218 U/L, total bilirubin 1.5 mg/dL, direct bilirubin 0.55 mg/dL, sodium 134 mmol/L, potassium 5.9 mmol/L, chloride 109 mmol/L, calcium 8.7 mg/dL, phosphorus 4.0 mg/dL, uric acid 8.0 mg/dL, ph 7.44, HCO3- 21 mmol/L and glucose 76 mg/dL. The urinalysis showed the following: pH 7.5, density 1010, protein (++), erythrocytes (+++), leucocytes (-) and dysmorphic erythrocytes in the urinary sediment.\nBased on these biochemical and urinary abnormalities, the patient was diagnosed as HUS. After seven plasma exchange sessions, the hemolysis finally stopped and the laboratory abnormalities and renal function reverted to normal. The respiratory infection was treated with appropriate antibiotic regimens.\nIn the hormonal evaluation, free thyroxine (fT4) was 1.11 ng/dL (0.8-2.2), thyroid-stimulating hormone (TSH) 3.028 mU/mL (0.6-5.5), anti-peroxidase (anti-TPO) antibody 62 IU/ mL (<20), anti-thyroglobulin (anti-TG) antibody 65 IU/mL (<4.0), cortisol 25.5 mg/dL (3-21), adrenocorticotropic hormone (ACTH) 28.1 pg/mL (10-60), estradiol 14 ng/dL (0.2.0), follicle-stimulating hormone (FSH) 0.32 mIU/mL, luteinizing hormone (LH) 0.07 mIU/mL (0.02-0.3), anti-pancreatic islets antibody 1/100 (<1/10), parathyroid hormone (PTH) 65.9 ng/mL (10-65), renin 72 ng/L (5-35), aldosterone 248 pg/mL (20-300), vitamin B12 456 pg/mL (150-883) and folic acid 4.2 ng/mL (3.1-20.5) before plasma exchange therapy. Although thyroid ultrasonography was normal and the patient was not on Na-L-T4 treatment, both anti-TPO antibody and anti-TG antibody tests were positive. These findings suggested early diagnosed autoimmune thyroiditis. Cortisol response to ACTH stimulation test (1 μg ACTH) was as follows: initial 1 mg/dL, 30th minute 8.1 mg/dL, 60th minute 11.2 mcg/dL, 90th minute 14.1 mg/dL, and 120th 14.7 mg/dL. The cut-off level of this test was 14 mg/dL (9). These results were interpreted as a normal response to ACTH stimulation test and indicated that there was no adrenal insufficiency. In immunological evaluation, IgA was 24 mg/dL (29-384), IgM 24 mg/dL (50-278), IgG 464 mg/dL (625-1579), IgE 464 IU/mL (0-170), C3 90 mg/dL (90-180), C4 26 mg/dL (10-40), anti-nuclear antibody (ANA) (-), anti-double strain DNA antibody (-), p-ANCA (-), c-ANCA (-) and anti-HBs (-) before plasma exchange therapy. Lymphocyte subsets were CD3 78% (55-78), CD19 2% (10-31), CD4 39% (27-53) and CD8 51% (19-34). The complement factor H gene region was proliferated by PCR method. Sequences which have single nucleotide polymorphism on complement factor H have been determined. CT homozygote polymorphism for His402Tyr was detected. This factor is considered to be a risk factor for development of HUS (). In radiological evaluation, pulmonary X-ray showed bilateral diffuse infiltration and abdominal ultrasonography was normal except for hepatomegaly and grade I increase in renal echogenicity. What is the patient's anion gap in terms of mEq/L?"
    },
    {
        "Calculator ID": 44,
        "Calculator Name": "LDL Calculated",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-7038555-1",
        "Note Type": "Extracted",
        "Patient Note": "An 18-year-old Black female who had been diagnosed with SCD in childhood, subsequently suffering frequent pain crises and undergoing repeated transfusions, presented to the emergency room with a 21-day history of progressive lower limb oedema accompanied by dyspnoea and orthopnoea. In addition, she reported a 3-day history of severe chest pain, together with a productive cough and fever as high as 38 °C. She reported no reduction in urine volume and no recent history of skin infection or tonsillitis. On physical examination, she was found to be very pallid and normotensive (blood pressure, 130/80 mmHg), with a heart rate of 104 bpm, a respiratory rate of 28 breaths/min, and oxygen saturation of 94% on room air, as well as being found to have developed anasarca. One month prior, she had undergone outpatient laboratory tests, which had shown that her renal function was normal—with a serum creatinine concentration of 0.75 mg/dl and an estimated glomerular filtration rate (eGFR), as determined by the Chronic Kidney Disease–Epidemiology Collaboration (CKD–EPI) equation, of 134.9 ml/min/1.73 m2—urine analysis showing no haematuria or proteinuria.\nBlood tests performed at admission to the emergency room revealed the following: haemoglobin, 6.1 g/dl; haematocrit, 18.8%; haptoglobin, < 10 mg/dl; reticulocyte fraction, 6.11%; no schistocytes; lactate dehydrogenase, 433 U/L; indirect bilirubin, 0.36 mg/dl; leucocyte count, 18,820 cells/mm3; neutrophil count, 13,630 cells/mm3; lymphocyte count, 2790 cells/mm3; platelet count, 622;000 cells/mm3; and urea, 29 mg/dl. The patient showed signs of hyperfiltration, including a serum creatinine concentration of 0.49 mg/dl and a CKD–EPI-determined eGFR of 148.5 ml/min/1.73 m2, although no hydroelectrolytic or acid-base disorders were identified. A urine sample was found to contain 100 leucocytes/field and 70 erythrocytes/field. In addition, 24-h proteinuria was 8.99 g. Further analysis of the blood samples showed the following: total proteins, 3.9 g/dl; albumin, 1.2 g/dl; globulins, 2.7 g/dl; total cholesterol, 210 mg/dl, low-density lipoprotein, 114 mg/dl; high-density lipoprotein, 37 mg/dl; triglycerides, 205 mg/dl; C4, 26.1 mg/dl (normal range, 10–38 mg/dl); C3, 62 mg/dl (normal range, 73–149 mg/dl); C-reactive protein, 24.9 mg/dl (normal range, < 5 mg/dl). The serology was negative for HIV, hepatitis B, and hepatitis C. The patient also tested negative for antinuclear factor, anti-DNA, rheumatoid factor, and antineutrophil cytoplasmic antibodies. Serum protein electrophoresis showed hypoalbuminaemia and an anti-streptolysin O level of 816 IU/ml (normal range, < 200 IU/ml). Blood and urine cultures were negative. A chest X-ray showed mild congestion and infiltrate in the right lung base. Ultrasound of the kidneys and urinary tract showed that the kidneys were normal in size and appearance.\nGiven the clinical presentation, the diagnostic hypothesis was pneumonia and anasarca due to nephritic-nephrotic syndrome. The patient was started on ceftriaxone (1 g, twice daily). Computed tomography angiography of the chest ruled out pulmonary thromboembolism and acute chest syndrome, thus indirectly confirming the diagnosis of pneumonia.\nAfter the infection had been controlled, the patient underwent renal biopsy. Light microscopy revealed 7 glomeruli with global endocapillary proliferation; neutrophil and macrophage infiltrate (Fig. a); synechiae in 10% of the glomeruli; occasional splitting of the glomerular basement membrane; and a preserved Bowman’s capsule. The tubules were dilated, with foci of epithelial regeneration and neutrophils within their lumina. There was focal oedema in the interstitium. The interlobular arteries had a normal aspect, with intimal proliferation in the arterioles. Immunofluorescence performed on frozen sections showed intensity of deposition of C3 (2+/3+), IgG (1+/3+), IgA (1+/3+) and lambda light chains (1+/3+), with a granular pattern, distributed diffusely throughout the capillary loop. Collectively, the histological findings were consistent with a diagnosis of APIGN accompanied by microangiopathic changes related to the underlying disease.\nTreatment with a diuretic and an anti-proteinuric agent (angiotensin-converting enzyme inhibitor) was instituted, and the patient evolved to clinical improvement (normalisation of blood pressure, as well as resolution of the proteinuria and haematuria). However, the signs of hyperfiltration persisted even after resolution of the proteinuria. In the final evaluation, the serum creatinine concentration was 0.33 mg/dl and the CKD–EPI-determined eGFR was 187.8 ml/min/1.73 m2. Evolution of laboratorial tests are available in Fig. .",
        "Question": "What is the patient's LDL cholestrol concentration? Please outuput your answer in terms of mg/dL.",
        "Relevant Entities": "{'high-density lipoprotein cholesterol': [37.0, 'mg/dL'], 'Triglycerides': [205.0, 'mg/dL'], 'Total cholesterol': [210.0, 'mg/dL']}",
        "Ground Truth Answer": "132.0",
        "Lower Limit": "125.4",
        "Upper Limit": "138.6",
        "Ground Truth Explanation": "To compute the patient's LDL cholestrol, apply the following formula: LDL cholesterol = total cholesterol - HDL - (triglycerides / 5), where the units for total cholestrol, HDL cholestrol, and triglycerides are all mg/dL.\nThe concentration of total cholestrol is 210.0 mg/dL. \nThe concentration of hdl cholestrol is 37.0 mg/dL. \nThe concentration of triglycerides is 205.0 mg/dL. \nPlugging in these values will give us 210.0 mg/dL - 37.0 mg/dL - (205.0/5) mg/dL = 132.0 mg/dL.\nThe patients concentration of LDL cholestrol is 132.0 mg/dL.",
        "File Path": "camel/toolkits/medcalc_bench/ldl_calculated.py",
        "Usr Msg": "An 18-year-old Black female who had been diagnosed with SCD in childhood, subsequently suffering frequent pain crises and undergoing repeated transfusions, presented to the emergency room with a 21-day history of progressive lower limb oedema accompanied by dyspnoea and orthopnoea. In addition, she reported a 3-day history of severe chest pain, together with a productive cough and fever as high as 38 °C. She reported no reduction in urine volume and no recent history of skin infection or tonsillitis. On physical examination, she was found to be very pallid and normotensive (blood pressure, 130/80 mmHg), with a heart rate of 104 bpm, a respiratory rate of 28 breaths/min, and oxygen saturation of 94% on room air, as well as being found to have developed anasarca. One month prior, she had undergone outpatient laboratory tests, which had shown that her renal function was normal—with a serum creatinine concentration of 0.75 mg/dl and an estimated glomerular filtration rate (eGFR), as determined by the Chronic Kidney Disease–Epidemiology Collaboration (CKD–EPI) equation, of 134.9 ml/min/1.73 m2—urine analysis showing no haematuria or proteinuria.\nBlood tests performed at admission to the emergency room revealed the following: haemoglobin, 6.1 g/dl; haematocrit, 18.8%; haptoglobin, < 10 mg/dl; reticulocyte fraction, 6.11%; no schistocytes; lactate dehydrogenase, 433 U/L; indirect bilirubin, 0.36 mg/dl; leucocyte count, 18,820 cells/mm3; neutrophil count, 13,630 cells/mm3; lymphocyte count, 2790 cells/mm3; platelet count, 622;000 cells/mm3; and urea, 29 mg/dl. The patient showed signs of hyperfiltration, including a serum creatinine concentration of 0.49 mg/dl and a CKD–EPI-determined eGFR of 148.5 ml/min/1.73 m2, although no hydroelectrolytic or acid-base disorders were identified. A urine sample was found to contain 100 leucocytes/field and 70 erythrocytes/field. In addition, 24-h proteinuria was 8.99 g. Further analysis of the blood samples showed the following: total proteins, 3.9 g/dl; albumin, 1.2 g/dl; globulins, 2.7 g/dl; total cholesterol, 210 mg/dl, low-density lipoprotein, 114 mg/dl; high-density lipoprotein, 37 mg/dl; triglycerides, 205 mg/dl; C4, 26.1 mg/dl (normal range, 10–38 mg/dl); C3, 62 mg/dl (normal range, 73–149 mg/dl); C-reactive protein, 24.9 mg/dl (normal range, < 5 mg/dl). The serology was negative for HIV, hepatitis B, and hepatitis C. The patient also tested negative for antinuclear factor, anti-DNA, rheumatoid factor, and antineutrophil cytoplasmic antibodies. Serum protein electrophoresis showed hypoalbuminaemia and an anti-streptolysin O level of 816 IU/ml (normal range, < 200 IU/ml). Blood and urine cultures were negative. A chest X-ray showed mild congestion and infiltrate in the right lung base. Ultrasound of the kidneys and urinary tract showed that the kidneys were normal in size and appearance.\nGiven the clinical presentation, the diagnostic hypothesis was pneumonia and anasarca due to nephritic-nephrotic syndrome. The patient was started on ceftriaxone (1 g, twice daily). Computed tomography angiography of the chest ruled out pulmonary thromboembolism and acute chest syndrome, thus indirectly confirming the diagnosis of pneumonia.\nAfter the infection had been controlled, the patient underwent renal biopsy. Light microscopy revealed 7 glomeruli with global endocapillary proliferation; neutrophil and macrophage infiltrate (Fig. a); synechiae in 10% of the glomeruli; occasional splitting of the glomerular basement membrane; and a preserved Bowman’s capsule. The tubules were dilated, with foci of epithelial regeneration and neutrophils within their lumina. There was focal oedema in the interstitium. The interlobular arteries had a normal aspect, with intimal proliferation in the arterioles. Immunofluorescence performed on frozen sections showed intensity of deposition of C3 (2+/3+), IgG (1+/3+), IgA (1+/3+) and lambda light chains (1+/3+), with a granular pattern, distributed diffusely throughout the capillary loop. Collectively, the histological findings were consistent with a diagnosis of APIGN accompanied by microangiopathic changes related to the underlying disease.\nTreatment with a diuretic and an anti-proteinuric agent (angiotensin-converting enzyme inhibitor) was instituted, and the patient evolved to clinical improvement (normalisation of blood pressure, as well as resolution of the proteinuria and haematuria). However, the signs of hyperfiltration persisted even after resolution of the proteinuria. In the final evaluation, the serum creatinine concentration was 0.33 mg/dl and the CKD–EPI-determined eGFR was 187.8 ml/min/1.73 m2. Evolution of laboratorial tests are available in Fig. . What is the patient's LDL cholestrol concentration? Please outuput your answer in terms of mg/dL."
    },
    {
        "Calculator ID": 45,
        "Calculator Name": "CURB-65 Score for Pneumonia Severity",
        "Category": "risk",
        "Output Type": "integer",
        "Note ID": "pmc-3299121-1",
        "Note Type": "Extracted",
        "Patient Note": "A 37-year-old young female patient presented with progressive dyspnea, hypoxia, and left lung consolidation. She had presented to our emergency department, with a 3-day history of shortness of breath, fever, and nonproductive cough. Her past medical history included recently diagnosed and untreated Hepatitis C, related to prolonged intravenous heroin abuse. She was on methadone de-addiction program but was continuing to occasionally using heroin, the last time a week prior to admission. She was also an active smoker, with a 20 pack-year history.\nOn clinical examination she appeared malnourished and dehydrated, with multiple skin tattoos and burn marks on the left forearm. Temperature was 38.2°C, respiratory rate 30/Min, blood pressure 90/50 mmHg, pulse rate 120 beats/min, oxygen saturation was 95% on room air. Heart sounds were dual, with no added sounds or murmurs. There were no crackles or wheezes audible on auscultation but air entry was markedly reduced on the left side. Routine laboratory investigations showed a hemoglobin of 99 g/L. white cell count 23.7 × 109/L with a neutrophil count of 22.75 × 109/L, and lymphocytes of 0.79 × 109/L, CRP 206 mg/L, Alanine transaminase (ALT) 26 U/L, Aspartate transaminase (AST) 18 U/L, urea 3.5 mmol/L, creatinine 42 μmol/L. Chest X-ray (CXR) showed complete left-sided consolidation with no mediastinal shift [Figures and ]. Venous access was obtained via central cannulation of the internal jugular vein and she was resuscitated with 2 L of normal saline, started on ticaricillin/caluvulanate 3.1 g 6 hourly and referred to intensive care unit for admission with a presumptive diagnosis of severe community-acquired pneumonia.\nDespite adequate fluid resuscitation, the patient remained hypotensive with decreasing urine output, and noradrenalin infusion was initiated to improve blood pressure. She was intubated for worsening tachypnea and fatigue. Prior to intubation, chest computed tomography (CT) was performed, which confirmed consolidation of both the lobes on the left side; interestingly, no foreign body was described on the initial CT report, but detected on review after bronchoscopy [Figures and ]. Serology was drawn to assess for Hepatitis, HIV, and atypical infection. The antibiotic regime was augmented with the addition of vancomycin and azythromycin.\nIn view of the history of intravenous drug abuse a transthoracic echocardiogram was performed, which demonstrated mild tricuspid regurgitation, no vegetations, and normal cardiac function. The patient was ventilated on synchronized intermittent mandatory ventilation volume control mode, with a tidal volume of 6 mL/kg, Peak end expiratory pressure (PEEP) of 10 and FiO2 of 0.5. There was only a minimal endotracheal aspirate and a repeat CXR showed the persistence of the left lobe consolidation with no improvement inspite of mechanical ventiltion. Flexible bronchoscopy was performed on day 2 to obtain diagnostic specimens and to look for any airway obstruction by mucous plugging. Bronchoscopy unexpectedly revealed a nearly completely obstructed left main bronchus by a foreign body, which resembled an earring. The foreign body was pulled out using a biopsy forceps. The foreign body became lodged in the endotracheal tube (ETT) necessitating removal of the ETT and foreign body en masse and reintubating the patient with a new ETT. On closer examination of the foreign body was a 25G hypodermic needle []. Subsequent CXR showed clearing of consolidation and the patient was extubated on day 4 and transferred to medical ward for further management. Sputum culture during bronchoscopy also yielded Pseudomonoas aeroginosa, which was sensitive to ticaricillin/caluvulanate. Antibiotics were de-escalated, and the patient was discharged on day 6 with oral antibiotics []. On questioning, it became apparent that she inhaled drugs from the same table she kept her drug paraphernalia. It seemed that while snorting drugs, she inadvertently inhaled the hypodermic needle.",
        "Question": "What is the patient's CURB-65 score?",
        "Relevant Entities": "{'age': [37, 'years'], 'Systolic Blood Pressure': [90.0, 'mm hg'], 'Diastolic Blood Pressure': [50.0, 'mm hg'], 'respiratory rate': [30.0, 'breaths per minute'], 'Blood Urea Nitrogen (BUN)': [3.5, 'mmol/L']}",
        "Ground Truth Answer": "2",
        "Lower Limit": "2",
        "Upper Limit": "2",
        "Ground Truth Explanation": "The Curb-65 score is current at 0 points.\nThe patient is 37 years old. The patient's age is less than 65 years, and so we add 0 points to the score, keeping the current total at 0.\nWhether the patient has confusion is not reported in the note. Hence, we assume this to be false, and so 0 points are added to the score, making the current total 0.\nThe concentration of BUN is 3.5 mmol/L. We need to convert the concentration to mg/dL. Let's first convert the mass of BUN from mmol to mg. The mass of BUN is 3.5 mmol. To convert 3.5 mmol of BUN to mol, multiply by the conversion factor 0.001, giving us 3.5 mmol BUN * 0.001 mol/mmol = 0.004 mol BUN. To convert from mol BUN to grams, multiply by the molar mass 28.02 g/mol, which will give 0.004 mol BUN * 28.02 g/mol = 0.112 g BUN. To convert 0.112 g of BUN to mg, multiply by the conversion factor 1000.0, giving us 0.112 g BUN * 1000.0 mg/g = 112.0 mg BUN. The current volume unit is L and the target volume unit is dL. The conversion factor is 10.0 dL for every unit of L. Our next step will be to divide the mass by the volume conversion factor of 10.0 to get the final concentration in terms of mg/dL. This will result to 112.0 mg BUN/10.0 dL = 11.2 mg BUN/dL. The concentration value of 3.5 mmol BUN/L converts to 11.2 mg BUN/dL. The patient's BUN concentration is less than or equal to 19 mg/dL and so 0 points are added to score, keeping the current total at 0.\nThe patient's respiratory rate is 30 breaths per minute. Because the respiratory rate is greater than 30 breaths per minute, 1 point is added to the score, making the current total 0 + 1 = 1.\nThe patient's systiolic blood pressure is 90 mm Hg. The patient's diastolic blood pressure is 50 mm Hg. For a point a point to be added, the systiolic blood pressure must be less than 90 mm Hg or the diastolic blood pressure must be less than or equal to 60 mm Hg. Because at least one of these statements is true, 1 point is added to score, making the current total 1 + 1 = 2.\nThe patient's Curb-65 score is 2.",
        "File Path": "camel/toolkits/medcalc_bench/curb-65.py",
        "Usr Msg": "A 37-year-old young female patient presented with progressive dyspnea, hypoxia, and left lung consolidation. She had presented to our emergency department, with a 3-day history of shortness of breath, fever, and nonproductive cough. Her past medical history included recently diagnosed and untreated Hepatitis C, related to prolonged intravenous heroin abuse. She was on methadone de-addiction program but was continuing to occasionally using heroin, the last time a week prior to admission. She was also an active smoker, with a 20 pack-year history.\nOn clinical examination she appeared malnourished and dehydrated, with multiple skin tattoos and burn marks on the left forearm. Temperature was 38.2°C, respiratory rate 30/Min, blood pressure 90/50 mmHg, pulse rate 120 beats/min, oxygen saturation was 95% on room air. Heart sounds were dual, with no added sounds or murmurs. There were no crackles or wheezes audible on auscultation but air entry was markedly reduced on the left side. Routine laboratory investigations showed a hemoglobin of 99 g/L. white cell count 23.7 × 109/L with a neutrophil count of 22.75 × 109/L, and lymphocytes of 0.79 × 109/L, CRP 206 mg/L, Alanine transaminase (ALT) 26 U/L, Aspartate transaminase (AST) 18 U/L, urea 3.5 mmol/L, creatinine 42 μmol/L. Chest X-ray (CXR) showed complete left-sided consolidation with no mediastinal shift [Figures and ]. Venous access was obtained via central cannulation of the internal jugular vein and she was resuscitated with 2 L of normal saline, started on ticaricillin/caluvulanate 3.1 g 6 hourly and referred to intensive care unit for admission with a presumptive diagnosis of severe community-acquired pneumonia.\nDespite adequate fluid resuscitation, the patient remained hypotensive with decreasing urine output, and noradrenalin infusion was initiated to improve blood pressure. She was intubated for worsening tachypnea and fatigue. Prior to intubation, chest computed tomography (CT) was performed, which confirmed consolidation of both the lobes on the left side; interestingly, no foreign body was described on the initial CT report, but detected on review after bronchoscopy [Figures and ]. Serology was drawn to assess for Hepatitis, HIV, and atypical infection. The antibiotic regime was augmented with the addition of vancomycin and azythromycin.\nIn view of the history of intravenous drug abuse a transthoracic echocardiogram was performed, which demonstrated mild tricuspid regurgitation, no vegetations, and normal cardiac function. The patient was ventilated on synchronized intermittent mandatory ventilation volume control mode, with a tidal volume of 6 mL/kg, Peak end expiratory pressure (PEEP) of 10 and FiO2 of 0.5. There was only a minimal endotracheal aspirate and a repeat CXR showed the persistence of the left lobe consolidation with no improvement inspite of mechanical ventiltion. Flexible bronchoscopy was performed on day 2 to obtain diagnostic specimens and to look for any airway obstruction by mucous plugging. Bronchoscopy unexpectedly revealed a nearly completely obstructed left main bronchus by a foreign body, which resembled an earring. The foreign body was pulled out using a biopsy forceps. The foreign body became lodged in the endotracheal tube (ETT) necessitating removal of the ETT and foreign body en masse and reintubating the patient with a new ETT. On closer examination of the foreign body was a 25G hypodermic needle []. Subsequent CXR showed clearing of consolidation and the patient was extubated on day 4 and transferred to medical ward for further management. Sputum culture during bronchoscopy also yielded Pseudomonoas aeroginosa, which was sensitive to ticaricillin/caluvulanate. Antibiotics were de-escalated, and the patient was discharged on day 6 with oral antibiotics []. On questioning, it became apparent that she inhaled drugs from the same table she kept her drug paraphernalia. It seemed that while snorting drugs, she inadvertently inhaled the hypodermic needle. What is the patient's CURB-65 score?"
    },
    {
        "Calculator ID": 48,
        "Calculator Name": "PERC Rule for Pulmonary Embolism",
        "Category": "diagnosis",
        "Output Type": "integer",
        "Note ID": "pmc-8610462-1",
        "Note Type": "Extracted",
        "Patient Note": "A 73-year-old female was brought by emergency medical services (EMS) to the emergency department (ED) after a motor vehicle collision (MVC). She was driving when her car crashed into a streetlamp at 40 miles per hour. The EMS team reported that the pole intruded into the passenger compartment and the patient required a prolonged extrication. She had a Glasgow Coma Scale score (GCS) of 11 when EMS arrived at the scene, which improved to a 15 after repeated evaluations. She was conscious, alert, and oriented at the scene and during transport.\nThe patient had difficulty recalling the events before the collision. She remembered feeling “like I was having a panic attack” just before the crash, and she did not recall the car impacting the streetlamp. In the ED, she complained of substernal chest pressure. The patient’s history was limited due to her continued difficulty recalling the events of the accident. The patient’s son was contacted and he stated that she lives alone and is active and independent. He stated that she had experienced syncopal episodes over the last several years, all associated with paroxysms of panic when driving, and she had undergone extensive workups without any clear etiology identified. She had magnetic resonance imaging (MRI) of her brain with and without contrast four years prior for stroke-like symptoms after a syncopal event. Per his report, no abnormalities were found.\nThe patient had a past medical history of anxiety, migraines, Hashimoto thyroiditis, and hyperlipidemia. She had been diagnosed with breast cancer in 2012, which was treated with a left mastectomy followed by five years of tamoxifen and letrozole treatment. She had a family history of dementia, diabetes, and heart disease. She denied using tobacco, alcohol, or illicit substances. She was prescribed, and was taking, the following medications: levothyroxine 25 micrograms daily; atorvastatin 20 milligrams (mg) nightly; rizatriptan 10 mg as needed for headaches; and multivitamins.\nOn physical exam, the patient’s temperature was 36.5° Celsius, her heart rate was 92 beats per minute, and her blood pressure was 142/72 millimeters of mercury. She was breathing at a rate of 21 breaths per minute with an oxygen saturation of 98% on room air. She weighed 125 pounds and was 5 feet, 3 inches tall, with a body mass index of 22.1 kilograms per meter squared. She did not appear to be in any acute distress, was healthy appearing, and was oriented to her name, date, and location. Her head was normocephalic and atraumatic; she had no Battle sign, raccoon eyes, or other signs of trauma. She had hearing aids in place bilaterally. She had normal extraocular movements with equal pupils that were reactive to light. She had a cervical collar in place. Later, when it was safe to remove her collar, her neck had a normal range of motion without rigidity or pain.\nOn auscultation, her heart had a regular S1 and S2 at a normal rate and was without murmurs. She had normal pulses bilaterally. Her lungs were clear without wheezing or rhonchi, and she was noted to have normal effort without respiratory distress. Her abdomen was soft and flat, without tenderness or guarding. Her musculoskeletal exam showed an overall normal range of motion without deformities. She had no step-offs of the spinous processes or tenderness along the midline spine. The remainder of her skeletal exam only revealed tenderness over the left wrist. She had a capillary refill of less than two seconds. On her skin exam, she had minor contusions to the left upper chest near the axilla with superficial abrasions along the left wrist. She was not diaphoretic. Neurologically she had no cranial nerve deficits, with no motor weakness or sensory deficits peripherally. She had a normal gait and normal coordination as well. She could not recall her birth date and had slow verbalization with some word-finding difficulty. Psychiatrically, she was normal in mood and behavior.\nPoint-of care-ultrasound did not find evidence of free fluid within the abdominal or thoracic cavities and was negative for a pericardial effusion. Point-of-care ultrasound examination of her chest revealed normal lung sliding bilaterally. Chest radiograph showed no acute abnormalities. A radiograph of her pelvis showed no fracture or malalignment of the bones. A computed tomography (CT) of her head and brain showed no intracranial injury. A CT of the cervical spine and chest with contrast in the arterial phase was performed, which showed normal vertebral body height and alignment without fracture. The CT did show some mild atherosclerosis of the carotid and vertebral arteries, but no vascular injury and no obvious narrowing. Her trachea and mainstem bronchi were patent, she had no mediastinal abnormalities, the thoracic aorta was normal in appearance, and she had no pericardial effusion or pneumothorax ().\nA CT of her abdomen and pelvis with contrast in the venous phase was also performed, which showed patent vasculature including a normal caliber aorta and inferior vena cava, normal appearing spleen, pancreas, adrenal glands and kidneys/ureters, a small hiatal hernia but otherwise normal appearing bowel, and no ascites or pneumoperitoneum. The radiologist did not find any fractures on her imaging or any soft tissue injuries. Initial laboratory studies (), laboratory studies after administration of intravenous fluids (), and the patient’s electrocardiograms (ECG) () are shown. A test was then performed and a diagnosis was made.",
        "Question": "What are the number of criteria met for the PERC Rule for Pulmonary Embolism (PE)?",
        "Relevant Entities": "{'age': [73, 'years'], 'Heart Rate or Pulse': [92.0, 'beats per minute'], 'Hemoptysis': False, 'O₂ saturation percentage': [98.0, '%'], 'Unilateral Leg Swelling': False, 'Hormone use': True, 'Recent surgery or trauma': True, 'Previously documented Deep Vein Thrombosis': False, 'Previously Documented Pulmonary Embolism': False}",
        "Ground Truth Answer": "3",
        "Lower Limit": "3",
        "Upper Limit": "3",
        "Ground Truth Explanation": "The current count of PERC criteria met is 0.\nThe patient is 73 years old. The patient's age is greater than or equal to 50 years, and so we increment the perc critieria met by 1, making the current total 0 + 1 = 1.\nThe patient's heart rate is 92.0 beats per minute. The patient's heart rate is less than 100 beats per minute, and so we do not increment the criteria count. The current total remains at 1.\nThe saturated oxygen percentage in the room is 98.0 percent. The saturated oxygen is greater than or equal to 95% and so we do not increment the criteria count. The current total remains at 1.\nThe patient note reports 'unilateral leg swelling' to be absent in the patient and so we do not increment the criteria count. The current total remains at 1.\nThe patient note reports 'hemoptysis' to be absent in the patient and so we do not increment the criteria count. The current total remains at 1.\nThe patient note reports 'recent surgery or trauma' to be present for the patient and so we increment the criteria count by 1, making the current total 1 + 1  =  2.\nThe patient must be diagnosed with at least one of deep vein thrombosis or pulmonary embolism in the past for a PERC rule criteria to be met. The patient is not reported to have been diagnosed with deep vein thrombosis in the past. The patient is not reported to have been diagnosed with pulmonary embolism in the past. Neither criteria is met and so we do increment the criteria count, keep the current total at 2.\nThe patient note reports 'hormonal use' to be present for the patient and so we increment the criteria count by 1, making the current total 2 + 1  =  3.\nHence, the number of PERC rule criteria met by the patient is 3.",
        "File Path": "camel/toolkits/medcalc_bench/perc_rule.py",
        "Usr Msg": "A 73-year-old female was brought by emergency medical services (EMS) to the emergency department (ED) after a motor vehicle collision (MVC). She was driving when her car crashed into a streetlamp at 40 miles per hour. The EMS team reported that the pole intruded into the passenger compartment and the patient required a prolonged extrication. She had a Glasgow Coma Scale score (GCS) of 11 when EMS arrived at the scene, which improved to a 15 after repeated evaluations. She was conscious, alert, and oriented at the scene and during transport.\nThe patient had difficulty recalling the events before the collision. She remembered feeling “like I was having a panic attack” just before the crash, and she did not recall the car impacting the streetlamp. In the ED, she complained of substernal chest pressure. The patient’s history was limited due to her continued difficulty recalling the events of the accident. The patient’s son was contacted and he stated that she lives alone and is active and independent. He stated that she had experienced syncopal episodes over the last several years, all associated with paroxysms of panic when driving, and she had undergone extensive workups without any clear etiology identified. She had magnetic resonance imaging (MRI) of her brain with and without contrast four years prior for stroke-like symptoms after a syncopal event. Per his report, no abnormalities were found.\nThe patient had a past medical history of anxiety, migraines, Hashimoto thyroiditis, and hyperlipidemia. She had been diagnosed with breast cancer in 2012, which was treated with a left mastectomy followed by five years of tamoxifen and letrozole treatment. She had a family history of dementia, diabetes, and heart disease. She denied using tobacco, alcohol, or illicit substances. She was prescribed, and was taking, the following medications: levothyroxine 25 micrograms daily; atorvastatin 20 milligrams (mg) nightly; rizatriptan 10 mg as needed for headaches; and multivitamins.\nOn physical exam, the patient’s temperature was 36.5° Celsius, her heart rate was 92 beats per minute, and her blood pressure was 142/72 millimeters of mercury. She was breathing at a rate of 21 breaths per minute with an oxygen saturation of 98% on room air. She weighed 125 pounds and was 5 feet, 3 inches tall, with a body mass index of 22.1 kilograms per meter squared. She did not appear to be in any acute distress, was healthy appearing, and was oriented to her name, date, and location. Her head was normocephalic and atraumatic; she had no Battle sign, raccoon eyes, or other signs of trauma. She had hearing aids in place bilaterally. She had normal extraocular movements with equal pupils that were reactive to light. She had a cervical collar in place. Later, when it was safe to remove her collar, her neck had a normal range of motion without rigidity or pain.\nOn auscultation, her heart had a regular S1 and S2 at a normal rate and was without murmurs. She had normal pulses bilaterally. Her lungs were clear without wheezing or rhonchi, and she was noted to have normal effort without respiratory distress. Her abdomen was soft and flat, without tenderness or guarding. Her musculoskeletal exam showed an overall normal range of motion without deformities. She had no step-offs of the spinous processes or tenderness along the midline spine. The remainder of her skeletal exam only revealed tenderness over the left wrist. She had a capillary refill of less than two seconds. On her skin exam, she had minor contusions to the left upper chest near the axilla with superficial abrasions along the left wrist. She was not diaphoretic. Neurologically she had no cranial nerve deficits, with no motor weakness or sensory deficits peripherally. She had a normal gait and normal coordination as well. She could not recall her birth date and had slow verbalization with some word-finding difficulty. Psychiatrically, she was normal in mood and behavior.\nPoint-of care-ultrasound did not find evidence of free fluid within the abdominal or thoracic cavities and was negative for a pericardial effusion. Point-of-care ultrasound examination of her chest revealed normal lung sliding bilaterally. Chest radiograph showed no acute abnormalities. A radiograph of her pelvis showed no fracture or malalignment of the bones. A computed tomography (CT) of her head and brain showed no intracranial injury. A CT of the cervical spine and chest with contrast in the arterial phase was performed, which showed normal vertebral body height and alignment without fracture. The CT did show some mild atherosclerosis of the carotid and vertebral arteries, but no vascular injury and no obvious narrowing. Her trachea and mainstem bronchi were patent, she had no mediastinal abnormalities, the thoracic aorta was normal in appearance, and she had no pericardial effusion or pneumothorax ().\nA CT of her abdomen and pelvis with contrast in the venous phase was also performed, which showed patent vasculature including a normal caliber aorta and inferior vena cava, normal appearing spleen, pancreas, adrenal glands and kidneys/ureters, a small hiatal hernia but otherwise normal appearing bowel, and no ascites or pneumoperitoneum. The radiologist did not find any fractures on her imaging or any soft tissue injuries. Initial laboratory studies (), laboratory studies after administration of intravenous fluids (), and the patient’s electrocardiograms (ECG) () are shown. A test was then performed and a diagnosis was made. What are the number of criteria met for the PERC Rule for Pulmonary Embolism (PE)?"
    },
    {
        "Calculator ID": 49,
        "Calculator Name": "Morphine Milligram Equivalents (MME) Calculator",
        "Category": "dosage conversion",
        "Output Type": "decimal",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "The patient takes 10 mg of Tapentadol 2 times a day, 30 mg of HYDROcodone 2 times a day, and 70 mg of FentANYL patch 2 times a day.",
        "Question": "Based on the number of doses per day and the quantity of different doses, what is the patient's daily Morphine Miligram Equivalents (MME)?",
        "Relevant Entities": "{'Tapentadol Dose': [10, 'mg'], 'Tapentadol Dose Per Day': [2, 'per day'], 'HYDROcodone Dose': [30, 'mg'], 'HYDROcodone Dose Per Day': [2, 'per day'], 'FentANYL patch Dose': [70, 'mg'], 'FentANYL patch Dose Per Day': [2, 'per day']}",
        "Ground Truth Answer": "404.0",
        "Lower Limit": "404.0",
        "Upper Limit": "404.0",
        "Ground Truth Explanation": "The curent Morphine Milligram Equivalents (MME) is 0 MME per day.\nThe patient's dose of Tapentadol is 10 mg. The patient takes 2 doses/day of Tapentadol. This means that the patient takes 10 mg/dose Tapentadol * 2 dose/day = 20 mg/day. To convert to mme/day of Tapentadol, multiply the 20 mg/day by the mme conversion factor, 0.4 mme/mg, giving us 8.0 mme/day. Adding the mme/day of Tapentadol to the total mme/day gives us 0 + 8.0 = 8.0 mme/day.\nThe patient's dose of HYDROcodone is 30 mg. The patient takes 2 doses/day of HYDROcodone. This means that the patient takes 30 mg/dose HYDROcodone * 2 dose/day = 60 mg/day. To convert to mme/day of HYDROcodone, multiply the 60 mg/day by the mme conversion factor, 1 mme/mg, giving us 60 mme/day. Adding the mme/day of HYDROcodone to the total mme/day gives us 8.0 + 60 = 68.0 mme/day.\nThe patient's dose of FentANYL patch is 70 mg. The patient takes 2 doses/day of FentANYL patch. This means that the patient takes 70 mg/dose FentANYL patch * 2 dose/day = 140 mg/day. To convert to mme/day of FentANYL patch, multiply the 140 mg/day by the mme conversion factor, 2.4 mme/mg, giving us 336.0 mme/day. Adding the mme/day of FentANYL patch to the total mme/day gives us 68.0 + 336.0 = 404.0 mme/day.\nThe patient's mme/day is 404.0 mme/day.",
        "File Path": "camel/toolkits/medcalc_bench/mme.py",
        "Usr Msg": "The patient takes 10 mg of Tapentadol 2 times a day, 30 mg of HYDROcodone 2 times a day, and 70 mg of FentANYL patch 2 times a day. Based on the number of doses per day and the quantity of different doses, what is the patient's daily Morphine Miligram Equivalents (MME)?"
    },
    {
        "Calculator ID": 51,
        "Calculator Name": "SIRS Criteria",
        "Category": "diagnosis",
        "Output Type": "integer",
        "Note ID": "pmc-8404025-2",
        "Note Type": "Extracted",
        "Patient Note": "A 59-year-old Hispanic male patient with a medical history of hypertension, obesity, and poorly controlled diabetes mellitus (last HbA1c was 13%) presented to the emergency department for fever of 20 days duration and worsening cough with expectoration, as well as progressive respiratory distress. On admission, his vital signs were a blood pressure of 144/83 mmHg, heart rate of 74 beats per minute, respiratory rate of 50 breaths per minute, O2 saturation of 40% (room air), and temperature of 38 °C. On physical examination, he was found to be febrile, somnolent, and polypneic, with marked respiratory effort. Emergency orotracheal intubation and transfer to the intensive care unit were necessary.\nInitial screening showed thrombocytopenia (platelet count 138 × 103 cells/µl), leukocytosis (WBC 15,760 cells/ml, 90% neutrophils) with lymphopenia (6.20% lymphocytes), elevated transaminases (ALT 1507.4 IU and AST 3049.7 IU), elevated d-dimer (44,066 µg/ml), and negative RT-PCR SARS CoV-2 test. Chest X-ray showed extensive interstitial infiltrates in both lung fields (Fig. b). Considering the progressive decrease in total platelet count as well as gradual lymphopenia (Fig. ), a dengue IgM/IgG test was conducted and was positive, while the dengue PCR-RT test was negative. According to radiographic findings and respiratory involvement, the RT-PCR test for SARS CoV-2 was repeated on two more occasions, with negative results. Therefore, IgG antibodies for SARS CoV-2 were assayed and were positive.\nPositive serology for both SARS CoV-2 and dengue virus confirmed coinfection, so it was considered that he had probably entered a late stage of the disease. Steroid management was indicated according to COVID-19 management guidelines, in addition to pronation cycles, to which he presented poor response and persistent hypoxemia. During his stay in intensive care, he presented multiple complications, such as acute pulmonary embolism, with signs of secondary thromboembolic pulmonary hypertension, bacterial superinfection in his lungs by Klebsiella pneumoniae, and Akin III acute renal failure. Computerized tomography angiography of the chest was performed, which confirmed acute pulmonary thromboembolism of multiple bilateral lobar and segmental bilateral branches with signs of secondary pulmonary hypertension and pulmonary changes suggestive of organizing pneumonia secondary to viral infection (Fig. ). Details of the clinical description of the coinfection are presented in Table . The patient remained in the ICU for COVID-19, bacterial superinfection, and dengue with alarm signs for 63 days. His progression was slow, showing progressive clinical deterioration. He required prolonged mechanical ventilation and vasopressor management until he finally died.",
        "Question": "What is the number of SIRS critiera met by the patient?",
        "Relevant Entities": "{'Temperature': [38.0, 'degrees celsius'], 'Heart Rate or Pulse': [74.0, 'beats per minute'], 'respiratory rate': [50.0, 'breaths per minute'], 'White blood cell count': [15760.0, 'mL']}",
        "Ground Truth Answer": "3",
        "Lower Limit": "3",
        "Upper Limit": "3",
        "Ground Truth Explanation": "The current count of SIRS criteria met is 0.\nThe patient's temperature is 38.0 degrees celsius. Because the temperature is between 36 and 38 degrees celsius, this does not meet SIRS criteria for temperature, and so the current total remains at 0.\nThe patient's heart rate is 74.0 beats per minute. Because the heart rate is less than 90 beats per minute, this does not meet SIRS criteria for heart rate, and so the current total remains at 0.\nThe patient's concentration of white blood cell is 15760.0 count/mL. To convert 15760.0 count/mL of white blood cell to m^3, multiply by the conversion factor 1000000.0 mL/m^3 which will give 15760.0 white blood cell count/mL * 1000000.0 mL/m^3 = 15760000000.0 white blood cell count/m^3. Because the white blood cell count is greater than 12000 count per m^3, we increment the criteria count by 1 making the current total 1 + 1 = 2.\nThe final SIRS criteria is whether the patient has a respiratory rate of more than 20 breaths per minute or if the patient's PaCO₂ partial pressure is less than 32 mm Hg. The patient's respiratory rate is 50.0 breaths per minute, which is greater than 20 breaths per minute. The patient's PaCO₂ partial pressure is not provided and so we assume that the patient's partial pressure is greater than or equal to 32 mm Hg.At least one of the criteria is met, and so we increment the criteria count by 1 giving us a total of 2 + 1 = 3 criteria met.\nHence, the the number of SIRS criteria met by the patient is 3.",
        "File Path": "camel/toolkits/medcalc_bench/sirs_criteria.py",
        "Usr Msg": "A 59-year-old Hispanic male patient with a medical history of hypertension, obesity, and poorly controlled diabetes mellitus (last HbA1c was 13%) presented to the emergency department for fever of 20 days duration and worsening cough with expectoration, as well as progressive respiratory distress. On admission, his vital signs were a blood pressure of 144/83 mmHg, heart rate of 74 beats per minute, respiratory rate of 50 breaths per minute, O2 saturation of 40% (room air), and temperature of 38 °C. On physical examination, he was found to be febrile, somnolent, and polypneic, with marked respiratory effort. Emergency orotracheal intubation and transfer to the intensive care unit were necessary.\nInitial screening showed thrombocytopenia (platelet count 138 × 103 cells/µl), leukocytosis (WBC 15,760 cells/ml, 90% neutrophils) with lymphopenia (6.20% lymphocytes), elevated transaminases (ALT 1507.4 IU and AST 3049.7 IU), elevated d-dimer (44,066 µg/ml), and negative RT-PCR SARS CoV-2 test. Chest X-ray showed extensive interstitial infiltrates in both lung fields (Fig. b). Considering the progressive decrease in total platelet count as well as gradual lymphopenia (Fig. ), a dengue IgM/IgG test was conducted and was positive, while the dengue PCR-RT test was negative. According to radiographic findings and respiratory involvement, the RT-PCR test for SARS CoV-2 was repeated on two more occasions, with negative results. Therefore, IgG antibodies for SARS CoV-2 were assayed and were positive.\nPositive serology for both SARS CoV-2 and dengue virus confirmed coinfection, so it was considered that he had probably entered a late stage of the disease. Steroid management was indicated according to COVID-19 management guidelines, in addition to pronation cycles, to which he presented poor response and persistent hypoxemia. During his stay in intensive care, he presented multiple complications, such as acute pulmonary embolism, with signs of secondary thromboembolic pulmonary hypertension, bacterial superinfection in his lungs by Klebsiella pneumoniae, and Akin III acute renal failure. Computerized tomography angiography of the chest was performed, which confirmed acute pulmonary thromboembolism of multiple bilateral lobar and segmental bilateral branches with signs of secondary pulmonary hypertension and pulmonary changes suggestive of organizing pneumonia secondary to viral infection (Fig. ). Details of the clinical description of the coinfection are presented in Table . The patient remained in the ICU for COVID-19, bacterial superinfection, and dengue with alarm signs for 63 days. His progression was slow, showing progressive clinical deterioration. He required prolonged mechanical ventilation and vasopressor management until he finally died. What is the number of SIRS critiera met by the patient?"
    },
    {
        "Calculator ID": 56,
        "Calculator Name": "QTc Fridericia Calculator",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "Patient has a heart rate of 70 bpm and a QT interval of 330 msec.",
        "Question": "Using the Fridericia Formula for corrected QT interval, what is the patient's corrected QT interval in terms of msec?",
        "Relevant Entities": "{'Heart Rate or Pulse': [70, 'beats per minute'], 'QT interval': [330, 'msec']}",
        "Ground Truth Answer": "347.419",
        "Lower Limit": "330.048",
        "Upper Limit": "364.79",
        "Ground Truth Explanation": "The corrected QT interval using the Fredericia formula is computed as  QTc = QT interval / (RR interval)**(1/3), where ** denotes an exponent, QT interval is in msec, and RR interval is given as 60/(heart rate).\nThe patient's heart rate is 70 beats per minute.\nThe QT interval is 330 msec.\nThe RR interval is computed as 60/(heart rate), and so the RR interval is 60/70 = 0.857.\nHence, plugging in these values, we will get 330/√(0.857) = 347.419.The patient's corrected QT interval (QTc) is 347.419 msec. ",
        "File Path": "camel/toolkits/medcalc_bench/qt_calculator_fredericia.py",
        "Usr Msg": "Patient has a heart rate of 70 bpm and a QT interval of 330 msec. Using the Fridericia Formula for corrected QT interval, what is the patient's corrected QT interval in terms of msec?"
    },
    {
        "Calculator ID": 57,
        "Calculator Name": "QTc Framingham Calculator",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "Patient has a heart rate of 81 bpm and a QT interval of 330 msec.",
        "Question": "Using the Framingham Formula for corrected QT interval, what is the patient's corrected QT interval in terms of msec?",
        "Relevant Entities": "{'Heart Rate or Pulse': [81, 'beats per minute'], 'QT interval': [330, 'msec']}",
        "Ground Truth Answer": "369.886",
        "Lower Limit": "351.392",
        "Upper Limit": "388.38",
        "Ground Truth Explanation": "The corrected QT interval using the Framingham formula is computed as  QTc = QT Interval + (154 * (1 - rr_interval_sec)), where QT interval is in msec, and RR interval is given as 60/(heart rate).\nThe patient's heart rate is 81 beats per minute.\nThe QT interval is 330 msec.\nThe RR interval is computed as 60/(heart rate), and so the RR interval is 60/81 = 0.741.\nHence, plugging in these values, we will get 330/(154 * ( 1- 0.741 )) = 369.886.\nThe patient's corrected QT interval (QTc) is 369.886 msec.",
        "File Path": "camel/toolkits/medcalc_bench/qt_calculator_framingham.py",
        "Usr Msg": "Patient has a heart rate of 81 bpm and a QT interval of 330 msec. Using the Framingham Formula for corrected QT interval, what is the patient's corrected QT interval in terms of msec?"
    },
    {
        "Calculator ID": 58,
        "Calculator Name": "QTc Hodges Calculator",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "Patient has a heart rate of 52 bpm and a QT interval of 330 msec.",
        "Question": "Using the Hodges Formula for corrected QT interval, what is the patient's corrected QT interval in terms of msec?",
        "Relevant Entities": "{'Heart Rate or Pulse': [52, 'beats per minute'], 'QT interval': [330, 'msec']}",
        "Ground Truth Answer": "315.988",
        "Lower Limit": "300.189",
        "Upper Limit": "331.787",
        "Ground Truth Explanation": "The corrected QT interval using the Hodges formula is computed as  QTc = QT interval + 1.75 * [(60 /rr_interval_sec) - 60], where QT interval is in msec, and RR interval is given as 60/(heart rate).\nThe patient's heart rate is 52 beats per minute.\nThe QT interval is 330 msec.\nThe RR interval is computed as 60/(heart rate), and so the RR interval is 60/52 = 1.154.\nHence, plugging in these values, we will get 330 + 1.75 * [(60/1.154) - 60] = 315.988.\nThe patient's corrected QT interval (QTc) is 315.988 msec.",
        "File Path": "camel/toolkits/medcalc_bench/qt_calculator_hodges.py",
        "Usr Msg": "Patient has a heart rate of 52 bpm and a QT interval of 330 msec. Using the Hodges Formula for corrected QT interval, what is the patient's corrected QT interval in terms of msec?"
    },
    {
        "Calculator ID": 59,
        "Calculator Name": "QTc Rautaharju Calculator",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "Patient has a heart rate of 110 bpm and a QT interval of 330 msec.",
        "Question": "Using the Rautaharju Formula for corrected QT interval, what is the patient's corrected QT interval in terms of msec?",
        "Relevant Entities": "{'Heart Rate or Pulse': [110, 'beats per minute'], 'QT interval': [330, 'msec']}",
        "Ground Truth Answer": "421.667",
        "Lower Limit": "400.584",
        "Upper Limit": "442.75",
        "Ground Truth Explanation": "The corrected QT interval using the Rautajarju formula is computed as  QTc = QT interval x (120 + HR) / 180, where QT interval is in msec, and HR is the heart rate in beats per minute.\nThe QT interval is 330 msec.\nThe patient's heart rate is 110 beats per minute.\nHence, plugging in these values, we will get 330 x (120 + 110) / 180 = 421.667.\nThe patient's corrected QT interval (QTc) is 421.667 msec.",
        "File Path": "camel/toolkits/medcalc_bench/qt_calculator_rautaharju.py",
        "Usr Msg": "Patient has a heart rate of 110 bpm and a QT interval of 330 msec. Using the Rautaharju Formula for corrected QT interval, what is the patient's corrected QT interval in terms of msec?"
    },
    {
        "Calculator ID": 60,
        "Calculator Name": "Body Surface Area Calculator",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "pmc-6389502-1",
        "Note Type": "Extracted",
        "Patient Note": "The patient was a 34-year-old Japanese man, whose family history included a father with hypertension, and a mother that suffered a subarachnoid hemorrhage, but which did not include either a consanguineous marriage or any incidence of renal cysts. At the age of 31, the patient presented with mild albuminuria, and a serum creatinine (Cr) level of 2.98 mg/dL. At the age of 34, the patient was admitted to hospital with a creatinine level of 8.2 mg/dL.\nUpon admission, the patient's height, weight, and blood pressure were 179 cm, 58 kg, and 126/80 mm Hg, respectively. The patient exhibited anemia (Hb 8.2 g/dL), azotemia (Cr 8.38 mg/dL), hyperphosphatemia, metabolic acidosis, and secondary hyperparathyroidism; thus, he was diagnosed with ESRD. An abdominal ultrasonography revealed that, although the size of both kidneys appeared to be normal, the patient's renal parenchyma showed increased brightness. We performed a percutaneous renal biopsy; histologically, six of 16 glomeruli displayed global sclerosis, along with mild cellular infiltration, conspicuous interstitial fibrosis, renal tubular atrophy, and cystoid irregular dilation (Figure ), suggesting an NPHP diagnosis. We performed targeted sequencing using a next-generation sequencer, with the approval by the research ethics committee of Tokyo Medical and Dental University in accordance with the Declaration of Helsinki and the patient's written informed consent. A homozygous full gene deletion of NPHP1 (NM_000272.3:g110879716-110962709) was resultantly identified, as well as heterozygous substitutions in PKD1 (NM_0001009944.2:c.6395T>G(p.Phe2132Cys)) (Figure ), BBS1 (NM_024649.4:c.908T>C(p.Val303Ala)), and INPP5E (NM_019892.4:c.1652C>T(p.Thr551Met)).",
        "Question": "What is the patient's body surface area? Please output your answer in terms of m².",
        "Relevant Entities": "{'weight': [58.0, 'kg'], 'height': [179.0, 'cm']}",
        "Ground Truth Answer": "1.698",
        "Lower Limit": "1.613",
        "Upper Limit": "1.783",
        "Ground Truth Explanation": "For the body surface area computation, the formula is sqrt((weight (in kgs) * height (in cm))/3600, where the units of weight is in kg and the units of height is in cm.\nThe patient's height is 179.0 cm. \nThe patient's weight is 58.0 kg. \nTherefore, the patient's bsa is sqrt((58.0 (in kgs) * 179.0 (in cm))/3600) = 1.698 m^2.",
        "File Path": "camel/toolkits/medcalc_bench/bsa_calculator.py",
        "Usr Msg": "The patient was a 34-year-old Japanese man, whose family history included a father with hypertension, and a mother that suffered a subarachnoid hemorrhage, but which did not include either a consanguineous marriage or any incidence of renal cysts. At the age of 31, the patient presented with mild albuminuria, and a serum creatinine (Cr) level of 2.98 mg/dL. At the age of 34, the patient was admitted to hospital with a creatinine level of 8.2 mg/dL.\nUpon admission, the patient's height, weight, and blood pressure were 179 cm, 58 kg, and 126/80 mm Hg, respectively. The patient exhibited anemia (Hb 8.2 g/dL), azotemia (Cr 8.38 mg/dL), hyperphosphatemia, metabolic acidosis, and secondary hyperparathyroidism; thus, he was diagnosed with ESRD. An abdominal ultrasonography revealed that, although the size of both kidneys appeared to be normal, the patient's renal parenchyma showed increased brightness. We performed a percutaneous renal biopsy; histologically, six of 16 glomeruli displayed global sclerosis, along with mild cellular infiltration, conspicuous interstitial fibrosis, renal tubular atrophy, and cystoid irregular dilation (Figure ), suggesting an NPHP diagnosis. We performed targeted sequencing using a next-generation sequencer, with the approval by the research ethics committee of Tokyo Medical and Dental University in accordance with the Declaration of Helsinki and the patient's written informed consent. A homozygous full gene deletion of NPHP1 (NM_000272.3:g110879716-110962709) was resultantly identified, as well as heterozygous substitutions in PKD1 (NM_0001009944.2:c.6395T>G(p.Phe2132Cys)) (Figure ), BBS1 (NM_024649.4:c.908T>C(p.Val303Ala)), and INPP5E (NM_019892.4:c.1652C>T(p.Thr551Met)). What is the patient's body surface area? Please output your answer in terms of m²."
    },
    {
        "Calculator ID": 61,
        "Calculator Name": "Target weight",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "Patient has a height of 72 in and their target BMI is 20.1 kg/m^2.",
        "Question": "Based on the patient's height and target BMI, what is the patient's target weight in kg?",
        "Relevant Entities": "{'Body Mass Index (BMI)': [20.1, 'kg/m^2'], 'height': [72, 'in']}",
        "Ground Truth Answer": "67.239",
        "Lower Limit": "63.877",
        "Upper Limit": "70.601",
        "Ground Truth Explanation": "The patient's target bmi is 20.1 kg/m^2. The patient's height is 72 in, which is 72 in * 0.0254 m / in = 1.829 m. From this, the patient's target weight is 20.1 kg/m^2 * 1.829 m * 1.829 m = 67.239 kg. ",
        "File Path": "camel/toolkits/medcalc_bench/target_weight.py",
        "Usr Msg": "Patient has a height of 72 in and their target BMI is 20.1 kg/m^2. Based on the patient's height and target BMI, what is the patient's target weight in kg?"
    },
    {
        "Calculator ID": 62,
        "Calculator Name": "Adjusted Body Weight",
        "Category": "physical",
        "Output Type": "decimal",
        "Note ID": "pmc-4613638-1",
        "Note Type": "Extracted",
        "Patient Note": "We report a 28-year-old single man with bilateral breasts enlargement, which was noticed since the age of 15 years. At the onset, it was painful, but the pain disappeared with time. No history suggestive of headache, visual changes, testicular trauma, or systemic or sexually transmitted diseases. Family, surgical and drug histories were unrevealing. On examination, he was obese (weight 89.8 Kg, height 159 cm, body mass index 35.9) and has an arm span of 165 cm. Systemic examination was unremarkable apart from mild hepatomegaly. Local examination revealed bilateral soft breast enlargement 14×10×10 cm (), with non tender sub-areolar mass concentric, areola (3.5 x 3.5 cm), with regular borders, and free from underlying and overlying tissues. He has a little facial hair, scanty axillary and pubic hair, small and atrophic testes, and small non-buried penis. All routine biochemical reports were within normal limits. Hormonal assay revealed hypergonadotrophic hypogonadism on the basis of low serum total testosterone, high luteinizing hormone, and high follicle stimulating hormone with normal prolactin, estradiol, thyroid stimulating hormone, cortisol, beta human chorionic gonadotrophin, and alpha fetoprotein. Abdominal and pelvic CT was normal apart from fatty liver. Scrotal ultrasound showed significantly small testes, but with normal echotexture and shape. Bilateral ultrasound showed enlarged breasts, very small and difficulty visualized glandular tissue, normal nipples, areola, subcutaneous and fatty tissues, and axillary regions. Bilateral mammography showed predominantly fatty tissue and there were no masses, abnormal fibroglandular tissues, calcifications, or axillary lymph nodes. Semen analysis showed Azoospermia. Cytogenetic analysis, which showed 47 XXY karyotype diagnostic of Klinefelter’s syndrome (KS).",
        "Question": "Using the adjusted body weight formula, what is the patient's adjusted body weight in terms of kg?",
        "Relevant Entities": "{'sex': 'Male', 'weight': [89.8, 'kg'], 'height': [159.0, 'cm']}",
        "Ground Truth Answer": "69.505",
        "Lower Limit": "66.03",
        "Upper Limit": "72.98",
        "Ground Truth Explanation": "The patient's gender is Male.\nThe patient's height is 159.0 cm, which is 159.0 cm * 0.393701 in/cm = 62.598 in. \nFor males, the ideal body weight (IBW) is calculated as follows:\nIBW = 50 kg + 2.3 kg * (height (in inches) - 60)\nPlugging in the values gives us 50 kg + 2.3 kg * (62.598 (in inches) - 60) = 55.975 kg.\nHence, the patient's IBW is 55.975 kg.The patient's weight is 89.8 kg. To compute the ABW value, apply the following formula: ABW = IBW + 0.4 * (weight (in kg) - IBW (in kg)). ABW = 55.975 kg + 0.4 * (89.8 kg  - 55.975 kg) = 69.505 kg. The patient's adjusted body weight is 69.505 kg.",
        "File Path": "camel/toolkits/medcalc_bench/adjusted_body_weight.py",
        "Usr Msg": "We report a 28-year-old single man with bilateral breasts enlargement, which was noticed since the age of 15 years. At the onset, it was painful, but the pain disappeared with time. No history suggestive of headache, visual changes, testicular trauma, or systemic or sexually transmitted diseases. Family, surgical and drug histories were unrevealing. On examination, he was obese (weight 89.8 Kg, height 159 cm, body mass index 35.9) and has an arm span of 165 cm. Systemic examination was unremarkable apart from mild hepatomegaly. Local examination revealed bilateral soft breast enlargement 14×10×10 cm (), with non tender sub-areolar mass concentric, areola (3.5 x 3.5 cm), with regular borders, and free from underlying and overlying tissues. He has a little facial hair, scanty axillary and pubic hair, small and atrophic testes, and small non-buried penis. All routine biochemical reports were within normal limits. Hormonal assay revealed hypergonadotrophic hypogonadism on the basis of low serum total testosterone, high luteinizing hormone, and high follicle stimulating hormone with normal prolactin, estradiol, thyroid stimulating hormone, cortisol, beta human chorionic gonadotrophin, and alpha fetoprotein. Abdominal and pelvic CT was normal apart from fatty liver. Scrotal ultrasound showed significantly small testes, but with normal echotexture and shape. Bilateral ultrasound showed enlarged breasts, very small and difficulty visualized glandular tissue, normal nipples, areola, subcutaneous and fatty tissues, and axillary regions. Bilateral mammography showed predominantly fatty tissue and there were no masses, abnormal fibroglandular tissues, calcifications, or axillary lymph nodes. Semen analysis showed Azoospermia. Cytogenetic analysis, which showed 47 XXY karyotype diagnostic of Klinefelter’s syndrome (KS). Using the adjusted body weight formula, what is the patient's adjusted body weight in terms of kg?"
    },
    {
        "Calculator ID": 63,
        "Calculator Name": "Delta Gap",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "usmle-5483",
        "Note Type": "Extracted",
        "Patient Note": "A 69-year-old man presents to the emergency department with shortness of breath that has been worsening over the past month. The patient states that he has had worsening shortness of breath that has progressed to shortness of breath with simple activities and minor exertion. When he was unable to climb the stairs to his house today, he decided to come to the emergency department. The patient has a past medical history of poorly managed diabetes mellitus, hypertension, end stage renal disease, and obesity. His current medications include insulin, metformin, lisinopril, hydrochlorothiazide, and ibuprofen. The patient is notably non-compliant with his medications. An EKG and chest radiograph are normal. The patient had dialysis two days ago and attends most of his appointments. Laboratory values are ordered and are seen below:\n\nSerum:\nNa+: 135 mEq/L\nK+: 4.5 mEq/L\nCl-: 100 mEq/L\nHCO3-: 19 mEq/L\nUrea nitrogen: 29 mg/dL\nGlucose: 75 mg/dL\nCreatinine: 2.5 mg/dL\nCa2+: 9.2 mg/dL\nMg2+: 1.7 mEq/L\nAST: 11 U/L\nALT: 11 U/L\n\nLeukocyte count and differential:\nLeukocyte count: 4,500/mm^3\nPlatelet count: 150,000/mm^3\nNeutrophil: 54%\nLymphocyte: 25%\nMonocyte: 3%\nEosinophil: 1%\nBasophil: 1%\n\nHemoglobin: 8.2 g/dL\nHematocrit: 22%\nMean corpuscular volume: 82 µm^3\n\nThe patient appears comfortable at rest but demonstrates notable shortness of breath when exerting himself. His temperature is 99.5°F (37.5°C), pulse is 89/min, blood pressure is 144/85 mmHg, respirations are 10/min, and oxygen saturation is 97% on room air. Pulmonary and cardiac exam are within normal limits.",
        "Question": "What is the patient's delta gap in mEq/L?",
        "Relevant Entities": "{'Chloride': [100.0, 'mEq/L'], 'Bicarbonate': [19.0, 'mEq/L'], 'Sodium': [135.0, 'mEq/L']}",
        "Ground Truth Answer": "4.0",
        "Lower Limit": "3.8",
        "Upper Limit": "4.2",
        "Ground Truth Explanation": "To compute the formula of the delta gap, the formula is anion gap (in mEq/L) - 12. The first step is to compute the patient's anion gap.\nThe formula for computing a patient's anion gap is: sodium (mEq/L) - (chloride (mEq/L)+ bicarbonate (mEq/L)).\nThe concentration of sodium is 135.0 mEq/L. \nThe concentration of chloride is 100.0 mEq/L. \nThe concentration of bicarbonate is 19.0 mEq/L. \nPlugging in these values into the anion gap formula gives us 135.0 mEq/L - (100.0 mEq/L + 19.0 mEq/L) = 16.0 mEq/L. Hence, The patient's anion gap is 16.0 mEq/L.\nPlugging in 16.0 mEq/L for the delta gap formula, we get 16.0 - 12 = 4.0 mEq/L. Hence, the patient's delta gap is 4.0 mEq/L.",
        "File Path": "camel/toolkits/medcalc_bench/delta_gap.py",
        "Usr Msg": "A 69-year-old man presents to the emergency department with shortness of breath that has been worsening over the past month. The patient states that he has had worsening shortness of breath that has progressed to shortness of breath with simple activities and minor exertion. When he was unable to climb the stairs to his house today, he decided to come to the emergency department. The patient has a past medical history of poorly managed diabetes mellitus, hypertension, end stage renal disease, and obesity. His current medications include insulin, metformin, lisinopril, hydrochlorothiazide, and ibuprofen. The patient is notably non-compliant with his medications. An EKG and chest radiograph are normal. The patient had dialysis two days ago and attends most of his appointments. Laboratory values are ordered and are seen below:\n\nSerum:\nNa+: 135 mEq/L\nK+: 4.5 mEq/L\nCl-: 100 mEq/L\nHCO3-: 19 mEq/L\nUrea nitrogen: 29 mg/dL\nGlucose: 75 mg/dL\nCreatinine: 2.5 mg/dL\nCa2+: 9.2 mg/dL\nMg2+: 1.7 mEq/L\nAST: 11 U/L\nALT: 11 U/L\n\nLeukocyte count and differential:\nLeukocyte count: 4,500/mm^3\nPlatelet count: 150,000/mm^3\nNeutrophil: 54%\nLymphocyte: 25%\nMonocyte: 3%\nEosinophil: 1%\nBasophil: 1%\n\nHemoglobin: 8.2 g/dL\nHematocrit: 22%\nMean corpuscular volume: 82 µm^3\n\nThe patient appears comfortable at rest but demonstrates notable shortness of breath when exerting himself. His temperature is 99.5°F (37.5°C), pulse is 89/min, blood pressure is 144/85 mmHg, respirations are 10/min, and oxygen saturation is 97% on room air. Pulmonary and cardiac exam are within normal limits. What is the patient's delta gap in mEq/L?"
    },
    {
        "Calculator ID": 64,
        "Calculator Name": "Delta Ratio",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-3575664-1",
        "Note Type": "Extracted",
        "Patient Note": "A 3.5-year-old girl was transferred to our institution from a local hospital with abdominal pain and bilious vomiting for further investigation and management. The child was diagnosed with isovaleric acidemia in the neonatal period, because there was a positive family history of a sibling death from this inherited disorder. Hence, measurement of elevated concentrations of isovalerylglycine in urine and of isovalerylcarnitine in plasma by mass spectrometry [] was performed after birth; then, isovaleric acid CoA dehydrogenase deficiency was confirmed by assaying its enzymatic activity in cultured skin fibroblasts [].\nThe child was admitted to the local hospital two days ago because of new-onset upper abdominal pain. Although she was unable to describe the nature and character of the pain, it was not severe enough to require analgesics. One day prior to her admission to us, she developed vomiting that eventually became bilious.\nThe patient who had normal growth and development was on oral L-carnitine supplementation since infancy. Beside that, she was not receiving any other medications. Her family history was negative for pancreatitis. On admission to us, she was afebrile with normal vital signs. On physical examination, there was moderate upper abdominal tenderness without rebound, while she had normal bowel sounds and no organomegaly. Laboratory studies on admission revealed the following: leukocytes 10,110/μL, hemoglobin 14 g/dL, hematocrit 37.2%, platelets 169,000/μL, glucose 185 mg/dL (normal < 100 mg/dL), urea 26 mg/dL, creatinine 0.4 mg/dL, sodium 133 mEq/L, potassium 3.6 mEq/L, chloride 103 mEq/L, AST 34 U/L, ALT 22 U/L, LDH 426 U/L (normal < 280 U/L), albumin 4.3 g/dL, total bilirubin 0.7 mg/dL, direct bilirubin 0.2 mg/dL, γ-GT 16 U/L, triglycerides 80 mg/dL, calcium 10 mg/dL, and amylase 536 U/L (normal 40–140 U/L). Arterial blood gases showed the following: pH 7.55, pCO2 21 mmHg, pO2 133 mmHg, HCO3 23 mmol/L, and base deficit 3.8 mmol/L. The anion gap was estimated at 7. A coagulation profile and a urine analysis were normal.\nDue to the bilious nature of vomiting, an abdominal ultrasound () was obtained that showed a notably enlarged and edematous pancreas, along with the presence of peripancreatic exudates that were extending bilaterally towards the anterior paranephric spaces and towards the right colon. The wall of the duodenum was also diffusely edematous. No gallstones were seen, the bile duct was not distended, and there was no sludge in it, while the liver, spleen, and appendix were visualized without echomorphologic abnormalities.\nSince the goal of management of acute pancreatitis is to achieve analgesia, adequate rehydration, and organ rest, the child was managed with discontinuation of oral feedings, placement of a nasogastric tube, intravenous hydration with 5% dextrose with electrolytes, and administration of intravenous ranitidine and of L-carnitine, 500 mg every 8 hours, that is, approximately 100 mg/kg/day.\nThe patient's clinical course was uncomplicated. Serum amylase normalized (84 U/L) on the 4th hospital day. She was fed with a low-fat and protein diet on the 6th hospital day. On the same day, the intravenous fluids were discontinued. Two follow-up ultrasonographic examinations on the 3rd and 5th () hospital days showed progressive but rapid resolution of the pancreatic edema and of the peripancreatic exudates. Due to substantial clinical improvement, with complete disappearance of the abdominal pain, the child was discharged home without any complaints on the 8th hospital day. She continued to do well, two months after hospital discharge.",
        "Question": "What is the patient's delta ratio?",
        "Relevant Entities": "{'Chloride': [103.0, 'mEq/L'], 'Bicarbonate': [23.0, 'mmol/L'], 'Sodium': [133.0, 'mEq/L']}",
        "Ground Truth Answer": "-5.0",
        "Lower Limit": "-5.25",
        "Upper Limit": "-4.75",
        "Ground Truth Explanation": "The formula for computing the delta ratio is delta gap (mEq/L)/(24 - bicarbonate mEq/L).\nTo compute the formula of the delta gap, the formula is anion gap (in mEq/L) - 12. The first step is to compute the patient's anion gap.\nThe formula for computing a patient's anion gap is: sodium (mEq/L) - (chloride (mEq/L)+ bicarbonate (mEq/L)).\nThe concentration of sodium is 133.0 mEq/L. \nThe concentration of chloride is 103.0 mEq/L. \nThe concentration of bicarbonate is 23.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of bicarbonate from mmol to mEq. The mass of bicarbonate is 23.0 mmol. The compound, bicarbonate, has a valence of 1, and so multiply the valence by the value of mmol to get, 23.0 mmol * 1 mEq/mmol = 23.0 mEq bicarbonate. The volume units is L so no volume conversion is needed. Hence, the concentration value of 23.0 mmol bicarbonate/L converts to 23.0 mEq bicarbonate/L. \nPlugging in these values into the anion gap formula gives us 133.0 mEq/L - (103.0 mEq/L + 23.0 mEq/L) = 7.0 mEq/L. Hence, The patient's anion gap is 7.0 mEq/L.\nPlugging in 7.0 mEq/L for the delta gap formula, we get 7.0 - 12 = -5.0 mEq/L. Hence, the patient's delta gap is -5.0 mEq/L.\nPlugging in the delta gap and the bicarbonate concentration for the delta ratio formula, we get -5.0 mEq/L / 1.0 mEq/L = -5.0. The patient's delta ratio is -5.0.",
        "File Path": "camel/toolkits/medcalc_bench/delta_ratio.py",
        "Usr Msg": "A 3.5-year-old girl was transferred to our institution from a local hospital with abdominal pain and bilious vomiting for further investigation and management. The child was diagnosed with isovaleric acidemia in the neonatal period, because there was a positive family history of a sibling death from this inherited disorder. Hence, measurement of elevated concentrations of isovalerylglycine in urine and of isovalerylcarnitine in plasma by mass spectrometry [] was performed after birth; then, isovaleric acid CoA dehydrogenase deficiency was confirmed by assaying its enzymatic activity in cultured skin fibroblasts [].\nThe child was admitted to the local hospital two days ago because of new-onset upper abdominal pain. Although she was unable to describe the nature and character of the pain, it was not severe enough to require analgesics. One day prior to her admission to us, she developed vomiting that eventually became bilious.\nThe patient who had normal growth and development was on oral L-carnitine supplementation since infancy. Beside that, she was not receiving any other medications. Her family history was negative for pancreatitis. On admission to us, she was afebrile with normal vital signs. On physical examination, there was moderate upper abdominal tenderness without rebound, while she had normal bowel sounds and no organomegaly. Laboratory studies on admission revealed the following: leukocytes 10,110/μL, hemoglobin 14 g/dL, hematocrit 37.2%, platelets 169,000/μL, glucose 185 mg/dL (normal < 100 mg/dL), urea 26 mg/dL, creatinine 0.4 mg/dL, sodium 133 mEq/L, potassium 3.6 mEq/L, chloride 103 mEq/L, AST 34 U/L, ALT 22 U/L, LDH 426 U/L (normal < 280 U/L), albumin 4.3 g/dL, total bilirubin 0.7 mg/dL, direct bilirubin 0.2 mg/dL, γ-GT 16 U/L, triglycerides 80 mg/dL, calcium 10 mg/dL, and amylase 536 U/L (normal 40–140 U/L). Arterial blood gases showed the following: pH 7.55, pCO2 21 mmHg, pO2 133 mmHg, HCO3 23 mmol/L, and base deficit 3.8 mmol/L. The anion gap was estimated at 7. A coagulation profile and a urine analysis were normal.\nDue to the bilious nature of vomiting, an abdominal ultrasound () was obtained that showed a notably enlarged and edematous pancreas, along with the presence of peripancreatic exudates that were extending bilaterally towards the anterior paranephric spaces and towards the right colon. The wall of the duodenum was also diffusely edematous. No gallstones were seen, the bile duct was not distended, and there was no sludge in it, while the liver, spleen, and appendix were visualized without echomorphologic abnormalities.\nSince the goal of management of acute pancreatitis is to achieve analgesia, adequate rehydration, and organ rest, the child was managed with discontinuation of oral feedings, placement of a nasogastric tube, intravenous hydration with 5% dextrose with electrolytes, and administration of intravenous ranitidine and of L-carnitine, 500 mg every 8 hours, that is, approximately 100 mg/kg/day.\nThe patient's clinical course was uncomplicated. Serum amylase normalized (84 U/L) on the 4th hospital day. She was fed with a low-fat and protein diet on the 6th hospital day. On the same day, the intravenous fluids were discontinued. Two follow-up ultrasonographic examinations on the 3rd and 5th () hospital days showed progressive but rapid resolution of the pancreatic edema and of the peripancreatic exudates. Due to substantial clinical improvement, with complete disappearance of the abdominal pain, the child was discharged home without any complaints on the 8th hospital day. She continued to do well, two months after hospital discharge. What is the patient's delta ratio?"
    },
    {
        "Calculator ID": 65,
        "Calculator Name": "Albumin Corrected Anion Gap",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-3519780-1",
        "Note Type": "Extracted",
        "Patient Note": "A 43 year-old male was referred to the Emergency Department (ED) of our hospital after his workplace colleagues noted increasingly strange behavior for three days. The patient arrived complaining of generalized fatigue, lethargy, fevers, severe band-like headache, slurred speech, and increasing confusion. Though it was felt that the patient’s history was not completely reliable secondary to confusion, he was able to deny throat pain, chest pain, diarrhea, abdominal pain, recent sick contacts, or recent travel. Review of systems was limited secondary to altered mental status, but he did admit to mild dry cough.\nThough initially denying immune compromise in the ED, the patient later disclosed he was HIV+. He could not recall his CD4 count but stated that his last viral load was undetectable. Past medical history was significant for hypertension and hypercholesterolemia. Outpatient medications included Atripla, spironolactone, and gemfibrozil. He had a history of unprotected anal sex with men but denied new partners. He had no recent contact with animals. He smoked a pack of cigarettes per day but did not drink or use drugs.\nIn the ED, the patient’s temperature was 103.9°F (39.9°C). Heart rate was 121 beats per minute, and respiratory rate was 30 breaths per minute. Oxygen saturation was 94% on room air. Blood pressure was 142/90. The patient appeared unwell. He was somnolent but easily aroused. Pertinent findings on general physical exam included a supple neck and decreased breath sounds diffusely. On neurologic exam, he was noted to be dysarthric. He had general slowness of thought and processing. He was slightly confused, though he was oriented and able to name the days of the week forwards and backwards if given sufficient time.\nInitial laboratory evaluation was notable for a white blood cell (WBC) count of 10.1 × 103 cells/mm3, [lab reference range 4.0–10.8], hemoglobin of 15.7 g/dL [lab range 14.0–18.0], platelet count of 135 × 103/mm3 [lab range 150–350]. Automated differential showed 87.5% segmented cells (lab range 30-85%), 9.3% lymphocytes (lab range 15-55%), 2.4% monocytes (lab range 0-10%), 0.8% eosinophils (lab range 0-5%), and 0% basophils. No manual differential was performed. A basic metabolic panel showed serum sodium of 134 mmol/L [lab range 137–145], serum potassium of 4.2 mmol/L (lab range 3.5-5.1), serum chloride of 100 mmol/L (lab range 98–107), and CO2 of 19 mmol/L [lab range 22.0–30.0]. Blood urea nitrogen, serum creatinine, and serum glucose were elevated at 33 mg/dL [lab range 9–20], 1.8 mg/dL [lab range 0.7–1.3] and 159 mg/dL [lab range 70–99], respectively. C-reactive protein (CRP) was high at 581 mg/dL [lab range 0–10]. Liver function studies showed an albumin level of 4.4 g/dL (lab range 3.5-5.0), total protein of 7.6 g/dL (lab range 6.3-8.2), total bilirubin of 0.7 mg/dL (lab range 0.2-1.3), direct bilirubin of 0.5 mg/dL (lab range 0–0.3), alkaline phosphatase of 62 U/L (lab range 38–126), alanine aminotransferase (ALT) of 49 U/L (lab range 13–69), and aspartate aminotransferase (AST) of 89 U/L (lab range 15–46). Urinalysis showed 2+ albumin, 3+ blood, trace WBC esterase, negative nitrite, 5–10 WBC, 0–5 red blood cells (RBC), 5–10 epithelial cells, 5–10 hyaline casts, 3+ amorphous cells, and 1+ mucous. A non-contrast computed tomography (CT) scan of the head did not reveal any abnormalities. Nasopharyngeal influenza assay was negative.\nDue to the combination of altered mental status, headache, and fever, a lumbar puncture was performed. The results demonstrated an elevated cerebrospinal fluid (CSF) glucose of 97 mg/dL [normal 40–70], CSF protein of 37 mg/dL [normal 12–60], and normal cell count and gram stain. Blood cultures were sent.\nA chest x-ray was done and was read as a left hilar mass extending down towards the left lower lobe (see Figure \n). A chest CT was obtained to better characterize the hilar mass (see Figure \n). This chest CT demonstrated a left lower lobe consolidation with air bronchograms suggesting a diagnosis of pneumonia. Based upon the aforementioned findings, the patient was started on azithromycin and ceftriaxone for community-acquired pneumonia, as well as empiric acyclovir for herpes encephalitis.\nGiven the findings of dysarthria and altered mental status in an HIV + individual with unknown CD4+ count, a brain MRI was obtained. No contrast was administered secondary to acute renal injury. The diffusion-weighted coronal cut can be seen in Figure \n, demonstrating abnormal restricted diffusion and swelling of the splenium of the corpus callosum without other significant abnormalities. Abnormal T2-weighted signal in the SCC can be seen in Figure \n. These MRI findings in an HIV + individual raised concern for CNS opportunistic infection. However, since the patient was hemodynamically stable, was on antiretroviral therapy, and had a negative lumbar puncture, it was decided to treat the pneumonia initially and closely monitor the patient’s mental status.\nOver the first two to three days of hospitalization, the patient continued to have high fevers, confusion, and dysarthria. His laboratory markers improved on antibiotics. His serum CRP trended down from 581 mg/L at admission to 200 mg/L on day three. After day three the patient began to demonstrate significant clinical improvement. The patient’s admission CD4+ count returned on day three at 156 cells/mm3, and an HIV viral load came back on day four at <20 copies/mL. On day four, urine antigens for Streptococcus pneumoniae and Legionella pneumophila serogroup 1 were sent. By day five the patient’s neurologic symptoms had resolved, as had his acute renal insufficiency. This same day his Legionella pneumophila urinary antigen returned positive.\nOn hospital day six a repeat MRI was obtained to monitor radiologic progression of the SCC lesion. This repeat study showed partial interval clearing of the previously noted abnormalities: restricted diffusion, abnormal increased flair, and abnormal T2 signally in the SCC. On hospital day seven the patient was discharged home on oral azithromycin. He had no residual deficits. Initial CSF viral studies including herpes simplex virus 1 and 2, varicella, cytomegalovirus, enterovirus, and JC virus all returned negative, as did the syphilis, hepatitis B, and hepatitis C serologies. Sputum for acid fast bacilli and routine culture were negative. Legionella antibody IgG titers sent on day four later came back at 1:64.",
        "Question": "What is the patient's albumin corrected anion gap in mEq/L?",
        "Relevant Entities": "{'Chloride': [100.0, 'mmol/L'], 'Albumin': [4.4, 'g/dL'], 'Bicarbonate': [19.0, 'mmol/L'], 'Sodium': [134.0, 'mmol/L']}",
        "Ground Truth Answer": "14.0",
        "Lower Limit": "13.3",
        "Upper Limit": "14.7",
        "Ground Truth Explanation": "The formula for computing a patient's albumin corrected anion gap is: anion_gap (in mEq/L) + 2.5 * (4 - albumin (in g/dL)).\nThe formula for computing a patient's anion gap is: sodium (mEq/L) - (chloride (mEq/L)+ bicarbonate (mEq/L)).\nThe concentration of sodium is 134.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of sodium from mmol to mEq. The mass of sodium is 134.0 mmol. The compound, sodium, has a valence of 1, and so multiply the valence by the value of mmol to get, 134.0 mmol * 1 mEq/mmol = 134.0 mEq sodium. The volume units is L so no volume conversion is needed. Hence, the concentration value of 134.0 mmol sodium/L converts to 134.0 mEq sodium/L. \nThe concentration of chloride is 100.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of chloride from mmol to mEq. The mass of chloride is 100.0 mmol. The compound, chloride, has a valence of 1, and so multiply the valence by the value of mmol to get, 100.0 mmol * 1 mEq/mmol = 100.0 mEq chloride. The volume units is L so no volume conversion is needed. Hence, the concentration value of 100.0 mmol chloride/L converts to 100.0 mEq chloride/L. \nThe concentration of bicarbonate is 19.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of bicarbonate from mmol to mEq. The mass of bicarbonate is 19.0 mmol. The compound, bicarbonate, has a valence of 1, and so multiply the valence by the value of mmol to get, 19.0 mmol * 1 mEq/mmol = 19.0 mEq bicarbonate. The volume units is L so no volume conversion is needed. Hence, the concentration value of 19.0 mmol bicarbonate/L converts to 19.0 mEq bicarbonate/L. \nPlugging in these values into the anion gap formula gives us 134.0 mEq/L - (100.0 mEq/L + 19.0 mEq/L) = 15.0 mEq/L. Hence, The patient's anion gap is 15.0 mEq/L.\nThe concentration of albumin is 4.4 g/dL. Plugging in these values into the albumin corrected anion gap formula, we get 15.0 (mEq/L) + 2.5 * (4 - 4.4 (in g/dL)) = 14.0 mEq/L. Hence, the patient's albumin corrected anion gap is 14.0 mEq/L.",
        "File Path": "camel/toolkits/medcalc_bench/albumin_corrected_anion.py",
        "Usr Msg": "A 43 year-old male was referred to the Emergency Department (ED) of our hospital after his workplace colleagues noted increasingly strange behavior for three days. The patient arrived complaining of generalized fatigue, lethargy, fevers, severe band-like headache, slurred speech, and increasing confusion. Though it was felt that the patient’s history was not completely reliable secondary to confusion, he was able to deny throat pain, chest pain, diarrhea, abdominal pain, recent sick contacts, or recent travel. Review of systems was limited secondary to altered mental status, but he did admit to mild dry cough.\nThough initially denying immune compromise in the ED, the patient later disclosed he was HIV+. He could not recall his CD4 count but stated that his last viral load was undetectable. Past medical history was significant for hypertension and hypercholesterolemia. Outpatient medications included Atripla, spironolactone, and gemfibrozil. He had a history of unprotected anal sex with men but denied new partners. He had no recent contact with animals. He smoked a pack of cigarettes per day but did not drink or use drugs.\nIn the ED, the patient’s temperature was 103.9°F (39.9°C). Heart rate was 121 beats per minute, and respiratory rate was 30 breaths per minute. Oxygen saturation was 94% on room air. Blood pressure was 142/90. The patient appeared unwell. He was somnolent but easily aroused. Pertinent findings on general physical exam included a supple neck and decreased breath sounds diffusely. On neurologic exam, he was noted to be dysarthric. He had general slowness of thought and processing. He was slightly confused, though he was oriented and able to name the days of the week forwards and backwards if given sufficient time.\nInitial laboratory evaluation was notable for a white blood cell (WBC) count of 10.1 × 103 cells/mm3, [lab reference range 4.0–10.8], hemoglobin of 15.7 g/dL [lab range 14.0–18.0], platelet count of 135 × 103/mm3 [lab range 150–350]. Automated differential showed 87.5% segmented cells (lab range 30-85%), 9.3% lymphocytes (lab range 15-55%), 2.4% monocytes (lab range 0-10%), 0.8% eosinophils (lab range 0-5%), and 0% basophils. No manual differential was performed. A basic metabolic panel showed serum sodium of 134 mmol/L [lab range 137–145], serum potassium of 4.2 mmol/L (lab range 3.5-5.1), serum chloride of 100 mmol/L (lab range 98–107), and CO2 of 19 mmol/L [lab range 22.0–30.0]. Blood urea nitrogen, serum creatinine, and serum glucose were elevated at 33 mg/dL [lab range 9–20], 1.8 mg/dL [lab range 0.7–1.3] and 159 mg/dL [lab range 70–99], respectively. C-reactive protein (CRP) was high at 581 mg/dL [lab range 0–10]. Liver function studies showed an albumin level of 4.4 g/dL (lab range 3.5-5.0), total protein of 7.6 g/dL (lab range 6.3-8.2), total bilirubin of 0.7 mg/dL (lab range 0.2-1.3), direct bilirubin of 0.5 mg/dL (lab range 0–0.3), alkaline phosphatase of 62 U/L (lab range 38–126), alanine aminotransferase (ALT) of 49 U/L (lab range 13–69), and aspartate aminotransferase (AST) of 89 U/L (lab range 15–46). Urinalysis showed 2+ albumin, 3+ blood, trace WBC esterase, negative nitrite, 5–10 WBC, 0–5 red blood cells (RBC), 5–10 epithelial cells, 5–10 hyaline casts, 3+ amorphous cells, and 1+ mucous. A non-contrast computed tomography (CT) scan of the head did not reveal any abnormalities. Nasopharyngeal influenza assay was negative.\nDue to the combination of altered mental status, headache, and fever, a lumbar puncture was performed. The results demonstrated an elevated cerebrospinal fluid (CSF) glucose of 97 mg/dL [normal 40–70], CSF protein of 37 mg/dL [normal 12–60], and normal cell count and gram stain. Blood cultures were sent.\nA chest x-ray was done and was read as a left hilar mass extending down towards the left lower lobe (see Figure \n). A chest CT was obtained to better characterize the hilar mass (see Figure \n). This chest CT demonstrated a left lower lobe consolidation with air bronchograms suggesting a diagnosis of pneumonia. Based upon the aforementioned findings, the patient was started on azithromycin and ceftriaxone for community-acquired pneumonia, as well as empiric acyclovir for herpes encephalitis.\nGiven the findings of dysarthria and altered mental status in an HIV + individual with unknown CD4+ count, a brain MRI was obtained. No contrast was administered secondary to acute renal injury. The diffusion-weighted coronal cut can be seen in Figure \n, demonstrating abnormal restricted diffusion and swelling of the splenium of the corpus callosum without other significant abnormalities. Abnormal T2-weighted signal in the SCC can be seen in Figure \n. These MRI findings in an HIV + individual raised concern for CNS opportunistic infection. However, since the patient was hemodynamically stable, was on antiretroviral therapy, and had a negative lumbar puncture, it was decided to treat the pneumonia initially and closely monitor the patient’s mental status.\nOver the first two to three days of hospitalization, the patient continued to have high fevers, confusion, and dysarthria. His laboratory markers improved on antibiotics. His serum CRP trended down from 581 mg/L at admission to 200 mg/L on day three. After day three the patient began to demonstrate significant clinical improvement. The patient’s admission CD4+ count returned on day three at 156 cells/mm3, and an HIV viral load came back on day four at <20 copies/mL. On day four, urine antigens for Streptococcus pneumoniae and Legionella pneumophila serogroup 1 were sent. By day five the patient’s neurologic symptoms had resolved, as had his acute renal insufficiency. This same day his Legionella pneumophila urinary antigen returned positive.\nOn hospital day six a repeat MRI was obtained to monitor radiologic progression of the SCC lesion. This repeat study showed partial interval clearing of the previously noted abnormalities: restricted diffusion, abnormal increased flair, and abnormal T2 signally in the SCC. On hospital day seven the patient was discharged home on oral azithromycin. He had no residual deficits. Initial CSF viral studies including herpes simplex virus 1 and 2, varicella, cytomegalovirus, enterovirus, and JC virus all returned negative, as did the syphilis, hepatitis B, and hepatitis C serologies. Sputum for acid fast bacilli and routine culture were negative. Legionella antibody IgG titers sent on day four later came back at 1:64. What is the patient's albumin corrected anion gap in mEq/L?"
    },
    {
        "Calculator ID": 66,
        "Calculator Name": "Albumin Corrected Delta Gap",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-3094288-1",
        "Note Type": "Extracted",
        "Patient Note": "A 17-year-old Caucasian female presented to local hospital with a history of acute alcohol intoxication and ingestion of large quantities of acetaminophen. The patient complained of nausea for 2 days and subjective increase in thirst and urine output for a day. She did not notice any dysuria, abdominal pain or change in the colour of her urine. She did however report a remarkable increase in lower back pain that she had attributed to strenuous exercise.\nTwo days prior to her presentation to the emergency department, the young lady had attended a party where she consumed over 300 mL of vodka and ingested twenty 500 mg tablets of acetaminophen later that night.\nPast medical history revealed that she had experienced an episode of rash after having taken liquid acetaminophen as a child. She had not taken acetaminophen since infancy and also denied regular use of any other analgesic. Family history was non-contributory for relevant physiological and psychological illness. The patient reported feeling stressed due to a recent slip in school grades, however denied any suicidal ideation.\nPhysical examination in the emergency department revealed blood pressure of 140/92 mmHg, pulse 80 bpm, temperature 36.9°C, respiratory rate of 16 breaths per minute and oxygen saturation of 100% at room air. Height and weight were recorded at 170 cm and 63 kg. Physical examination was otherwise unremarkable. No rash, joint swelling or sign of dehydration was detected.\nInitial renal function tests at the local hospital revealed serum creatinine and BUN levels of 1.6 mg/dL and 19.3 mg/dL, respectively. Other laboratory results included: glucose 112 mg/dL, sodium 141 mEq/L, potassium 4.3 mEq/L, chloride 104 mEq/L, bicarbonate 29 mEq/L, albumin 43 g/L, aspartate transaminase 20 IU/L, alkaline phosphate 66 IU/L and total bilirubin 1.11 mg/dL. Her INR was reported to be normal at 0.9. Toxicity screens on admission showed acetaminophen level at 9.06 μg/mL. Urine dipstick showed trace amount of blood and 2 plus protein. Microscopy revealed 25 red blood cells per high power field and was otherwise non-contributory. Abdominal ultrasound revealed increased hepatic echogenicity and the kidneys were normal in appearance.\nAt the outside hospital, she was given morphine, ondansetron and lansoprazole for her back pain and gastrointestinal symptoms. Acetylcysteine was not administered as the patient presented more than 24 hours after the ingestion of acetaminophen.\nRenal function tests were repeated later that evening and monitored frequently thereafter. Over the course of 36 hours, the patient's serum creatinine and BUN levels elevated from 1.6 mg/dL and 19.3 mg/dL to 5.7 mg/dL and 49.6 mg/dL, respectively. Urine output was reported to be 2.7 mL/kg/hour. At this time, the patient was transferred to our Children's Hospital for rapidly progressive renal insufficiency.\nPhysical examination upon admission showed normal vital signs: blood pressure 115/74 mmHg, pulse 60 bpm, temperature 36.6°C, respiratory rate 16 breaths per minute and 100% oxygen saturation at room air. Serum creatinine and BUN levels were measured at 6.3 mg/dL and 52.4 mg/dL, respectively. Furthermore, her electrolytes were recorded as follows: random glucose 86 mg/dL, sodium 134 mEq/L, potassium 5.7 mEq/L, chloride 104 mEq/L and bicarbonate 22 mEq/L. Coagulation study revealed an INR of 1.0 and an APTT of 28 seconds. Other investigations including blood counts and liver functions tests were within normal range. The patient's daily urine output was 3.3 mL/kg/hour at this time. Urinalysis revealed small amounts of protein and blood in her urine. Staining for eosinophils on the random urine sample was positive.\nRenal biopsy was performed to further delineate the underlying cause of rapidly progressive renal insufficiency. Figure depicts the histological findings. The biopsy showed no evidence of glomerulonephritis. The interstitium was mildly edematous with small aggregates of inflammatory cells, mainly lymphocytes and eosinophils. Immunofluorescence and electron microscopy were both negative for immune deposits. The histological findings were compatible with acute interstitial nephritis.\nThe patient was managed supportively by careful monitoring of fluid intake and output. Corticosteroids therapy was considered if no improvement of her renal function was observed. However, her serum creatinine and BUN levels peaked at 7.0 mg/dL and 60 mg/dL two days after admission then began to improve without further medical intervention. Her serum creatinine and BUN levels upon discharge were 4.7 mg/dL and 48 mg/dL respectively. Outpatient follow-up at two weeks after discharge showed that she had completely recovered; her creatinine was 1 mg/dL and BUN was 18 mg/dL.",
        "Question": "What is the patient's albumin corrected delta gap in mEq/L?",
        "Relevant Entities": "{'Chloride': [104.0, 'mEq/L'], 'Albumin': [43.0, 'g/L'], 'Bicarbonate': [29.0, 'mEq/L'], 'Sodium': [141.0, 'mEq/L']}",
        "Ground Truth Answer": "-4.75",
        "Lower Limit": "-4.99",
        "Upper Limit": "-4.51",
        "Ground Truth Explanation": "To compute the formula of albumin corrected delta gap, the formula is albumin corrected anion gap (in mEq/L) - 12.\nThe formula for computing a patient's albumin corrected anion gap is: anion_gap (in mEq/L) + 2.5 * (4 - albumin (in g/dL)).\nThe formula for computing a patient's anion gap is: sodium (mEq/L) - (chloride (mEq/L)+ bicarbonate (mEq/L)).\nThe concentration of sodium is 141.0 mEq/L. \nThe concentration of chloride is 104.0 mEq/L. \nThe concentration of bicarbonate is 29.0 mEq/L. \nPlugging in these values into the anion gap formula gives us 141.0 mEq/L - (104.0 mEq/L + 29.0 mEq/L) = 8.0 mEq/L. Hence, The patient's anion gap is 8.0 mEq/L.\nThe concentration of albumin is 43.0 g/L. We need to convert the concentration to g/dL. The mass units of the source and target are the same so no conversion is needed. The current volume unit is L and the target volume unit is dL. The conversion factor is 10.0 dL for every unit of L. Our next step will be to divide the mass by the volume conversion factor of 10.0 to get the final concentration in terms of g/dL. This will result to 43.0 g albumin/10.0 dL = 4.3 g albumin/dL. The concentration value of 43.0 g albumin/L converts to 4.3 g albumin/dL. Plugging in these values into the albumin corrected anion gap formula, we get 8.0 (mEq/L) + 2.5 * (4 - 4.3 (in g/dL)) = 7.25 mEq/L. Hence, the patient's albumin corrected anion gap is 7.25 mEq/L.\nPlugging in 7.25 mEq/L for the anion gap into the albumin corrected delta gap formula, we get 7.25 - 12 = -4.75 mEq/L. Hence, the patient's albumin corrected delta gap is -4.75 mEq/L.",
        "File Path": "camel/toolkits/medcalc_bench/albumin_corrected_delta_gap.py",
        "Usr Msg": "A 17-year-old Caucasian female presented to local hospital with a history of acute alcohol intoxication and ingestion of large quantities of acetaminophen. The patient complained of nausea for 2 days and subjective increase in thirst and urine output for a day. She did not notice any dysuria, abdominal pain or change in the colour of her urine. She did however report a remarkable increase in lower back pain that she had attributed to strenuous exercise.\nTwo days prior to her presentation to the emergency department, the young lady had attended a party where she consumed over 300 mL of vodka and ingested twenty 500 mg tablets of acetaminophen later that night.\nPast medical history revealed that she had experienced an episode of rash after having taken liquid acetaminophen as a child. She had not taken acetaminophen since infancy and also denied regular use of any other analgesic. Family history was non-contributory for relevant physiological and psychological illness. The patient reported feeling stressed due to a recent slip in school grades, however denied any suicidal ideation.\nPhysical examination in the emergency department revealed blood pressure of 140/92 mmHg, pulse 80 bpm, temperature 36.9°C, respiratory rate of 16 breaths per minute and oxygen saturation of 100% at room air. Height and weight were recorded at 170 cm and 63 kg. Physical examination was otherwise unremarkable. No rash, joint swelling or sign of dehydration was detected.\nInitial renal function tests at the local hospital revealed serum creatinine and BUN levels of 1.6 mg/dL and 19.3 mg/dL, respectively. Other laboratory results included: glucose 112 mg/dL, sodium 141 mEq/L, potassium 4.3 mEq/L, chloride 104 mEq/L, bicarbonate 29 mEq/L, albumin 43 g/L, aspartate transaminase 20 IU/L, alkaline phosphate 66 IU/L and total bilirubin 1.11 mg/dL. Her INR was reported to be normal at 0.9. Toxicity screens on admission showed acetaminophen level at 9.06 μg/mL. Urine dipstick showed trace amount of blood and 2 plus protein. Microscopy revealed 25 red blood cells per high power field and was otherwise non-contributory. Abdominal ultrasound revealed increased hepatic echogenicity and the kidneys were normal in appearance.\nAt the outside hospital, she was given morphine, ondansetron and lansoprazole for her back pain and gastrointestinal symptoms. Acetylcysteine was not administered as the patient presented more than 24 hours after the ingestion of acetaminophen.\nRenal function tests were repeated later that evening and monitored frequently thereafter. Over the course of 36 hours, the patient's serum creatinine and BUN levels elevated from 1.6 mg/dL and 19.3 mg/dL to 5.7 mg/dL and 49.6 mg/dL, respectively. Urine output was reported to be 2.7 mL/kg/hour. At this time, the patient was transferred to our Children's Hospital for rapidly progressive renal insufficiency.\nPhysical examination upon admission showed normal vital signs: blood pressure 115/74 mmHg, pulse 60 bpm, temperature 36.6°C, respiratory rate 16 breaths per minute and 100% oxygen saturation at room air. Serum creatinine and BUN levels were measured at 6.3 mg/dL and 52.4 mg/dL, respectively. Furthermore, her electrolytes were recorded as follows: random glucose 86 mg/dL, sodium 134 mEq/L, potassium 5.7 mEq/L, chloride 104 mEq/L and bicarbonate 22 mEq/L. Coagulation study revealed an INR of 1.0 and an APTT of 28 seconds. Other investigations including blood counts and liver functions tests were within normal range. The patient's daily urine output was 3.3 mL/kg/hour at this time. Urinalysis revealed small amounts of protein and blood in her urine. Staining for eosinophils on the random urine sample was positive.\nRenal biopsy was performed to further delineate the underlying cause of rapidly progressive renal insufficiency. Figure depicts the histological findings. The biopsy showed no evidence of glomerulonephritis. The interstitium was mildly edematous with small aggregates of inflammatory cells, mainly lymphocytes and eosinophils. Immunofluorescence and electron microscopy were both negative for immune deposits. The histological findings were compatible with acute interstitial nephritis.\nThe patient was managed supportively by careful monitoring of fluid intake and output. Corticosteroids therapy was considered if no improvement of her renal function was observed. However, her serum creatinine and BUN levels peaked at 7.0 mg/dL and 60 mg/dL two days after admission then began to improve without further medical intervention. Her serum creatinine and BUN levels upon discharge were 4.7 mg/dL and 48 mg/dL respectively. Outpatient follow-up at two weeks after discharge showed that she had completely recovered; her creatinine was 1 mg/dL and BUN was 18 mg/dL. What is the patient's albumin corrected delta gap in mEq/L?"
    },
    {
        "Calculator ID": 67,
        "Calculator Name": "Albumin Corrected Delta Ratio",
        "Category": "lab test",
        "Output Type": "decimal",
        "Note ID": "pmc-3519780-1",
        "Note Type": "Extracted",
        "Patient Note": "A 43 year-old male was referred to the Emergency Department (ED) of our hospital after his workplace colleagues noted increasingly strange behavior for three days. The patient arrived complaining of generalized fatigue, lethargy, fevers, severe band-like headache, slurred speech, and increasing confusion. Though it was felt that the patient’s history was not completely reliable secondary to confusion, he was able to deny throat pain, chest pain, diarrhea, abdominal pain, recent sick contacts, or recent travel. Review of systems was limited secondary to altered mental status, but he did admit to mild dry cough.\nThough initially denying immune compromise in the ED, the patient later disclosed he was HIV+. He could not recall his CD4 count but stated that his last viral load was undetectable. Past medical history was significant for hypertension and hypercholesterolemia. Outpatient medications included Atripla, spironolactone, and gemfibrozil. He had a history of unprotected anal sex with men but denied new partners. He had no recent contact with animals. He smoked a pack of cigarettes per day but did not drink or use drugs.\nIn the ED, the patient’s temperature was 103.9°F (39.9°C). Heart rate was 121 beats per minute, and respiratory rate was 30 breaths per minute. Oxygen saturation was 94% on room air. Blood pressure was 142/90. The patient appeared unwell. He was somnolent but easily aroused. Pertinent findings on general physical exam included a supple neck and decreased breath sounds diffusely. On neurologic exam, he was noted to be dysarthric. He had general slowness of thought and processing. He was slightly confused, though he was oriented and able to name the days of the week forwards and backwards if given sufficient time.\nInitial laboratory evaluation was notable for a white blood cell (WBC) count of 10.1 × 103 cells/mm3, [lab reference range 4.0–10.8], hemoglobin of 15.7 g/dL [lab range 14.0–18.0], platelet count of 135 × 103/mm3 [lab range 150–350]. Automated differential showed 87.5% segmented cells (lab range 30-85%), 9.3% lymphocytes (lab range 15-55%), 2.4% monocytes (lab range 0-10%), 0.8% eosinophils (lab range 0-5%), and 0% basophils. No manual differential was performed. A basic metabolic panel showed serum sodium of 134 mmol/L [lab range 137–145], serum potassium of 4.2 mmol/L (lab range 3.5-5.1), serum chloride of 100 mmol/L (lab range 98–107), and CO2 of 19 mmol/L [lab range 22.0–30.0]. Blood urea nitrogen, serum creatinine, and serum glucose were elevated at 33 mg/dL [lab range 9–20], 1.8 mg/dL [lab range 0.7–1.3] and 159 mg/dL [lab range 70–99], respectively. C-reactive protein (CRP) was high at 581 mg/dL [lab range 0–10]. Liver function studies showed an albumin level of 4.4 g/dL (lab range 3.5-5.0), total protein of 7.6 g/dL (lab range 6.3-8.2), total bilirubin of 0.7 mg/dL (lab range 0.2-1.3), direct bilirubin of 0.5 mg/dL (lab range 0–0.3), alkaline phosphatase of 62 U/L (lab range 38–126), alanine aminotransferase (ALT) of 49 U/L (lab range 13–69), and aspartate aminotransferase (AST) of 89 U/L (lab range 15–46). Urinalysis showed 2+ albumin, 3+ blood, trace WBC esterase, negative nitrite, 5–10 WBC, 0–5 red blood cells (RBC), 5–10 epithelial cells, 5–10 hyaline casts, 3+ amorphous cells, and 1+ mucous. A non-contrast computed tomography (CT) scan of the head did not reveal any abnormalities. Nasopharyngeal influenza assay was negative.\nDue to the combination of altered mental status, headache, and fever, a lumbar puncture was performed. The results demonstrated an elevated cerebrospinal fluid (CSF) glucose of 97 mg/dL [normal 40–70], CSF protein of 37 mg/dL [normal 12–60], and normal cell count and gram stain. Blood cultures were sent.\nA chest x-ray was done and was read as a left hilar mass extending down towards the left lower lobe (see Figure \n). A chest CT was obtained to better characterize the hilar mass (see Figure \n). This chest CT demonstrated a left lower lobe consolidation with air bronchograms suggesting a diagnosis of pneumonia. Based upon the aforementioned findings, the patient was started on azithromycin and ceftriaxone for community-acquired pneumonia, as well as empiric acyclovir for herpes encephalitis.\nGiven the findings of dysarthria and altered mental status in an HIV + individual with unknown CD4+ count, a brain MRI was obtained. No contrast was administered secondary to acute renal injury. The diffusion-weighted coronal cut can be seen in Figure \n, demonstrating abnormal restricted diffusion and swelling of the splenium of the corpus callosum without other significant abnormalities. Abnormal T2-weighted signal in the SCC can be seen in Figure \n. These MRI findings in an HIV + individual raised concern for CNS opportunistic infection. However, since the patient was hemodynamically stable, was on antiretroviral therapy, and had a negative lumbar puncture, it was decided to treat the pneumonia initially and closely monitor the patient’s mental status.\nOver the first two to three days of hospitalization, the patient continued to have high fevers, confusion, and dysarthria. His laboratory markers improved on antibiotics. His serum CRP trended down from 581 mg/L at admission to 200 mg/L on day three. After day three the patient began to demonstrate significant clinical improvement. The patient’s admission CD4+ count returned on day three at 156 cells/mm3, and an HIV viral load came back on day four at <20 copies/mL. On day four, urine antigens for Streptococcus pneumoniae and Legionella pneumophila serogroup 1 were sent. By day five the patient’s neurologic symptoms had resolved, as had his acute renal insufficiency. This same day his Legionella pneumophila urinary antigen returned positive.\nOn hospital day six a repeat MRI was obtained to monitor radiologic progression of the SCC lesion. This repeat study showed partial interval clearing of the previously noted abnormalities: restricted diffusion, abnormal increased flair, and abnormal T2 signally in the SCC. On hospital day seven the patient was discharged home on oral azithromycin. He had no residual deficits. Initial CSF viral studies including herpes simplex virus 1 and 2, varicella, cytomegalovirus, enterovirus, and JC virus all returned negative, as did the syphilis, hepatitis B, and hepatitis C serologies. Sputum for acid fast bacilli and routine culture were negative. Legionella antibody IgG titers sent on day four later came back at 1:64.",
        "Question": "What is the patient's albumin corrected delta ratio?",
        "Relevant Entities": "{'Chloride': [100.0, 'mmol/L'], 'Albumin': [4.4, 'g/dL'], 'Bicarbonate': [19.0, 'mmol/L'], 'Sodium': [134.0, 'mmol/L']}",
        "Ground Truth Answer": "0.4",
        "Lower Limit": "0.38",
        "Upper Limit": "0.42",
        "Ground Truth Explanation": "The formula for computing the albumin corrected delta ratio is albumin corrected delta gap (mEq/L)/(24 - bicarbonate mEq/L).\nTo compute the formula of albumin corrected delta gap, the formula is albumin corrected anion gap (in mEq/L) - 12.\nThe formula for computing a patient's albumin corrected anion gap is: anion_gap (in mEq/L) + 2.5 * (4 - albumin (in g/dL)).\nThe formula for computing a patient's anion gap is: sodium (mEq/L) - (chloride (mEq/L)+ bicarbonate (mEq/L)).\nThe concentration of sodium is 134.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of sodium from mmol to mEq. The mass of sodium is 134.0 mmol. The compound, sodium, has a valence of 1, and so multiply the valence by the value of mmol to get, 134.0 mmol * 1 mEq/mmol = 134.0 mEq sodium. The volume units is L so no volume conversion is needed. Hence, the concentration value of 134.0 mmol sodium/L converts to 134.0 mEq sodium/L. \nThe concentration of chloride is 100.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of chloride from mmol to mEq. The mass of chloride is 100.0 mmol. The compound, chloride, has a valence of 1, and so multiply the valence by the value of mmol to get, 100.0 mmol * 1 mEq/mmol = 100.0 mEq chloride. The volume units is L so no volume conversion is needed. Hence, the concentration value of 100.0 mmol chloride/L converts to 100.0 mEq chloride/L. \nThe concentration of bicarbonate is 19.0 mmol/L. We need to convert the concentration to mEq/L. Let's first convert the mass of bicarbonate from mmol to mEq. The mass of bicarbonate is 19.0 mmol. The compound, bicarbonate, has a valence of 1, and so multiply the valence by the value of mmol to get, 19.0 mmol * 1 mEq/mmol = 19.0 mEq bicarbonate. The volume units is L so no volume conversion is needed. Hence, the concentration value of 19.0 mmol bicarbonate/L converts to 19.0 mEq bicarbonate/L. \nPlugging in these values into the anion gap formula gives us 134.0 mEq/L - (100.0 mEq/L + 19.0 mEq/L) = 15.0 mEq/L. Hence, The patient's anion gap is 15.0 mEq/L.\nThe concentration of albumin is 4.4 g/dL. Plugging in these values into the albumin corrected anion gap formula, we get 15.0 (mEq/L) + 2.5 * (4 - 4.4 (in g/dL)) = 14.0 mEq/L. Hence, the patient's albumin corrected anion gap is 14.0 mEq/L.\nPlugging in 14.0 mEq/L for the anion gap into the albumin corrected delta gap formula, we get 14.0 - 12 = 2.0 mEq/L. Hence, the patient's albumin corrected delta gap is 2.0 mEq/L.\nPlugging in the albumin corrected delta gap and the bicarbonate concentration into the albumin corrected delta ratio formula, we get 2.0 mEq/L / 5.0 mEq/L = 0.4. The patient's albumin corrected delta ratio is 0.4.",
        "File Path": "camel/toolkits/medcalc_bench/albumin_delta_ratio.py",
        "Usr Msg": "A 43 year-old male was referred to the Emergency Department (ED) of our hospital after his workplace colleagues noted increasingly strange behavior for three days. The patient arrived complaining of generalized fatigue, lethargy, fevers, severe band-like headache, slurred speech, and increasing confusion. Though it was felt that the patient’s history was not completely reliable secondary to confusion, he was able to deny throat pain, chest pain, diarrhea, abdominal pain, recent sick contacts, or recent travel. Review of systems was limited secondary to altered mental status, but he did admit to mild dry cough.\nThough initially denying immune compromise in the ED, the patient later disclosed he was HIV+. He could not recall his CD4 count but stated that his last viral load was undetectable. Past medical history was significant for hypertension and hypercholesterolemia. Outpatient medications included Atripla, spironolactone, and gemfibrozil. He had a history of unprotected anal sex with men but denied new partners. He had no recent contact with animals. He smoked a pack of cigarettes per day but did not drink or use drugs.\nIn the ED, the patient’s temperature was 103.9°F (39.9°C). Heart rate was 121 beats per minute, and respiratory rate was 30 breaths per minute. Oxygen saturation was 94% on room air. Blood pressure was 142/90. The patient appeared unwell. He was somnolent but easily aroused. Pertinent findings on general physical exam included a supple neck and decreased breath sounds diffusely. On neurologic exam, he was noted to be dysarthric. He had general slowness of thought and processing. He was slightly confused, though he was oriented and able to name the days of the week forwards and backwards if given sufficient time.\nInitial laboratory evaluation was notable for a white blood cell (WBC) count of 10.1 × 103 cells/mm3, [lab reference range 4.0–10.8], hemoglobin of 15.7 g/dL [lab range 14.0–18.0], platelet count of 135 × 103/mm3 [lab range 150–350]. Automated differential showed 87.5% segmented cells (lab range 30-85%), 9.3% lymphocytes (lab range 15-55%), 2.4% monocytes (lab range 0-10%), 0.8% eosinophils (lab range 0-5%), and 0% basophils. No manual differential was performed. A basic metabolic panel showed serum sodium of 134 mmol/L [lab range 137–145], serum potassium of 4.2 mmol/L (lab range 3.5-5.1), serum chloride of 100 mmol/L (lab range 98–107), and CO2 of 19 mmol/L [lab range 22.0–30.0]. Blood urea nitrogen, serum creatinine, and serum glucose were elevated at 33 mg/dL [lab range 9–20], 1.8 mg/dL [lab range 0.7–1.3] and 159 mg/dL [lab range 70–99], respectively. C-reactive protein (CRP) was high at 581 mg/dL [lab range 0–10]. Liver function studies showed an albumin level of 4.4 g/dL (lab range 3.5-5.0), total protein of 7.6 g/dL (lab range 6.3-8.2), total bilirubin of 0.7 mg/dL (lab range 0.2-1.3), direct bilirubin of 0.5 mg/dL (lab range 0–0.3), alkaline phosphatase of 62 U/L (lab range 38–126), alanine aminotransferase (ALT) of 49 U/L (lab range 13–69), and aspartate aminotransferase (AST) of 89 U/L (lab range 15–46). Urinalysis showed 2+ albumin, 3+ blood, trace WBC esterase, negative nitrite, 5–10 WBC, 0–5 red blood cells (RBC), 5–10 epithelial cells, 5–10 hyaline casts, 3+ amorphous cells, and 1+ mucous. A non-contrast computed tomography (CT) scan of the head did not reveal any abnormalities. Nasopharyngeal influenza assay was negative.\nDue to the combination of altered mental status, headache, and fever, a lumbar puncture was performed. The results demonstrated an elevated cerebrospinal fluid (CSF) glucose of 97 mg/dL [normal 40–70], CSF protein of 37 mg/dL [normal 12–60], and normal cell count and gram stain. Blood cultures were sent.\nA chest x-ray was done and was read as a left hilar mass extending down towards the left lower lobe (see Figure \n). A chest CT was obtained to better characterize the hilar mass (see Figure \n). This chest CT demonstrated a left lower lobe consolidation with air bronchograms suggesting a diagnosis of pneumonia. Based upon the aforementioned findings, the patient was started on azithromycin and ceftriaxone for community-acquired pneumonia, as well as empiric acyclovir for herpes encephalitis.\nGiven the findings of dysarthria and altered mental status in an HIV + individual with unknown CD4+ count, a brain MRI was obtained. No contrast was administered secondary to acute renal injury. The diffusion-weighted coronal cut can be seen in Figure \n, demonstrating abnormal restricted diffusion and swelling of the splenium of the corpus callosum without other significant abnormalities. Abnormal T2-weighted signal in the SCC can be seen in Figure \n. These MRI findings in an HIV + individual raised concern for CNS opportunistic infection. However, since the patient was hemodynamically stable, was on antiretroviral therapy, and had a negative lumbar puncture, it was decided to treat the pneumonia initially and closely monitor the patient’s mental status.\nOver the first two to three days of hospitalization, the patient continued to have high fevers, confusion, and dysarthria. His laboratory markers improved on antibiotics. His serum CRP trended down from 581 mg/L at admission to 200 mg/L on day three. After day three the patient began to demonstrate significant clinical improvement. The patient’s admission CD4+ count returned on day three at 156 cells/mm3, and an HIV viral load came back on day four at <20 copies/mL. On day four, urine antigens for Streptococcus pneumoniae and Legionella pneumophila serogroup 1 were sent. By day five the patient’s neurologic symptoms had resolved, as had his acute renal insufficiency. This same day his Legionella pneumophila urinary antigen returned positive.\nOn hospital day six a repeat MRI was obtained to monitor radiologic progression of the SCC lesion. This repeat study showed partial interval clearing of the previously noted abnormalities: restricted diffusion, abnormal increased flair, and abnormal T2 signally in the SCC. On hospital day seven the patient was discharged home on oral azithromycin. He had no residual deficits. Initial CSF viral studies including herpes simplex virus 1 and 2, varicella, cytomegalovirus, enterovirus, and JC virus all returned negative, as did the syphilis, hepatitis B, and hepatitis C serologies. Sputum for acid fast bacilli and routine culture were negative. Legionella antibody IgG titers sent on day four later came back at 1:64. What is the patient's albumin corrected delta ratio?"
    },
    {
        "Calculator ID": 68,
        "Calculator Name": "Estimated of Conception",
        "Category": "date",
        "Output Type": "date",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "The patient's last menstrual period was on 01/21/2004. Her cycle length is 20 days.",
        "Question": "Based on the patient's last menstrual period and cycle length, what is the the patient's estimated date of conception? Your answer should be in the format of M/D/Y (ie 08/31/2023, 07/03/2000) with just the date and not other text. ",
        "Relevant Entities": "{'cycle length': 20, 'Last menstrual date': '01/21/2004'}",
        "Ground Truth Answer": "02/04/2004",
        "Lower Limit": "02/04/2004",
        "Upper Limit": "02/04/2004",
        "Ground Truth Explanation": "The patient's estimated date of conception based on their last period is computed by adding to 2 weeks to the patient's last menstrual period date. The patient's last menstrual period was 01/21/2004. \nHence, the estimated date of conception after adding 2 weeks to the patient's last menstrual period date is 02-04-2004. ",
        "File Path": "camel/toolkits/medcalc_bench/estimated_conception_date.py",
        "Usr Msg": "The patient's last menstrual period was on 01/21/2004. Her cycle length is 20 days. Based on the patient's last menstrual period and cycle length, what is the the patient's estimated date of conception? Your answer should be in the format of M/D/Y (ie 08/31/2023, 07/03/2000) with just the date and not other text. "
    },
    {
        "Calculator ID": 69,
        "Calculator Name": "Estimated Gestational Age",
        "Category": "date",
        "Output Type": "date",
        "Note ID": "22",
        "Note Type": "Template",
        "Patient Note": "The patient's last menstrual period was on 01/06/2022. Today's date is 04/29/2022.",
        "Question": "Based on the patient's last menstrual period, what is the patient's estimated gestational age? Your answer should be a tuple, specifying the number of weeks and days (i.e. (4 weeks, 3 days), (0 weeks, 5 days), (1 week, 5 days), (8 weeks, 0 days)).",
        "Relevant Entities": "{'Current Date': '04/29/2022', 'Last menstrual date': '01/06/2022'}",
        "Ground Truth Answer": "('16 weeks', '1 days')",
        "Lower Limit": "('16 weeks', '1 days')",
        "Upper Limit": "('16 weeks', '1 days')",
        "Ground Truth Explanation": "To compute the estimated gestational age, we compute the number of weeks and days apart today's date is from the patient's last menstrual period date. The current date is 04/29/2022 and the patient's last menstrual period date was 01/06/2022. The gap between these two dates is 16 weeks and 1 days. Hence, the estimated gestational age is 16 weeks and 1 days. ",
        "File Path": "camel/toolkits/medcalc_bench/estimated_gestational_age.py",
        "Usr Msg": "The patient's last menstrual period was on 01/06/2022. Today's date is 04/29/2022. Based on the patient's last menstrual period, what is the patient's estimated gestational age? Your answer should be a tuple, specifying the number of weeks and days (i.e. (4 weeks, 3 days), (0 weeks, 5 days), (1 week, 5 days), (8 weeks, 0 days))."
    }
]